gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/QCSG_AFN04.c
/*************************************************
版  权:正泰仪表智能终端部
文  件:QCSG_AFN04.c
作  者:zhaoyun
版  本:1.00
日  期:20170601
描  述:南网AFN04处理文件
*************************************************/
/* Includes ------------------------------------------------------------------*/
#include <string.h>
#include <stdio.h>
#include "../Hcsg/ProjectCSG.h"
#include "../QCSG_Head/QCSG_UpLinkProtocol.h"
#include "../QCSG_Head/QCSG_LocalLinkProtocol.h"
#include "../QCSG_Head/QCSG_DLT645_Protocol.h"

#include "../QCSG_Head/Chint_Type.h"
#include "../QCSG_Head/QCSG_PublicDefine.h"
#include "../QCSG_Head/QCSG_PublicFunc.h"
#include "../QCSG_Data/QCSG_NandDataInterface.h"
#include "../QCSG_Head/QCSG_Table.h"
#include "../Device/MEMRW.h"
#include "../MS/MS.h"
#include "../Calculate/Calculate.h"
#include "../QCSG_Head/QCSG_Hal.h"
#include "../QCSG_Head/QCSG_AFN04.h"
#include "../STM32F4xx/STM32F4xx_UART.h"
#include "../STM32F4xx/STM32F4xx_DAC.h"

#include "Terminal_Task.h"
#include "../QCSG_Head/CH_AMR_TaskManage.h"
#include "../QCSG_Data/QCSG_DefaultData.h"
#include "../QCSG_Head/QCSG_AlarmEvent.h"


/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Public variables ----------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
/* Public functions ----------------------------------------------------------*/

/*****************************************************************************************************
功     能: 	南网上行协议写参数AFN=04操作
入口参 数: 	PORTn: 帧源端口号
			SrcFrame: 输入的源数据帧指针
			DstFrame: 输出的应答数据帧指针
返     回: 返回操作是否成功
编     写: zhaoyun
编写时 间; 2017-7-10
*****************************************************************************************************/
ResultEnum QCSG_AFN04_Resolve_ZY(u32 PORTn, QCSGFrameStruct* SrcFrame, QCSGFrameStruct* DstFrame)
{
	ResultEnum Result = NO_ERROR;
	QCSGFrameProcessStruct QCSGFp;
	u16 i = 0, TmpPnListNum = 0, LastPn = QCSG_INVALID_PN;
	u16* PnList = (u16*)(ADDR_PnListBuf);
	TerminalRunTimeCtrlStruct* pTSysCtrl = (TerminalRunTimeCtrlStruct*)ADDR_Terminal_RunTime;
	pTSysCtrl->LastPORTn = PORTn;
	
	MC(0,(u32)&QCSGFp, sizeof(QCSGFrameProcessStruct));
	QCSGFp.PORTn = PORTn;
	QCSGFp.UserDataLen = SrcFrame->DataLen;
	
//	if((PORTn == RS485_1PORT) || (PORTn == RS485_2PORT) || (PORTn == RS485_3PORT))
//	{
//		QCSGFp.SrcDataPos = QCSGFp.UserDataLen;
//	}

//	if((PORTn == IRPORT) && ((pTSysCtrl->Flag & TERMINAL_PROKEY_PRESS_FLAG) == 0))
//	{
//		QCSGFp.SrcDataPos = QCSGFp.UserDataLen;
//	}
	
    while(QCSGFp.SrcDataPos < QCSGFp.UserDataLen)
    {
		QCSGFp.Pn = QCSG_TakePn(&SrcFrame->Data[QCSGFp.SrcDataPos]);
		QCSGFp.SrcDataPos += 2;
		QCSGFp.CurDataID = QCSG_TakeFn(&SrcFrame->Data[QCSGFp.SrcDataPos]);
		QCSGFp.SrcDataPos += 4;
		QCSGFp.SrcDataPosCopy = QCSGFp.SrcDataPos;

		if(((QCSGFp.Pn & 0xFF00) == 0) && ((QCSGFp.Pn & 0x00FF) != 0))
		{
			TmpPnListNum = 1;
			PnList[0] = QCSGFp.Pn;
		}
		else
		{
			if(LastPn != QCSGFp.Pn)
			{
				TmpPnListNum = SplitPnToList(QCSGFp.Pn, PnList, PN_CHECK_DISABLE);			
				LastPn = QCSGFp.Pn; 
			}
		}
		
		i = 0;
		while(i < TmpPnListNum)
		{
			QCSGFp.TempPn = PnList[i];
			i++;
			QCSGFp.SrcDataPos = QCSGFp.SrcDataPosCopy;
			if((0xE0000100 <= QCSGFp.CurDataID) && ((0xE000012F >= QCSGFp.CurDataID)))
			{
				Result = QCSG_AFN04_E0000100_E000012F(SrcFrame, DstFrame, &QCSGFp);			  	// 通信参数
			}
			else if((QCSGFp.CurDataID >= 0xE0000130) && (QCSGFp.CurDataID <= 0xE0000174))  	// 时间参数、复位操作、告警屏蔽、结算日参数、身份认证
			{
				Result = QCSG_AFN04_E0000130_E0000174(SrcFrame, DstFrame, &QCSGFp);
			}
			else if((QCSGFp.CurDataID >= 0xE0000180) && (QCSGFp.CurDataID <= 0xE000018F))   	// 阀值参数
			{
				Result = QCSG_AFN04_E0000180_E000018F(SrcFrame, DstFrame, &QCSGFp);
			}
			else if((QCSGFp.CurDataID >= 0xE0000200) && (QCSGFp.CurDataID <= 0xE0000220))   	//抄表参数
			{
				Result = QCSG_AFN04_E0000200_E0000220(SrcFrame, DstFrame, &QCSGFp);
			}
			else if((QCSGFp.CurDataID >= 0xE0000221) && (QCSGFp.CurDataID <= 0xE0000250))   	//抄表通道配置表参数
			{
				Result = QCSG_AFN04_E0000221_E0000250(SrcFrame, DstFrame, &QCSGFp);
			}
			else if((QCSGFp.CurDataID >= 0xE0000300) && (QCSGFp.CurDataID <= 0xE00003FE))  	//任务参数  普通
			{
				Result = QCSG_AFN04_E0000300_E00003FE(SrcFrame, DstFrame, &QCSGFp);
			}
			else if((QCSGFp.CurDataID >= 0xE0000400) && (QCSGFp.CurDataID <= 0xE00004FE))  	//任务参数  中继
			{
				Result = QCSG_AFN04_E0000400_E00004FE(SrcFrame, DstFrame, &QCSGFp);
			}
			else if(((QCSGFp.CurDataID >= 0xE0000500) && (QCSGFp.CurDataID <= 0xE00005FF)) || (QCSGFp.CurDataID == 0xE0000900))  
			{
				Result = QCSG_AFN04_E0000500_E00005FF(SrcFrame, DstFrame, &QCSGFp);				//运算量参数   模拟量
			}
			else if((QCSGFp.CurDataID >= 0xE0000600) && (QCSGFp.CurDataID <= 0xE00006FF))  	//运算量参数   脉冲量
			{
				Result = QCSG_AFN04_E0000600_E00006FF(SrcFrame, DstFrame, &QCSGFp);
			}
			else if((QCSGFp.CurDataID >= 0xE0000700) && (QCSGFp.CurDataID <= 0xE00007FF))  	//运算量参数   运算量
			{
				Result = QCSG_AFN04_E0000700_E00007FF(SrcFrame, DstFrame, &QCSGFp);
			}
			else if((QCSGFp.CurDataID >= 0xE0000800) && (QCSGFp.CurDataID <= 0xE00008FF))  	//运算量参数   差动量
			{
				Result = QCSG_AFN04_E0000800_E00008FF(SrcFrame, DstFrame, &QCSGFp);
			}
			else if((QCSGFp.CurDataID >= 0xE0000A00) && (QCSGFp.CurDataID <= 0xE0000B02))  	//端口参数、级联参数、级联控制、版本参数    
			{
				Result = QCSG_AFN04_E0000A00_E0000B02(SrcFrame, DstFrame, &QCSGFp);
			}
			else if((QCSGFp.CurDataID >= 0xE0000C00) && (QCSGFp.CurDataID <= 0xE0000E11))  	//负荷管理参数
			{
				Result = QCSG_AFN04_E0000C00_E0000E11(SrcFrame, DstFrame, &QCSGFp);
			}
			else if((QCSGFp.CurDataID >= 0xE0001100) && (QCSGFp.CurDataID <= 0xE0002000))  	//测量点控制参数、用户自定义数据   
			{
				Result = QCSG_AFN04_E0001100_E0002000(SrcFrame, DstFrame, &QCSGFp);
			}
			else if((QCSGFp.CurDataID >= 0xE0003000) && (QCSGFp.CurDataID <= 0xE0003001))	//err20190403 自动搜表参数
			{
				Result = QCSG_AFN04_E0003000_E0003001(SrcFrame, DstFrame, &QCSGFp);
			}
			else if((QCSGFp.CurDataID >= 0xE0800000) && (QCSGFp.CurDataID <= 0xE080002F))  	//测量点参数
			{
				Result = QCSG_AFN04_E0800000_E080002F(SrcFrame, DstFrame, &QCSGFp);
			}
			else if((QCSGFp.CurDataID >= 0xE0800100) && (QCSGFp.CurDataID <= 0xE080020E))	//电能质量检测参数
			{
				Result = QCSG_AFN04_E0800100_E080020E(SrcFrame, DstFrame, &QCSGFp);
			}
			//else if((QCSGFp.CurDataID >= 0xE0AAAA00) && (QCSGFp.CurDataID <= 0xE0AAAA05))	//err20190403 ybwhz自定义
			//{
			//	Result = QCSG_AFN04_E0AAAA00_E0AAAA05(SrcFrame, DstFrame, &QCSGFp);			
			//}
			else
			{
				QCSGFp.SrcDataPos = QCSGFp.UserDataLen;
				Result = ERROR_NoSuchDataID;
			}
			DstFrame->Data[QCSGFp.DstDataPos++] = QCSGFp.TempPn;
			DstFrame->Data[QCSGFp.DstDataPos++] = QCSGFp.TempPn >> 8;
			DstFrame->Data[QCSGFp.DstDataPos++] = QCSGFp.CurDataID;
			DstFrame->Data[QCSGFp.DstDataPos++] = QCSGFp.CurDataID >> 8;
			DstFrame->Data[QCSGFp.DstDataPos++] = QCSGFp.CurDataID >> 16;
			DstFrame->Data[QCSGFp.DstDataPos++] = QCSGFp.CurDataID >> 24;
			DstFrame->Data[QCSGFp.DstDataPos++] = Result;	
			if(Result == NO_ERROR)
			{
				GenerateParaChangeEvent(QCSGFp.CurDataID);
			}
		}		
	}
	if(QCSGFp.DstDataPos == 0)
	{
		DstFrame->FC = (SrcFrame->FC & 0xFFF0) | QCSG_FC_PRM0_F9; //原代码:DstFrame->FC = SrcFrame->FC; err20180228-30 AFN=04
		DstFrame->FC |= QCSG_FC_DIR_BIT;
		DstFrame->FC &= ~QCSG_FC_PRM_BIT;	
		DstFrame->FC &= ~QCSG_FC_ACD_BIT;
		DstFrame->A1 = SrcFrame->A1;
		DstFrame->A2 = SrcFrame->A2;
		DstFrame->A3 = SrcFrame->A3;
		DstFrame->AFN = 00;
		DstFrame->SEQ = SrcFrame->SEQ & (~(QCSG_SEQ_TPV_BIT + QCSG_SEQ_CON_BIT));
		QCSGFp.DstDataPos = 0;
		DstFrame->Data[QCSGFp.DstDataPos++] = 0;
		DstFrame->Data[QCSGFp.DstDataPos++] = 0;
		DstFrame->Data[QCSGFp.DstDataPos++] = (u8)QCSG_FOR_ALL_DI;
		DstFrame->Data[QCSGFp.DstDataPos++] = (u8)(QCSG_FOR_ALL_DI >> 8);
		DstFrame->Data[QCSGFp.DstDataPos++] = (u8)(QCSG_FOR_ALL_DI >> 16);
		DstFrame->Data[QCSGFp.DstDataPos++] = (u8)(QCSG_FOR_ALL_DI >> 24);
		DstFrame->Data[QCSGFp.DstDataPos++] = QCSG_DENY;
		DstFrame->DataLen = QCSGFp.DstDataPos;
		return NO_ERROR;
	}
	
	DstFrame->FC = SrcFrame->FC;
	DstFrame->FC |= QCSG_FC_DIR_BIT;
	DstFrame->FC &= ~QCSG_FC_PRM_BIT;
	DstFrame->FC &= ~QCSG_FC_ACD_BIT;
	DstFrame->A1 = SrcFrame->A1;
	DstFrame->A2 = SrcFrame->A2;
	DstFrame->A3 = SrcFrame->A3;
	DstFrame->AFN = SrcFrame->AFN;
	DstFrame->SEQ = SrcFrame->SEQ & (~(QCSG_SEQ_TPV_BIT + QCSG_SEQ_CON_BIT));
	DstFrame->DataLen = QCSGFp.DstDataPos;
	return NO_ERROR;
}

ResultEnum QCSG_AFN04_E0000100_E000012F(QCSGFrameStruct* SrcFrame, QCSGFrameStruct* DstFrame, QCSGFrameProcessStruct* QCSGFp)
{
	ResultEnum Result = NO_ERROR;
	u8* pData = &SrcFrame->Data[QCSGFp->SrcDataPos];
	CommunicationParaStruct CommPara;
	#if ((Project/100 == 3) && (USER == 3400))
		E000011x_CommunicationParaStruct E0000111_CommPara;
		E000011x_CommunicationParaStruct E0000112_CommPara;
		E000011x_CommunicationParaStruct E0000113_CommPara;
		MemSet((u8*)&E0000111_CommPara, 0, sizeof(E000011x_CommunicationParaStruct));
		MemSet((u8*)&E0000112_CommPara, 0, sizeof(E000011x_CommunicationParaStruct));
		MemSet((u8*)&E0000113_CommPara, 0, sizeof(E000011x_CommunicationParaStruct));
		
	#endif	
	MemSet((u8*)&CommPara, 0, sizeof(CommunicationParaStruct));
	
	if(QCSGFp->TempPn == 0)
	{
		MR((u32)&CommPara, ADDR_CommunicationPara, sizeof(CommunicationParaStruct));
		#if ((Project/100 == 3) && (USER == 3400))//err20190528 增加云南负控GPRS自适应参数
			MR((u32)&E0000111_CommPara, ADDR_CommunicationPara_E0000111, sizeof(E000011x_CommunicationParaStruct));
			MR((u32)&E0000112_CommPara, ADDR_CommunicationPara_E0000112, sizeof(E000011x_CommunicationParaStruct));
			MR((u32)&E0000113_CommPara, ADDR_CommunicationPara_E0000113, sizeof(E000011x_CommunicationParaStruct));
		#endif
	}
	switch(QCSGFp->CurDataID)
	{
		case 0xE0000100:
			QCSGFp->SrcDataPos += 9;
			Result = QCSG_AFN04_E0000100_Write(pData, &CommPara);
			break;
		case 0xE0000101:
			QCSGFp->SrcDataPos += 9;
			Result = QCSG_AFN04_E0000101_Write(pData, &CommPara);
			break;
		case 0xE0000102:
			QCSGFp->SrcDataPos += 9;
			Result = QCSG_AFN04_E0000102_Write(pData, &CommPara);
			break;
		case 0xE0000103:
			QCSGFp->SrcDataPos += 8;
			Result = QCSG_AFN04_E0000103_Write(pData, &CommPara);
			break;
		case 0xE0000104:
			QCSGFp->SrcDataPos += 16;
			Result = QCSG_AFN04_E0000104_Write(pData, &CommPara);
			break;
		case 0xE0000105:
			QCSGFp->SrcDataPos += 32;
			Result = QCSG_AFN04_E0000105_Write(pData, &CommPara);
			break;
		case 0xE0000106:
			QCSGFp->SrcDataPos += 32;
			Result = QCSG_AFN04_E0000106_Write(pData, &CommPara);
			break;
		case 0xE0000107:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E0000107_Write(pData, &CommPara);
			break;
		case 0xE0000108:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E0000108_Write(pData, &CommPara);
			break;
		case 0xE0000109:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E0000109_Write(pData, &CommPara);
			break;
		case 0xE000010A:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E000010A_Write(pData, &CommPara);
			break;
		case 0xE000010B:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E000010B_Write(pData, &CommPara);
			break;
		case 0xE000010F:
			QCSGFp->SrcDataPos += 120;
			Result = QCSG_AFN04_E000010F_Write(pData, &CommPara);
			break;
			
	#if ((Project/100 == 3) && (USER == 3400))//err20190528 增加云南负控GPRS自适应参数
		case 0xE0000111://err20190528 增加自适应参数对应数据标识
			QCSGFp->SrcDataPos += 420;
			Result = QCSG_AFN04_E0000111_Write(pData, &E0000111_CommPara);
			break;
		case 0xE0000112:
			QCSGFp->SrcDataPos += 420;
			Result = QCSG_AFN04_E0000112_Write(pData, &E0000112_CommPara);
			break;
		case 0xE0000113:
			QCSGFp->SrcDataPos += 420;
			Result = QCSG_AFN04_E0000113_Write(pData, &E0000113_CommPara);
			break;
	#endif
			
		case 0xE0000120:
			QCSGFp->SrcDataPos += 3;
			Result = QCSG_AFN04_E0000120_Write(pData, &CommPara);
			break;
		case 0xE0000121:
			QCSGFp->SrcDataPos += 3;
			Result = QCSG_AFN04_E0000121_Write(pData, &CommPara);
			break;
		case 0xE0000122:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E0000122_Write(pData, &CommPara);
			break;
		case 0xE0000123:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E0000123_Write(pData, &CommPara);
			break;
		case 0xE0000124:
			QCSGFp->SrcDataPos += 4;
			Result = QCSG_AFN04_E0000124_Write(pData, &CommPara);
			break;
		case 0xE0000125:
			QCSGFp->SrcDataPos += 4;
			Result = QCSG_AFN04_E0000125_Write(pData, &CommPara);
			break;
		case 0xE0000126:
			QCSGFp->SrcDataPos += 4;
			Result = QCSG_AFN04_E0000126_Write(pData, &CommPara);
			break;
		case 0xE0000127:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E0000127_Write(pData, &CommPara);
			break;
		case 0xE000012F:
			QCSGFp->SrcDataPos += 22;
			Result = QCSG_AFN04_E000012F_Write(pData, &CommPara);
			break;
		default:
			QCSGFp->SrcDataPos = QCSGFp->UserDataLen;
			Result = ERROR_NoSuchDataID;
			break;			
	}
	
	if(QCSGFp->TempPn == 0)
	{
		if(Result == NO_ERROR)
		{
			MW((u32)&CommPara, ADDR_CommunicationPara, sizeof(CommunicationParaStruct));
			#if ((Project/100 == 3) && (USER == 3400))//err20190528 增加云南负控GPRS自适应参数
				MW((u32)&E0000111_CommPara, ADDR_CommunicationPara_E0000111, sizeof(E000011x_CommunicationParaStruct));
				MW((u32)&E0000112_CommPara, ADDR_CommunicationPara_E0000112, sizeof(E000011x_CommunicationParaStruct));
				MW((u32)&E0000113_CommPara, ADDR_CommunicationPara_E0000113, sizeof(E000011x_CommunicationParaStruct));
			#endif
		}
	}
	else
	{
		Result = ERROR_VerifyFail;
	}
	return Result;
}

ResultEnum QCSG_AFN04_E0000100_Write(u8* Data, CommunicationParaStruct* Para)
{	
	TerminalRunTimeCtrlStruct* pTSysCtrl = (TerminalRunTimeCtrlStruct*)ADDR_Terminal_RunTime;
	if((Data[8] != MASTER_CH_TYPE_GPRS) && (Data[8] != MASTER_CH_TYPE_PSTN) &&
	   (Data[8] != MASTER_CH_TYPE_ETHE) && (Data[8] != MASTER_CH_TYPE_RS232) &&
	   (Data[8] != MASTER_CH_TYPE_CSD)  && (Data[8] != MASTER_CH_TYPE_RADIO))
	{
		return ERROR_InvalidData;
	}
	if((Data[8] == MASTER_CH_TYPE_GPRS) || (Data[8] == MASTER_CH_TYPE_ETHE))
	{
		if(*(u16*)Data < MIN_TCP_PORT_ID) return ERROR_InvalidData;
	}
	if((MemCompare(Para->MasterAddr, Data, COMM_AADR_SIZE) != 0) || (Para->MasterAddrType != Data[8]))
	{
		pTSysCtrl->Flag |= TERMINAL_COMM_PARA_CHANGE_FLAG;
	}
	Para->MasterAddrType = Data[8];
	MemCopy(Para->MasterAddr, Data, COMM_AADR_SIZE);	
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000101_Write(u8* Data, CommunicationParaStruct* Para)
{
#if (TEST_ON == 0)
	TerminalRunTimeCtrlStruct* pTSysCtrl = (TerminalRunTimeCtrlStruct*)ADDR_Terminal_RunTime;
#endif
	if((Data[8] != MASTER_CH_TYPE_GPRS) && (Data[8] != MASTER_CH_TYPE_PSTN) &&
	   (Data[8] != MASTER_CH_TYPE_ETHE) && (Data[8] != MASTER_CH_TYPE_RS232) &&
	   (Data[8] != MASTER_CH_TYPE_CSD)  && (Data[8] != MASTER_CH_TYPE_RADIO))
	{
		return ERROR_InvalidData;
	}
	if((Data[8] == MASTER_CH_TYPE_GPRS) || (Data[8] == MASTER_CH_TYPE_ETHE))
	{
		if(*(u16*)Data < MIN_TCP_PORT_ID) return ERROR_InvalidData;
	}

	if((MemCompare(Para->MasterBackAddr1, Data, COMM_AADR_SIZE) != 0) || (Para->MasterBackAddr1Type != Data[8]))
	{
#if (TEST_ON == 0)
		pTSysCtrl->Flag |= TERMINAL_COMM_PARA_CHANGE_FLAG;
#endif
	}
	Para->MasterBackAddr1Type = Data[8];
	MemCopy(Para->MasterBackAddr1, Data, COMM_AADR_SIZE);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000102_Write(u8* Data, CommunicationParaStruct* Para)
{
#if (TEST_ON == 0)
	TerminalRunTimeCtrlStruct* pTSysCtrl = (TerminalRunTimeCtrlStruct*)ADDR_Terminal_RunTime;
#endif
	if((Data[8] != MASTER_CH_TYPE_GPRS) && (Data[8] != MASTER_CH_TYPE_PSTN) &&
	   (Data[8] != MASTER_CH_TYPE_ETHE) && (Data[8] != MASTER_CH_TYPE_RS232) &&
	   (Data[8] != MASTER_CH_TYPE_CSD)  && (Data[8] != MASTER_CH_TYPE_RADIO))
	{
		return ERROR_InvalidData;
	}
	if((Data[8] == MASTER_CH_TYPE_GPRS) || (Data[8] == MASTER_CH_TYPE_ETHE))
	{
		if(*(u16*)Data < MIN_TCP_PORT_ID) return ERROR_InvalidData;
	}

	if((MemCompare(Para->MasterBackAddr2, Data, COMM_AADR_SIZE) != 0) || (Para->MasterBackAddr2Type != Data[8]))
	{
#if (TEST_ON == 0)
		pTSysCtrl->Flag |= TERMINAL_COMM_PARA_CHANGE_FLAG;
#endif
	}
	Para->MasterBackAddr2Type = Data[8];
	MemCopy(Para->MasterBackAddr2, Data, COMM_AADR_SIZE);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000103_Write(u8* Data, CommunicationParaStruct* Para)
{
	TerminalRunTimeCtrlStruct* pTSysCtrl = (TerminalRunTimeCtrlStruct*)ADDR_Terminal_RunTime;
	
	if(*(u16*)Data < MIN_TCP_PORT_ID) return ERROR_InvalidData;

	if(MemCompare(Para->GateWayAddr, Data, COMM_AADR_SIZE) != 0) pTSysCtrl->Flag |= TERMINAL_COMM_PARA_CHANGE_FLAG;
	MemCopy(Para->GateWayAddr, Data, COMM_AADR_SIZE);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000104_Write(u8* Data, CommunicationParaStruct* Para)
{
	TerminalRunTimeCtrlStruct* pTSysCtrl = (TerminalRunTimeCtrlStruct*)ADDR_Terminal_RunTime;

