gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/QCSG_AFN04.c
	if(MemCompare(Para->APN, Data, APN_NAME_MAX_SIZE) != 0) pTSysCtrl->Flag |= TERMINAL_COMM_PARA_CHANGE_FLAG;
	MemCopy(Para->APN, Data, APN_NAME_MAX_SIZE);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000105_Write(u8* Data, CommunicationParaStruct* Para)
{
	TerminalRunTimeCtrlStruct* pTSysCtrl = (TerminalRunTimeCtrlStruct*)ADDR_Terminal_RunTime;

	if(MemCompare(Para->APNUserName, Data, APN_USER_NAME_MAX_SIZE) != 0) pTSysCtrl->Flag |= TERMINAL_COMM_PARA_CHANGE_FLAG;
	MemCopy(Para->APNUserName, Data, APN_USER_NAME_MAX_SIZE);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000106_Write(u8* Data, CommunicationParaStruct* Para)
{
	TerminalRunTimeCtrlStruct* pTSysCtrl = (TerminalRunTimeCtrlStruct*)ADDR_Terminal_RunTime;

	if(MemCompare(Para->APNPassWord, Data, APN_USER_PWD_MAX_SIZE) != 0) pTSysCtrl->Flag |= TERMINAL_COMM_PARA_CHANGE_FLAG;
	MemCopy(Para->APNPassWord, Data, APN_USER_PWD_MAX_SIZE);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000107_Write(u8* Data, CommunicationParaStruct* Para)
{
	if(BCD_Check(Data, 1) != NO_ERROR) return ERROR_InvalidData;
	Para->HeartBeatTimeGap = Data[0];
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000108_Write(u8* Data, CommunicationParaStruct* Para)
{
	if(BCD_Check(Data, 1) != NO_ERROR) return ERROR_InvalidData;
	Para->RedialTimeGap = Data[0];
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000109_Write(u8* Data, CommunicationParaStruct* Para)
{
	if(BCD_Check(Data, 1) != NO_ERROR) return ERROR_InvalidData;
	Para->RedialCnt = Data[0];
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E000010A_Write(u8* Data, CommunicationParaStruct* Para)
{
	TerminalRunTimeCtrlStruct* pTSysCtrl = (TerminalRunTimeCtrlStruct*)ADDR_Terminal_RunTime;
	
	if(Data[0] > 0x01) return ERROR_InvalidData;
	if(Para->IpLinkType != Data[0]) pTSysCtrl->Flag |= TERMINAL_COMM_PARA_CHANGE_FLAG;
	Para->IpLinkType = Data[0];
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E000010B_Write(u8* Data, CommunicationParaStruct* Para)
{
	if(Data[0] > 0x01) return ERROR_InvalidData;
	Para->CompressType = Data[0];
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E000010F_Write(u8* Data, CommunicationParaStruct* Para)
{
	ResultEnum Result = NO_ERROR;
	Result += QCSG_AFN04_E0000100_Write(Data, Para);
	Data += 9;
	Result += QCSG_AFN04_E0000101_Write(Data, Para);
	Data += 9;
	Result += QCSG_AFN04_E0000102_Write(Data, Para);
	Data += 9;
	Result += QCSG_AFN04_E0000103_Write(Data, Para);
	Data += 8;
	Result += QCSG_AFN04_E0000104_Write(Data, Para);
	Data += 16;
	Result += QCSG_AFN04_E0000105_Write(Data, Para);
	Data += 32;
	Result += QCSG_AFN04_E0000106_Write(Data, Para);
	Data += 32;
	Result += QCSG_AFN04_E0000107_Write(Data, Para);
	Data += 1;
	Result += QCSG_AFN04_E0000108_Write(Data, Para);
	Data += 1;
	Result += QCSG_AFN04_E0000109_Write(Data, Para);
	Data += 1;
	Result += QCSG_AFN04_E000010A_Write(Data, Para);
	Data += 1;
	Result += QCSG_AFN04_E000010B_Write(Data, Para);
	Data += 1;
	if(Result != NO_ERROR)
	{
		Result = ERROR_InvalidData;
	}
	return Result;	
}

//err20190528 移动自适应参数
ResultEnum QCSG_AFN04_E0000111_Write(u8* Data, E000011x_CommunicationParaStruct* Para)
{
	//参数暂时不做限制
	//TerminalRunTimeCtrlStruct* pTSysCtrl = (TerminalRunTimeCtrlStruct*)ADDR_Terminal_RunTime;
	//if(Data[8] != MASTER_CH_TYPE_GPRS)	return ERROR_InvalidData;//限制通信类型必须是GPRS
	//if(*(u16*)Data < MIN_TCP_PORT_ID) return ERROR_InvalidData;//限制端口号必须大于1024
	
	//if((MemCompare(Para->MasterAddr, Data, COMM_AADR_SIZE) != 0) || (Para->MasterAddrType != Data[8]))
	//{
	//	pTSysCtrl->Flag |= TERMINAL_COMM_PARA_CHANGE_FLAG;
	//}
	//Para->MasterAddrType = Data[8];
	MemCopy(Para->MasterAddr,&Data[0], COMM_AADR_SIZE);	
	MemCopy(Para->MasterBackAddr1,&Data[9], COMM_AADR_SIZE);	
	MemCopy(Para->MasterBackAddr2,&Data[18], COMM_AADR_SIZE);	
	MemCopy(Para->GateWayAddr,&Data[27], COMM_AADR_SIZE);

	Para->MasterAddrType = MASTER_CH_TYPE_GPRS;
	Para->MasterBackAddr1Type = MASTER_CH_TYPE_GPRS;
	Para->MasterBackAddr2Type = MASTER_CH_TYPE_GPRS;
	Para->MasterBackAddr3Type = MASTER_CH_TYPE_GPRS;

	MemCopy(Para->APN1,&Data[36], APN_USER_NAME_MAX_SIZE);	//此处为32字节
	MemCopy(Para->APN1UserName,&Data[68], APN_USER_NAME_MAX_SIZE);	
	MemCopy(Para->APN1PassWord,&Data[100], APN_USER_PWD_MAX_SIZE);	

	MemCopy(Para->APN2,&Data[132], APN_USER_NAME_MAX_SIZE);	
	MemCopy(Para->APN2UserName,&Data[164], APN_USER_NAME_MAX_SIZE);	
	MemCopy(Para->APN2PassWord,&Data[196], APN_USER_PWD_MAX_SIZE);	

	MemCopy(Para->APN3,&Data[228], APN_USER_NAME_MAX_SIZE);	
	MemCopy(Para->APN3UserName,&Data[260], APN_USER_NAME_MAX_SIZE);	
	MemCopy(Para->APN3PassWord,&Data[292], APN_USER_PWD_MAX_SIZE);	

	MemCopy(Para->APN4,&Data[324], APN_USER_NAME_MAX_SIZE);	
	MemCopy(Para->APN4UserName,&Data[356], APN_USER_NAME_MAX_SIZE);	
	MemCopy(Para->APN4PassWord,&Data[388], APN_USER_PWD_MAX_SIZE);	
	
	return NO_ERROR;	
}

//err20190528 联通自适应参数
ResultEnum QCSG_AFN04_E0000112_Write(u8* Data, E000011x_CommunicationParaStruct* Para)
{
	//参数暂时不做限制
	//TerminalRunTimeCtrlStruct* pTSysCtrl = (TerminalRunTimeCtrlStruct*)ADDR_Terminal_RunTime;
	//if(Data[8] != MASTER_CH_TYPE_GPRS)	return ERROR_InvalidData;//限制通信类型必须是GPRS
	//if(*(u16*)Data < MIN_TCP_PORT_ID) return ERROR_InvalidData;//限制端口号必须大于1024
	
	//if((MemCompare(Para->MasterAddr, Data, COMM_AADR_SIZE) != 0) || (Para->MasterAddrType != Data[8]))
	//{
	//	pTSysCtrl->Flag |= TERMINAL_COMM_PARA_CHANGE_FLAG;
	//}
	//Para->MasterAddrType = Data[8];
	MemCopy(Para->MasterAddr,&Data[0], COMM_AADR_SIZE);	
	MemCopy(Para->MasterBackAddr1,&Data[9], COMM_AADR_SIZE);	
	MemCopy(Para->MasterBackAddr2,&Data[18], COMM_AADR_SIZE);	
	MemCopy(Para->GateWayAddr,&Data[27], COMM_AADR_SIZE);

	Para->MasterAddrType = MASTER_CH_TYPE_GPRS;
	Para->MasterBackAddr1Type = MASTER_CH_TYPE_GPRS;
	Para->MasterBackAddr2Type = MASTER_CH_TYPE_GPRS;
	Para->MasterBackAddr3Type = MASTER_CH_TYPE_GPRS;

	MemCopy(Para->APN1,&Data[36], APN_USER_NAME_MAX_SIZE);	//此处为32字节
	MemCopy(Para->APN1UserName,&Data[68], APN_USER_NAME_MAX_SIZE);	
	MemCopy(Para->APN1PassWord,&Data[100], APN_USER_PWD_MAX_SIZE);	

	MemCopy(Para->APN2,&Data[132], APN_USER_NAME_MAX_SIZE);	
	MemCopy(Para->APN2UserName,&Data[164], APN_USER_NAME_MAX_SIZE);	
	MemCopy(Para->APN2PassWord,&Data[196], APN_USER_PWD_MAX_SIZE);	

	MemCopy(Para->APN3,&Data[228], APN_USER_NAME_MAX_SIZE);	
	MemCopy(Para->APN3UserName,&Data[260], APN_USER_NAME_MAX_SIZE);	
	MemCopy(Para->APN3PassWord,&Data[292], APN_USER_PWD_MAX_SIZE);	

	MemCopy(Para->APN4,&Data[324], APN_USER_NAME_MAX_SIZE);	
	MemCopy(Para->APN4UserName,&Data[356], APN_USER_NAME_MAX_SIZE);	
	MemCopy(Para->APN4PassWord,&Data[388], APN_USER_PWD_MAX_SIZE);	
	
	return NO_ERROR;	
}

