gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/QCSG_AFN04.c
//err20190528 电信自适应参数
ResultEnum QCSG_AFN04_E0000113_Write(u8* Data, E000011x_CommunicationParaStruct* Para)
{
	//参数暂时不做限制
	//TerminalRunTimeCtrlStruct* pTSysCtrl = (TerminalRunTimeCtrlStruct*)ADDR_Terminal_RunTime;
	//if(Data[8] != MASTER_CH_TYPE_GPRS)	return ERROR_InvalidData;//限制通信类型必须是GPRS
	//if(*(u16*)Data < MIN_TCP_PORT_ID) return ERROR_InvalidData;//限制端口号必须大于1024
	
	//if((MemCompare(Para->MasterAddr, Data, COMM_AADR_SIZE) != 0) || (Para->MasterAddrType != Data[8]))
	//{
	//	pTSysCtrl->Flag |= TERMINAL_COMM_PARA_CHANGE_FLAG;
	//}
	//Para->MasterAddrType = Data[8];
	MemCopy(Para->MasterAddr,&Data[0], COMM_AADR_SIZE);	
	MemCopy(Para->MasterBackAddr1,&Data[9], COMM_AADR_SIZE);	
	MemCopy(Para->MasterBackAddr2,&Data[18], COMM_AADR_SIZE);	
	MemCopy(Para->GateWayAddr,&Data[27], COMM_AADR_SIZE);

	Para->MasterAddrType = MASTER_CH_TYPE_GPRS;
	Para->MasterBackAddr1Type = MASTER_CH_TYPE_GPRS;
	Para->MasterBackAddr2Type = MASTER_CH_TYPE_GPRS;
	Para->MasterBackAddr3Type = MASTER_CH_TYPE_GPRS;

	MemCopy(Para->APN1,&Data[36], APN_USER_NAME_MAX_SIZE);	//此处为32字节
	MemCopy(Para->APN1UserName,&Data[68], APN_USER_NAME_MAX_SIZE);	
	MemCopy(Para->APN1PassWord,&Data[100], APN_USER_PWD_MAX_SIZE);	

	MemCopy(Para->APN2,&Data[132], APN_USER_NAME_MAX_SIZE);	
	MemCopy(Para->APN2UserName,&Data[164], APN_USER_NAME_MAX_SIZE);	
	MemCopy(Para->APN2PassWord,&Data[196], APN_USER_PWD_MAX_SIZE);	

	MemCopy(Para->APN3,&Data[228], APN_USER_NAME_MAX_SIZE);	
	MemCopy(Para->APN3UserName,&Data[260], APN_USER_NAME_MAX_SIZE);	
	MemCopy(Para->APN3PassWord,&Data[292], APN_USER_PWD_MAX_SIZE);	

	MemCopy(Para->APN4,&Data[324], APN_USER_NAME_MAX_SIZE);	
	MemCopy(Para->APN4UserName,&Data[356], APN_USER_NAME_MAX_SIZE);	
	MemCopy(Para->APN4PassWord,&Data[388], APN_USER_PWD_MAX_SIZE);	
	
	return NO_ERROR;	
}


ResultEnum QCSG_AFN04_E0000120_Write(u8* Data, CommunicationParaStruct* Para)
{
	TerminalRunTimeCtrlStruct* pTSysCtrl = (TerminalRunTimeCtrlStruct*)ADDR_Terminal_RunTime;
	if(BCD_Check(Data, 3) != NO_ERROR) return ERROR_InvalidData;
	MemCopy((u8*)&Para->TerminalLocationCode, Data, 3);
	if(pTSysCtrl->TerminalLocation != Para->TerminalLocationCode) pTSysCtrl->Flag |= TERMINAL_ADDR_CHANGE_FLAG;
	pTSysCtrl->TerminalLocation = Para->TerminalLocationCode;
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000121_Write(u8* Data, CommunicationParaStruct* Para)
{
	TerminalRunTimeCtrlStruct* pTSysCtrl = (TerminalRunTimeCtrlStruct*)ADDR_Terminal_RunTime;
	MemCopy((u8*)&Para->TerminalAddr, Data, 3);
	if(pTSysCtrl->TerminalAddr != Para->TerminalAddr) pTSysCtrl->Flag |= TERMINAL_ADDR_CHANGE_FLAG;
	pTSysCtrl->TerminalAddr = Para->TerminalAddr;
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000122_Write(u8* Data, CommunicationParaStruct* Para)
{
	TerminalRunTimeCtrlStruct* pTSysCtrl = (TerminalRunTimeCtrlStruct*)ADDR_Terminal_RunTime;
	
	if(Data[0] > 0x02) return ERROR_InvalidData;
	if(Para->CommunicationMode != Data[0]) pTSysCtrl->Flag |= TERMINAL_COMM_PARA_CHANGE_FLAG;
	Para->CommunicationMode = Data[0];
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000123_Write(u8* Data, CommunicationParaStruct* Para)
{
	TerminalRunTimeCtrlStruct* pTSysCtrl = (TerminalRunTimeCtrlStruct*)ADDR_Terminal_RunTime;

	if(MemCompare((u8*)&Para->TcpPortNumber, Data, 2) != 0) pTSysCtrl->Flag |= TERMINAL_COMM_PARA_CHANGE_FLAG;
	MemCopy((u8*)&Para->TcpPortNumber, Data, 2);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000124_Write(u8* Data, CommunicationParaStruct* Para)
{
	TerminalRunTimeCtrlStruct* pTSysCtrl = (TerminalRunTimeCtrlStruct*)ADDR_Terminal_RunTime;

	if(MemCompare((u8*)&Para->IpAddr, Data, 4) != 0) pTSysCtrl->Flag |= TERMINAL_COMM_PARA_CHANGE_FLAG;
	MemCopy((u8*)&Para->IpAddr, Data, 4);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000125_Write(u8* Data, CommunicationParaStruct* Para)
{
	TerminalRunTimeCtrlStruct* pTSysCtrl = (TerminalRunTimeCtrlStruct*)ADDR_Terminal_RunTime;

	if(MemCompare((u8*)&Para->IpSubNetMask, Data, 4) != 0) pTSysCtrl->Flag |= TERMINAL_COMM_PARA_CHANGE_FLAG;
	MemCopy((u8*)&Para->IpSubNetMask, Data, 4);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000126_Write(u8* Data, CommunicationParaStruct* Para)
{
	TerminalRunTimeCtrlStruct* pTSysCtrl = (TerminalRunTimeCtrlStruct*)ADDR_Terminal_RunTime;

	if(MemCompare((u8*)&Para->IpGateWayAddr, Data, 4) != 0) pTSysCtrl->Flag |= TERMINAL_COMM_PARA_CHANGE_FLAG;
	MemCopy((u8*)&Para->IpGateWayAddr, Data, 4);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000127_Write(u8* Data, CommunicationParaStruct* Para)
{
	TerminalRunTimeCtrlStruct* pTSysCtrl = (TerminalRunTimeCtrlStruct*)ADDR_Terminal_RunTime;
	
	if(Data[0] > 0x01) return ERROR_InvalidData;
	if(Para->IpAddrAccessType != Data[0]) pTSysCtrl->Flag |= TERMINAL_COMM_PARA_CHANGE_FLAG;
	Para->IpAddrAccessType = Data[0];
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E000012F_Write(u8* Data, CommunicationParaStruct* Para)
{
	ResultEnum Result = NO_ERROR;
	Result += QCSG_AFN04_E0000120_Write(Data, Para);
	Data += 3;
	Result += QCSG_AFN04_E0000121_Write(Data, Para);
	Data += 3;
	Result += QCSG_AFN04_E0000122_Write(Data, Para);
	Data += 1;
	Result += QCSG_AFN04_E0000123_Write(Data, Para);
	Data += 2;
	Result += QCSG_AFN04_E0000124_Write(Data, Para);
	Data += 4;
	Result += QCSG_AFN04_E0000125_Write(Data, Para);
	Data += 4;
	Result += QCSG_AFN04_E0000126_Write(Data, Para);
	Data += 4;
	Result += QCSG_AFN04_E0000127_Write(Data, Para);
	Data += 1;

	if(Result != NO_ERROR)
	{
		Result = ERROR_InvalidData;
	}
	return Result;
}


ResultEnum QCSG_AFN04_E0000130_E0000174(QCSGFrameStruct* SrcFrame, QCSGFrameStruct* DstFrame, QCSGFrameProcessStruct* QCSGFp)
{
	ResultEnum Result = NO_ERROR;
	u8* pData = &SrcFrame->Data[QCSGFp->SrcDataPos];
	u32 WriteLen = 0;
	u8 DataBuf[100];//err20180710 每日上报一次的告警标识，需掉电存储
	SettleDateParaStruct* pSettleDate = (SettleDateParaStruct*)DataBuf;
	AlarmEventMaskParaStruct* pAlarmEventMask = (AlarmEventMaskParaStruct*)DataBuf;	
	IDAuthenticationParaStruct* pIDAuthentication = (IDAuthenticationParaStruct*)DataBuf;
	#if ((Project/100) == 3)
		u8 u8PnNum = 0,i = 0;
		u8 u8MeterId[6];
		u32 u32RevLen = 0;
		ERD09Struct stERD09Data;
		RealTimeYYStruct stYYTime;
		TIME_PARAM_S pstTime;			
		QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
		QCSG_RAM_DATA_S* pstRam_Data = NULL;
	#endif
#if (TEST_ON == 1)
	TerminalRunTimeCtrlStruct* pTSysCtrl;
#endif
	
