gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/QCSG_AFN04.c
	MemSet(DataBuf, 0, 100);
	switch(QCSGFp->CurDataID)
	{
		case 0xE0000130:
			QCSGFp->SrcDataPos += 6;
			if(QCSGFp->TempPn == 0)
			{
				WriteLen = 6;
				Result = NAND_WritePara(PARA_RealTime, QCSGFp->Pn, QCSGFp->CurDataID, pData, &WriteLen);

				//err20181107 增加事件 负控 终端校时记录事件
			#if ((Project/100) == 3)
				HAL_GetSystemTime(&pstTime);
				
				if(QCSG_CheckEventMask(0xE2010010) == TRUE)
				{
					u8PnNum = pstPn_Ram_Data->u8PnNum;
					for(i = 0;i < u8PnNum;i++)
					{
						//寻找内存中记录的测量点数据信息
						if(0 == pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn)
						{
							pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[i];
							break;
						}
					}	
					if(i >= u8PnNum)
					{
						Result = ERROR_VerifyFail;
						return Result;
					}	
					MemCopy(&stERD09Data.Time,&pstTime,sizeof(TIME_PARAM_S));
					MemCopy(stERD09Data.C_00010000,pstRam_Data->u8Data00010000,4);
					MemCopy(stERD09Data.C_00020000,pstRam_Data->u8Data00020000,4);

					GetACSampleAddr(u8MeterId);	//取交采地址
					//记录事件
					MemSet(&stYYTime,0,sizeof(stYYTime));
					//RD_Time_TO_YYTime(&pstTime,&stYYTime);//转换时间格式
					stYYTime.YearH = 0x20;
					stYYTime.YearL = pstTime.u8Year;
					stYYTime.Month = pstTime.u8Month;
					stYYTime.Day = pstTime.u8Day;
					stYYTime.Hour = pstTime.u8Hour;
					stYYTime.Minute = pstTime.u8Minute;
					
					u32RevLen = sizeof(stERD09Data);
					NAND_WriteEventRecord(u8MeterId,0xE2010010,&stYYTime,(u8*)&stERD09Data,&u32RevLen);
				}
			#endif
			
			}
			else
			{
				Result = ERROR_VerifyFail;
			}			
			break;
		case 0xE0000131:
			QCSGFp->SrcDataPos += 4;
			if(QCSGFp->TempPn == 0)
			{
				Result = QCSG_AFN04_E0000131_Write(pData, QCSGFp, SrcFrame);
			}
			else
			{
				Result = ERROR_VerifyFail;
			}
			break;
		case 0xE0000140:
			QCSGFp->SrcDataPos += 1;
			if(QCSGFp->TempPn == 0)
			{
				Result = QCSG_AFN04_E0000140_Write(pData, QCSGFp);
			}
			else
			{
				Result = ERROR_VerifyFail;
			}	
			break;
		case 0xE0000150:
			QCSGFp->SrcDataPos += 32;
			if(QCSGFp->TempPn == 0)
			{
				MR((u32)pAlarmEventMask, ADDR_AlarmEventMaskPara, sizeof(AlarmEventMaskParaStruct));
				MemCopy(pAlarmEventMask->AlarmReportMask, pData, 32);
				MW((u32)pAlarmEventMask, ADDR_AlarmEventMaskPara, sizeof(AlarmEventMaskParaStruct));
#if (TEST_ON == 1)
				pTSysCtrl = (TerminalRunTimeCtrlStruct*)ADDR_Terminal_RunTime;
				TerminalReportCheckAlarm(pTSysCtrl);//err20180627 台体测试时 设置完150屏蔽字后将所有未上报告警全部上报。
#endif
			}
			else
			{
				Result = ERROR_VerifyFail;
			}	
			break;
		case 0xE0000151:
			QCSGFp->SrcDataPos += 32;
			if(QCSGFp->TempPn == 0)
			{
				MR((u32)pAlarmEventMask, ADDR_AlarmEventMaskPara, sizeof(AlarmEventMaskParaStruct));
				MemCopy(pAlarmEventMask->AlarmJudgeMask, pData, 32);
				MW((u32)pAlarmEventMask, ADDR_AlarmEventMaskPara, sizeof(AlarmEventMaskParaStruct));
			}
			else
			{
				Result = ERROR_VerifyFail;
			}
			break;
		case 0xE0000152:
			QCSGFp->SrcDataPos += 32;
			if(QCSGFp->TempPn == 0)
			{
				MR((u32)pAlarmEventMask, ADDR_AlarmEventMaskPara, sizeof(AlarmEventMaskParaStruct));
				MemCopy(pAlarmEventMask->EventRecordMask, pData, 32);
				MW((u32)pAlarmEventMask, ADDR_AlarmEventMaskPara, sizeof(AlarmEventMaskParaStruct));
			}
			else
			{
				Result = ERROR_VerifyFail;
			}
			break;
		case 0xE0000160:
			QCSGFp->SrcDataPos += 2;
			if((QCSGFp->TempPn == 0) && (BCD_Check(pData, 2) == NO_ERROR) && (pData[1] <= HOUR_BCD_MAX) && 
			   (pData[0] >= DAY_BCD_MIN) && (pData[0] < DAY_BCD_MAX))
			{
				MR((u32)pSettleDate, ADDR_SettlementDatePara, sizeof(SettleDateParaStruct));
				pSettleDate->MonthPowerSettleDay = pData[0];
				pSettleDate->MonthPowerSettleHour = pData[1];
				MW((u32)pSettleDate, ADDR_SettlementDatePara, sizeof(SettleDateParaStruct));
			}
			else
			{
				if(QCSGFp->TempPn != 0)
				{
					Result = ERROR_VerifyFail;
				}
				else
				{
					Result = ERROR_InvalidData;
				}
			}
			break;
		case 0xE0000161:
			QCSGFp->SrcDataPos += 1;
			if((QCSGFp->TempPn == 0) && (BCD_Check(pData, 1) == NO_ERROR) && (pData[0] <= HOUR_BCD_MAX))
			{
				MR((u32)pSettleDate, ADDR_SettlementDatePara, sizeof(SettleDateParaStruct));
				pSettleDate->DayPowerSettleHour = pData[0];
				MW((u32)pSettleDate, ADDR_SettlementDatePara, sizeof(SettleDateParaStruct));
			}
			else
			{
				if(QCSGFp->TempPn != 0)
				{
					Result = ERROR_VerifyFail;
				}
				else
				{
					Result = ERROR_InvalidData;
				}
			}
			break;
		case 0xE0000162:
			QCSGFp->SrcDataPos += 2;
			if((QCSGFp->TempPn == 0) && (BCD_Check(pData, 2) == NO_ERROR) && (pData[1] <= HOUR_BCD_MAX) && 
			   (pData[0] >= DAY_BCD_MIN) && (pData[0] < DAY_BCD_MAX))
			{
				MR((u32)pSettleDate, ADDR_SettlementDatePara, sizeof(SettleDateParaStruct));
				pSettleDate->MonthVoltageSettleDay = pData[0];
				pSettleDate->MonthVoltageSettleHour = pData[1];
				MW((u32)pSettleDate, ADDR_SettlementDatePara, sizeof(SettleDateParaStruct));
			}
			else
			{
				if(QCSGFp->TempPn != 0)
				{
					Result = ERROR_VerifyFail;
				}
				else
				{
					Result = ERROR_InvalidData;
				}
			}
			break;
		case 0xE0000163:
			QCSGFp->SrcDataPos += 1;
			if((QCSGFp->TempPn == 0) && (BCD_Check(pData, 1) == NO_ERROR) && (pData[0] <= HOUR_BCD_MAX))
			{
				MR((u32)pSettleDate, ADDR_SettlementDatePara, sizeof(SettleDateParaStruct));
				pSettleDate->DayVoltageSettleHour= pData[0];
				MW((u32)pSettleDate, ADDR_SettlementDatePara, sizeof(SettleDateParaStruct));
			}
			else
			{
				if(QCSGFp->TempPn != 0)
				{
					Result = ERROR_VerifyFail;
				}
				else
				{
					Result = ERROR_InvalidData;
				}
			}			
			break;
		case 0xE0000170:
			QCSGFp->SrcDataPos += 1;
			if(QCSGFp->TempPn == 0)
			{
				MR((u32)pIDAuthentication, ADDR_SettlementDatePara, sizeof(IDAuthenticationParaStruct));
				pIDAuthentication->VerifyType = pData[0];
				MW((u32)pIDAuthentication, ADDR_SettlementDatePara, sizeof(IDAuthenticationParaStruct));
			}
			else
			{
				Result = ERROR_VerifyFail;
			}			
			break;
		case 0xE0000171:
			QCSGFp->SrcDataPos += 16;
			if(QCSGFp->TempPn == 0)
			{
				MR((u32)pIDAuthentication, ADDR_SettlementDatePara, sizeof(IDAuthenticationParaStruct));
				MemCopy(pIDAuthentication->AuthReqInfo, pData, 16);
				MW((u32)pIDAuthentication, ADDR_SettlementDatePara, sizeof(IDAuthenticationParaStruct));
			}
			else
			{
				Result = ERROR_VerifyFail;
			}
			break;
		case 0xE0000172:
			QCSGFp->SrcDataPos += 16;
			if(QCSGFp->TempPn == 0)
			{
				MR((u32)pIDAuthentication, ADDR_SettlementDatePara, sizeof(IDAuthenticationParaStruct));
				MemCopy(pIDAuthentication->AuthRespInfo, pData, 16);
				MW((u32)pIDAuthentication, ADDR_SettlementDatePara, sizeof(IDAuthenticationParaStruct));
			}
			else
			{
				Result = ERROR_VerifyFail;
			}
			break;
		case 0xE0000173:
			QCSGFp->SrcDataPos += 16;
			if(QCSGFp->TempPn == 0)
			{
				MR((u32)pIDAuthentication, ADDR_SettlementDatePara, sizeof(IDAuthenticationParaStruct));
				MemCopy(pIDAuthentication->RandomReqInfo, pData, 16);
				MW((u32)pIDAuthentication, ADDR_SettlementDatePara, sizeof(IDAuthenticationParaStruct));
			}
			else
			{
				Result = ERROR_VerifyFail;
			}
			break;
		case 0xE0000174:
			QCSGFp->SrcDataPos += 16;
			if(QCSGFp->TempPn == 0)
			{
				MR((u32)pIDAuthentication, ADDR_SettlementDatePara, sizeof(IDAuthenticationParaStruct));
				MemCopy(pIDAuthentication->RandomRespInfo, pData, 16);
				MW((u32)pIDAuthentication, ADDR_SettlementDatePara, sizeof(IDAuthenticationParaStruct));
			}
			else
			{
				Result = ERROR_VerifyFail;
			}
			break;
		default:
			QCSGFp->SrcDataPos = QCSGFp->UserDataLen;
			Result = ERROR_NoSuchDataID;
			break;			
	}
	return Result;
}

//实时校时
ResultEnum QCSG_AFN04_E0000131_Write(u8* Data, QCSGFrameProcessStruct* QCSGFp, QCSGFrameStruct* SrcFrame)
{
	u8* PnListData;
	RealTimeStruct RealTime;
	DLT645FrameStruct Frame;
#if (TEST_ON == 1)
	u32 temp;
	Terminal_Router_TypeDef* pTerminalRouter;
#endif
	
	#if ((Project/100)==3)
		QCSG_RTREADMETER_REQ_INFO_S* RT_AMRReq;
	#endif

	#if ((Project/100)==2||(Project/100)==5 ||(Project/100)==9) //II型集中器也应包含，20180531
		UartRxChCtrlStruct* UartRxChCtrl;
		RT_AMRCtrlStruct* RT_AMRTask = (RT_AMRCtrlStruct*)ADDR_RealTimeAMRTaskCtrl;
	#endif
	u32 Pn = 0, Time = 0, i = 0;
	
	HAL_GetSystemTime(&RealTime);
	Pn = Data[0];
	Pn += Data[1] << 8;

	if(Pn != 0xFFFF) return ERROR_InvalidData;

	Time = Data[2];
	Time += Data[3] << 8;

