gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/QCSG_AFN04.c
	if((Time & 0x00008000) != 0)
	{// 符号位为 负
		Time &= ~0x00008000;
		for(i = 0; i < Time; i++)
		{
			QCSG_DecOneSecond(&RealTime);
		}
	}
	else
	{// 符号位为 正
		for(i = 0; i < Time; i++)
		{
			QCSG_IncOneSecond(&RealTime);
		}
	}
	
#if (TEST_ON == 1)
	
	pTerminalRouter = Terminal_Router;
	temp = pTerminalRouter->RouterMFCode[0];
	temp += pTerminalRouter->RouterMFCode[1] << 8;
	switch((u16)temp)		//路由器类型:0=保留,1=正泰,2=鼎信,3=东软,4=晓晨,5=瑞斯康
	{	
		case (('T'<<8)+'C')://鼎信载波 27s
			for(i = 0 ; i < 27 ; i++)
			{
				QCSG_IncOneSecond(&RealTime);//台体测试延迟+1s
			}
			break;
		case (('F'<<8)+'C')://友讯达微功率无线 10s
			for(i = 0 ; i < 10 ; i++)
			{
				QCSG_IncOneSecond(&RealTime);//台体测试延迟+1s
			}
			break;
		default: 
			for(i = 0 ; i < 27 ; i++)
			{
				QCSG_IncOneSecond(&RealTime);//台体测试延迟+1s
			}
			break;
	}
	#endif

	i = 0;
	PnListData = (u8*)Get_ADDR_UARTnFnDataBuff(QCSGFp->PORTn);

	PnListData[i++] = 0x00;
	PnListData[i++] = 0x00;
	PnListData[i++] = 0x00;
	PnListData[i++] = 0x00;
	PnListData[i++] = QCSGFp->CurDataID;
	PnListData[i++] = QCSGFp->CurDataID >> 8;
	PnListData[i++] = QCSGFp->CurDataID >> 16;
	PnListData[i++] = QCSGFp->CurDataID >> 24;

	MR((u32)Frame.Addr, (u32)BroadCastAddr, METER_ADDR_SIZE);
	Frame.CtrlCode = 0x08;
	Frame.DataLen = 0x06;
	Frame.Data[0] = RealTime.u8Second;
	Frame.Data[1] = RealTime.u8Minute;
	Frame.Data[2] = RealTime.u8Hour;
	Frame.Data[3] = RealTime.u8Day;
	Frame.Data[4] = RealTime.u8Month;
	Frame.Data[5] = RealTime.u8Year;

	i += Build645Frame(&Frame, &PnListData[i], NO_FE_IN_645);

	i -= 8;
	PnListData[2] = i;
	PnListData[3] = i >> 8;

	#if ((Project/100)==3)		// 负荷管理终端
		RT_AMRReq = (QCSG_RTREADMETER_REQ_INFO_S*)GetRealTimeAMRReqAddr(QCSGFp->PORTn);
		if((RT_AMRReq != NULL) && (RT_AMRReq->Lock == 0)) 
		{
			RT_AMRReq->SrcTask = GetUartTaskID(QCSGFp->PORTn);
			RT_AMRReq->FrameType = FRAME_TYPE_DLT_645;
			RT_AMRReq->DataType  = DATA_TYPE_BCAST_CMD;
			RT_AMRReq->QCSGFrameInfo.A1 = SrcFrame->A1;
			RT_AMRReq->QCSGFrameInfo.A2 = SrcFrame->A2;
			RT_AMRReq->QCSGFrameInfo.A3 = SrcFrame->A3;
			RT_AMRReq->QCSGFrameInfo.FC = SrcFrame->FC;
			RT_AMRReq->QCSGFrameInfo.AFN = SrcFrame->AFN;
			RT_AMRReq->QCSGFrameInfo.SEQ = SrcFrame->SEQ;
			RT_AMRReq->QCSGFrameInfo.Port = QCSGFp->PORTn;
			RT_AMRReq->PnListNum = 1;
			RT_AMRReq->PnListLen = i + 8;
			MR((u32)RT_AMRReq->Data, (u32)PnListData, RT_AMRReq->PnListLen);
			RT_AMRReq->Lock = 0x01;
			//SetRealTimeAMRTaskReq(GetUartTaskID(PORTn), PORTn, RT_AMRReq);
		}
	#endif

	#if ((Project/100)==2||(Project/100)==5||(Project/100)==9)		// I 型、II型集中器，20180531
		UartRxChCtrl = (UartRxChCtrlStruct*)GetUartPortRxChCtrl(QCSGFp->PORTn);
		if((UartRxChCtrl != NULL) && (RT_AMRTask->Lock == 0)) 
		{
			UartRxChCtrl->SrcPort = QCSGFp->PORTn;
			UartRxChCtrl->Empty = BUFFER_FULL;
			UartRxChCtrl->FrameType = FRAME_TYPE_DLT_645;
			UartRxChCtrl->DataType = DATA_TYPE_BCAST_CMD;
			UartRxChCtrl->QCSGFrameInfo.A1 = SrcFrame->A1;
			UartRxChCtrl->QCSGFrameInfo.A2 = SrcFrame->A2;
			UartRxChCtrl->QCSGFrameInfo.A3 = SrcFrame->A3;
			UartRxChCtrl->QCSGFrameInfo.FC = SrcFrame->FC;
			UartRxChCtrl->QCSGFrameInfo.AFN = SrcFrame->AFN;
			UartRxChCtrl->QCSGFrameInfo.SEQ = SrcFrame->SEQ;
			UartRxChCtrl->QCSGFrameInfo.Port = QCSGFp->PORTn;
			UartRxChCtrl->PnListNum  = 1;
			UartRxChCtrl->FrameLen = i + 8;
			UartRxChCtrl->FrameBuf = PnListData;
			switch(QCSGFp->PORTn)
			{
				case RS485_1PORT:
					RT_AMRTask->Flag |= RT_AMR_RS485_CH1_REQ;
					break;
				case RS485_2PORT:
					RT_AMRTask->Flag |= RT_AMR_RS485_CH2_REQ;
					break;
				case RS485_3PORT:
					RT_AMRTask->Flag |= RT_AMR_RS485_CH3_REQ;
					break;
				case RS232PORT:
					RT_AMRTask->Flag |= RT_AMR_RS232_PORT_REQ;
					break;
				case GPRSPORT:
					RT_AMRTask->Flag |= RT_AMR_GPRS_PORT_REQ;
					break;
				case IRPORT:
					RT_AMRTask->Flag |= RT_AMR_IR_PORT_REQ;
					break;
				case ENETPORT:
					RT_AMRTask->Flag |= RT_AMR_ETHE_PORT_REQ;
					break;
				default:
					UartRxChCtrl->Empty = 0;
					UartRxChCtrl->PnListNum  = 0;
					UartRxChCtrl->FrameLen = 0;
					UartRxChCtrl->FrameBuf = NULL;
					break;
			}
		}
	#endif
	
	return NO_ERROR;	
}
ResultEnum QCSG_AFN04_E0000140_Write(u8* Data, QCSGFrameProcessStruct* QCSGFp)
{
	ResultEnum Result = NO_ERROR;
		
	if(Data[0] <= 0x02)
	{
		DataResetAction(Data[0], QCSGFp->PORTn);
	}	
	else
	{
		Result = ERROR_InvalidData;
	}
	return Result;	
}


ResultEnum QCSG_AFN04_E0000180_E000018F(QCSGFrameStruct* SrcFrame, QCSGFrameStruct* DstFrame, QCSGFrameProcessStruct* QCSGFp)
{
	ResultEnum Result = NO_ERROR;
	u8* pData = &SrcFrame->Data[QCSGFp->SrcDataPos];
	ThresholdParaStruct ThresholdPara;
	MemSet((u8*)&ThresholdPara, 0, sizeof(ThresholdParaStruct));
	if(QCSGFp->TempPn == 0)
	{
		MR((u32)&ThresholdPara, ADDR_ThresholdPara, sizeof(ThresholdParaStruct));
	}
	switch(QCSGFp->CurDataID)
	{
		case 0xE0000180:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E0000180_Write(pData, &ThresholdPara);
			break;
		case 0xE0000181:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E0000181_Write(pData, &ThresholdPara);
			break;
		case 0xE0000182:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E0000182_Write(pData, &ThresholdPara);
			break;
		case 0xE0000183:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E0000183_Write(pData, &ThresholdPara);
			break;
		case 0xE0000184:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E0000184_Write(pData, &ThresholdPara);
			break;
		case 0xE0000185:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E0000185_Write(pData, &ThresholdPara);
			break;
		case 0xE0000186:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E0000186_Write(pData, &ThresholdPara);
			break;
		case 0xE0000187:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E0000187_Write(pData, &ThresholdPara);
			break;
		case 0xE0000188:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E0000188_Write(pData, &ThresholdPara);
			break;
		case 0xE0000189:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E0000189_Write(pData, &ThresholdPara);
			break;
		case 0xE000018A:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E000018A_Write(pData, &ThresholdPara);
			break;
		case 0xE000018B:
			QCSGFp->SrcDataPos += 3;
			Result = QCSG_AFN04_E000018B_Write(pData, &ThresholdPara);
			break;
		case 0xE000018C:
			QCSGFp->SrcDataPos += 3;
			Result = QCSG_AFN04_E000018C_Write(pData, &ThresholdPara);
			break;
		case 0xE000018F:
			QCSGFp->SrcDataPos += 18;
			Result = QCSG_AFN04_E000018F_Write(pData, &ThresholdPara);
			break;		
		default:
			QCSGFp->SrcDataPos = QCSGFp->UserDataLen;
			Result = ERROR_NoSuchDataID;
			break;			
	}
		
	if(QCSGFp->TempPn == 0)
	{
		if(Result == NO_ERROR)
		{
			MW((u32)&ThresholdPara, ADDR_ThresholdPara, sizeof(ThresholdParaStruct));	
		}
	}
	else
	{
		Result = ERROR_VerifyFail;
	}
	return Result;
}


ResultEnum QCSG_AFN04_E0000180_Write(u8* Data, ThresholdParaStruct* Para)
{
	if(BCD_Check(Data, 1) != NO_ERROR) return ERROR_InvalidData;
	Para->E0000180 = Data[0];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000181_Write(u8* Data, ThresholdParaStruct* Para)
{
	if(BCD_Check(Data, 1) != NO_ERROR) return ERROR_InvalidData;
	Para->E0000181 = Data[0];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000182_Write(u8* Data, ThresholdParaStruct* Para)
{
	if(BCD_Check(Data, 1) != NO_ERROR) return ERROR_InvalidData;
	Para->E0000182 = Data[0];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000183_Write(u8* Data, ThresholdParaStruct* Para)
{
	if(BCD_Check(Data, 1) != NO_ERROR) return ERROR_InvalidData;
	Para->E0000183 = Data[0];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000184_Write(u8* Data, ThresholdParaStruct* Para)
{
	if(BCD_Check(Data, 1) != NO_ERROR) return ERROR_InvalidData;
	Para->E0000184 = Data[0];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000185_Write(u8* Data, ThresholdParaStruct* Para)
{
	if(BCD_Check(Data, 1) != NO_ERROR) return ERROR_InvalidData;
	Para->E0000185 = Data[0];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000186_Write(u8* Data, ThresholdParaStruct* Para)
{
	if(BCD_Check(Data, 1) != NO_ERROR) return ERROR_InvalidData;
	Para->E0000186 = Data[0];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000187_Write(u8* Data, ThresholdParaStruct* Para)
{
	if(BCD_Check(Data, 1) != NO_ERROR) return ERROR_InvalidData;
	Para->E0000187 = Data[0];

	return NO_ERROR;	
}

