gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/QCSG_AFN04.c
ResultEnum QCSG_AFN04_E0000188_Write(u8* Data, ThresholdParaStruct* Para)
{
	if(BCD_Check(Data, 1) != NO_ERROR) return ERROR_InvalidData;
	Para->E0000188 = Data[0];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000189_Write(u8* Data, ThresholdParaStruct* Para)
{
	if(BCD_Check(Data, 1) != NO_ERROR) return ERROR_InvalidData;
	Para->E0000189 = Data[0];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E000018A_Write(u8* Data, ThresholdParaStruct* Para)
{
	if(BCD_Check(Data, 2) != NO_ERROR) return ERROR_InvalidData;
	Para->E000018A = Data[1];
	Para->E000018A <<= 8;
	Para->E000018A += Data[0];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E000018B_Write(u8* Data, ThresholdParaStruct* Para)
{
	if(BCD_Check(Data, 3) != NO_ERROR) return ERROR_InvalidData;
	MemCopy((u8*)&Para->E000018B, Data, 3);

	/*
	SelfAdaptionParaStruct temp;
	TerminalRunTimeCtrlStruct* pTSysCtrl = (TerminalRunTimeCtrlStruct*)ADDR_Terminal_RunTime;
	MR((u32)&temp, (u32)ADDR_SelfAdaptionPara, sizeof(SelfAdaptionParaStruct));
	
	if(MemCompare(&temp.SelfAdaptionFlag, Data, 1) != 0)
	{
		pTSysCtrl->Flag |= TERMINAL_COMM_PARA_CHANGE_FLAG;
	}
	
	if(QCSG_BCD2HEX(Data[0])>=1)
		temp.SelfAdaptionFlag = 0x01;
	else 
		temp.SelfAdaptionFlag = 0x00;
	MW((u32)&temp, ADDR_SelfAdaptionPara, sizeof(SelfAdaptionParaStruct));	
*/
	
	//err20181109 CT二次 测试用 
	/*
	u32 Temp=0;
	//MemCopy((u8*)&Temp, Data, 3);
	Temp = QCSG_BCD2HEX(Data[2]) *10000 +  QCSG_BCD2HEX(Data[1]) *100 + QCSG_BCD2HEX(Data[0]);
	offSquareWave();
	onSquareWave(Temp);
	*/
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E000018C_Write(u8* Data, ThresholdParaStruct* Para)
{
	AlarmAMRDataStruct* AlarmAMRDataOld = (AlarmAMRDataStruct*)ADDR_AlarmTaskAMRDataBuf_Old;
	if(BCD_Check(Data, 3) != NO_ERROR) return ERROR_InvalidData;
	MemCopy((u8*)&Para->E000018C, Data, 3);
	AlarmAMRDataOld[0].AlarmFlag &= ~ALAMR_FLAG_GPRS_RX_TX_BYTES_E200003A;
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E000018F_Write(u8* Data, ThresholdParaStruct* Para)
{
	ResultEnum Result = NO_ERROR;

	Result += QCSG_AFN04_E0000180_Write(Data, Para);
	Data += 1;	
	Result += QCSG_AFN04_E0000181_Write(Data, Para);
	Data += 1;
	Result += QCSG_AFN04_E0000182_Write(Data, Para);
	Data += 1;
	Result += QCSG_AFN04_E0000183_Write(Data, Para);
	Data += 1;
	Result += QCSG_AFN04_E0000184_Write(Data, Para);
	Data += 1;
	Result += QCSG_AFN04_E0000185_Write(Data, Para);
	Data += 1;
	Result += QCSG_AFN04_E0000186_Write(Data, Para);
	Data += 1;
	Result += QCSG_AFN04_E0000187_Write(Data, Para);
	Data += 1;
	Result += QCSG_AFN04_E0000188_Write(Data, Para);
	Data += 1;
	Result += QCSG_AFN04_E0000189_Write(Data, Para);
	Data += 1;
	Result += QCSG_AFN04_E000018A_Write(Data, Para);
	Data += 2;
	Result += QCSG_AFN04_E000018B_Write(Data, Para);
	Data += 3;
	Result += QCSG_AFN04_E000018C_Write(Data, Para);
	Data += 3;
	if(Result != NO_ERROR)
	{
		Result = ERROR_InvalidData;
	}	
	return Result;
}



ResultEnum QCSG_AFN04_E0000200_E0000220(QCSGFrameStruct* SrcFrame, QCSGFrameStruct* DstFrame, QCSGFrameProcessStruct* QCSGFp)
{
	AMRChTimeStruct AMRChTime;
	RealTimeStruct Time;
	
	ResultEnum Result = NO_ERROR;
	u8* pData = &SrcFrame->Data[QCSGFp->SrcDataPos];
	u32 FlashAddr = 0;
	MemSet((u8*)&AMRChTime, 0, sizeof(AMRChTimeStruct));
	
	switch(QCSGFp->CurDataID)
	{
		case 0xE0000200:		//第一路485抄表参数
			QCSGFp->SrcDataPos += 7;
			if(QCSGFp->TempPn == 0)
			{
				Time.u8Second = 0;
				Time.u8Minute = pData[0];
				Time.u8Hour = pData[1];
				Time.u8Day = pData[2];
				Time.u8Month = pData[3];
				Time.u8Year = pData[4];
				Time.u8Week = 0;
				Result = TimeValidCheck(&Time);
				if((Result == NO_ERROR) && (pData[5] <= PERIOD_UNIT_MONTH))
				{
					MR((u32)&AMRChTime, ADDR_AMRChTimeTbl, sizeof(AMRChTimeStruct));
					MemCopy((u8*)&AMRChTime, pData, 7);
					MW((u32)&AMRChTime, ADDR_AMRChTimeTbl, sizeof(AMRChTimeStruct));
				}
				else
				{//如果设置非法值 则给定一个基准值//err20190612 为过台体 台体下发的时间非法。
					//AMRChTime.u8Second = 0x00;
					AMRChTime.Minute = 0x00;
					AMRChTime.Hour = 0x00;
					AMRChTime.Day = 0x01;
					AMRChTime.Month = 0x01;
					AMRChTime.Year = 0x00;
					//Time.u8Week = 0;
					AMRChTime.PeriodUnit = PERIOD_UNIT_MINUTE;
					AMRChTime.Period = 0x02;
					//MR((u32)&AMRChTime, ADDR_AMRChTimeTbl, sizeof(AMRChTimeStruct));
					//MemCopy((u8*)&AMRChTime, pData, 7);
					MW((u32)&AMRChTime, ADDR_AMRChTimeTbl, sizeof(AMRChTimeStruct));
					Result = ERROR_InvalidData;
				}
			}
			else
			{
				Result = ERROR_VerifyFail;
			}
			break;
		case 0xE0000201:
			QCSGFp->SrcDataPos += 7;
			if(QCSGFp->TempPn == 0)
			{
				Time.u8Second = 0;
				Time.u8Minute = pData[0];
				Time.u8Hour = pData[1];
				Time.u8Day = pData[2];
				Time.u8Month = pData[3];
				Time.u8Year = pData[4];
				Time.u8Week = 0;
				Result = TimeValidCheck(&Time);
				if((Result == NO_ERROR) && (pData[5] <= PERIOD_UNIT_MONTH))
				{
					FlashAddr = ADDR_AMRChTimeTbl + sizeof(AMRChTimeStruct);
					MR((u32)&AMRChTime, FlashAddr, sizeof(AMRChTimeStruct));
					MemCopy((u8*)&AMRChTime, pData, 7);
					MW((u32)&AMRChTime, FlashAddr, sizeof(AMRChTimeStruct));
				}
				else
				{
					Result = ERROR_InvalidData;
				}			
			}
			else
			{
				Result = ERROR_VerifyFail;
			}		
			break;
		case 0xE0000202:
			QCSGFp->SrcDataPos += 7;
			if(QCSGFp->TempPn == 0)
			{
				Time.u8Second = 0;
				Time.u8Minute = pData[0];
				Time.u8Hour = pData[1];
				Time.u8Day = pData[2];
				Time.u8Month = pData[3];
				Time.u8Year = pData[4];
				Time.u8Week = 0;
				Result = TimeValidCheck(&Time);
				if((Result == NO_ERROR) && (pData[5] <= PERIOD_UNIT_MONTH))
				{
					FlashAddr = ADDR_AMRChTimeTbl + (2 * sizeof(AMRChTimeStruct));
					MR((u32)&AMRChTime, FlashAddr, sizeof(AMRChTimeStruct));
					MemCopy((u8*)&AMRChTime, pData, 7);
					MW((u32)&AMRChTime, FlashAddr, sizeof(AMRChTimeStruct));
				}
				else
				{
					Result = ERROR_InvalidData;
				}	
			}
			else
			{
				Result = ERROR_VerifyFail;
			}			
			break;
		case 0xE000021F:
			QCSGFp->SrcDataPos += 7;
			if(QCSGFp->TempPn == 0)
			{
				Time.u8Second = 0;
				Time.u8Minute = pData[0];
				Time.u8Hour = pData[1];
				Time.u8Day = pData[2];
				Time.u8Month = pData[3];
				Time.u8Year = pData[4];
				Time.u8Week = 0;
				Result = TimeValidCheck(&Time);
				if((Result == NO_ERROR) && (pData[5] <= PERIOD_UNIT_MONTH))
				{
					FlashAddr = ADDR_AMRChTimeTbl + (3 * sizeof(AMRChTimeStruct));
					MR((u32)&AMRChTime, FlashAddr, sizeof(AMRChTimeStruct));
					MemCopy((u8*)&AMRChTime, pData, 7);
					MW((u32)&AMRChTime, FlashAddr, sizeof(AMRChTimeStruct));
				}
				else
				{
					Result = ERROR_InvalidData;
				}			
			}
			else
			{
				Result = ERROR_VerifyFail;
			}			
			break;
		case 0xE0000220:
			QCSGFp->SrcDataPos += 7;
			if(QCSGFp->TempPn == 0)
			{
				Time.u8Second = 0;
				Time.u8Minute = pData[0];
				Time.u8Hour = pData[1];
				Time.u8Day = pData[2];
				Time.u8Month = pData[3];
				Time.u8Year = pData[4];
				Time.u8Week = 0;
				Result = TimeValidCheck(&Time);
				if((Result == NO_ERROR) && (pData[5] <= PERIOD_UNIT_MONTH))
				{
					FlashAddr = ADDR_AMRChTimeTbl + (4 * sizeof(AMRChTimeStruct));
					MR((u32)&AMRChTime, FlashAddr, sizeof(AMRChTimeStruct));
					MemCopy((u8*)&AMRChTime, pData, 7);
					MW((u32)&AMRChTime, FlashAddr, sizeof(AMRChTimeStruct));
				}
				else
				{
					Result = ERROR_InvalidData;
				}				
			}
			else
			{
				Result = ERROR_VerifyFail;
			}
			break;
		default:
			QCSGFp->SrcDataPos = QCSGFp->UserDataLen;
			Result = ERROR_NoSuchDataID;
			break;			
	}
	return Result;
}



ResultEnum QCSG_AFN04_E0000221_E0000250(QCSGFrameStruct* SrcFrame, QCSGFrameStruct* DstFrame, QCSGFrameProcessStruct* QCSGFp)
{
	AMRChSetStruct AMRChSet;
	ResultEnum Result = NO_ERROR;
	u8* pData = &SrcFrame->Data[QCSGFp->SrcDataPos];	
	u32 FlashAddr = 0, Index = 0;
	MemSet((u8*)&AMRChSet, 0, sizeof(AMRChSetStruct));
	switch(QCSGFp->CurDataID)
	{
		case 0xE0000221:			//抄表参数配置表总数
			QCSGFp->SrcDataPos += 1;
			Result = ERROR_VerifyFail;
			break;
		case 0xE0000230:		//485-1抄表参数(有效或无效)
			FlashAddr = ADDR_AMRChSetTbl;			
			break;
		case 0xE0000231:		//485-2抄表参数(有效或无效)
			FlashAddr = ADDR_AMRChSetTbl + sizeof(AMRChSetStruct);
			break;
		case 0xE0000232:		//485-3抄表参数(有效或无效)
			FlashAddr = ADDR_AMRChSetTbl + (2 * sizeof(AMRChSetStruct));
			break;
		case 0xE000024F:		//载波端口抄表参数(有效或无效)
			FlashAddr = ADDR_AMRChSetTbl + (3 * sizeof(AMRChSetStruct));
			break;
		case 0xE0000250:		//无线端口抄表参数(有效或无效)
			FlashAddr = ADDR_AMRChSetTbl + (4 * sizeof(AMRChSetStruct));
			break;		
		default:
			QCSGFp->SrcDataPos = QCSGFp->UserDataLen;
			Result = ERROR_NoSuchDataID;
			break;			
	}
	if(FlashAddr != 0)
	{
#if (TEST_ON == 1)
		MR((u32)&AMRChSet, FlashAddr, sizeof(AMRChSetStruct));
		AMRChSet.Flag	  = pData[Index++];
		AMRChSet.StoreNum = pData[Index + 1];
		AMRChSet.StoreNum <<= 8;
		AMRChSet.StoreNum += pData[Index];
		Index += 2;
		AMRChSet.ChMeterType = pData[Index++];
		AMRChSet.UserType = pData[Index++];
		AMRChSet.DANum = pData[Index++];
		if(AMRChSet.DANum == 0xFF)
		{
			AMRChSet.DA[0] = pData[Index++];
			AMRChSet.DA[0] += pData[Index++] << 8;
		}
		else
		{
			MemCopy((u8*)AMRChSet.DA, &pData[Index], (u16)AMRChSet.DANum * 2);
			Index += AMRChSet.DANum * 2;
		}

		AMRChSet.DataIDNum = pData[Index++];
		if(AMRChSet.DataIDNum == 0xFF)
		{
			AMRChSet.DataID[0] = pData[Index++];
			AMRChSet.DataID[0] += pData[Index++] << 8;
			AMRChSet.DataID[0] += pData[Index++] << 16;
			AMRChSet.DataID[0] += pData[Index++] << 24;
		}
		else
		{
			if(AMRChSet.DataIDNum > AMR_MAX_DATA_ID) 
			{
				Result = ERROR_InvalidData;
			}
			else
			{
				MemCopy((u8*)AMRChSet.DataID, &pData[Index], (u16)AMRChSet.DataIDNum * 4);
			}
			Index += ((u32)AMRChSet.DataIDNum) * 4;
		}

		if(QCSGFp->TempPn == 0)
		{	
			if(Result == NO_ERROR)
			{
				MW((u32)&AMRChSet, FlashAddr, sizeof(AMRChSetStruct));
			}
		}
		else
		{
			Result = ERROR_VerifyFail;
		}			
		
		QCSGFp->SrcDataPos += Index;
#else
		MR((u32)&AMRChSet, FlashAddr, sizeof(AMRChSetStruct));
		AMRChSet.Flag	  = pData[Index++];		
		if(AMRChSet.Flag > 1) Result = ERROR_InvalidData;//err20180404-16 有效性 范围 0无效 1有效 
		
		AMRChSet.StoreNum = pData[Index + 1];
		AMRChSet.StoreNum <<= 8;
		AMRChSet.StoreNum += pData[Index];
		if(BCD_Check((u8*)&AMRChSet.StoreNum, 2) != NO_ERROR) 
			Result = ERROR_InvalidData;//err20180404-16 存储点数范围 BCD格式 

