gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/QCSG_AFN04.c
		Index += 2;
		AMRChSet.ChMeterType = pData[Index++];
		if((AMRChSet.ChMeterType != METER_TYPE_SINGLE) &&
			(AMRChSet.ChMeterType != METER_TYPE_MULTI) &&
			(AMRChSet.ChMeterType != METER_TYPE_OTHER)) 
			Result = ERROR_InvalidData;//err20180404-16 电表类型 范围 1单相 2多功能 3其他
		
		AMRChSet.UserType = pData[Index++];
		if(AMRChSet.UserType > 1) //&& (AMRChSet.UserType != 0xFF)) 
				Result = ERROR_InvalidData;//err20180404-16 有效性 范围 0普通 1重点

		
		AMRChSet.DANum = pData[Index++];
		if(AMRChSet.DANum == 0xFF)
		{
			AMRChSet.DA[0] = pData[Index++];
			AMRChSet.DA[0] += pData[Index++] << 8;
		}
		else
		{
			MemCopy((u8*)AMRChSet.DA, &pData[Index], (u16)AMRChSet.DANum * 2);
			Index += AMRChSet.DANum * 2;
		}

		AMRChSet.DataIDNum = pData[Index++];
		if(AMRChSet.DataIDNum == 0xFF)
		{
			AMRChSet.DataID[0] = pData[Index++];
			AMRChSet.DataID[0] += pData[Index++] << 8;
			AMRChSet.DataID[0] += pData[Index++] << 16;
			AMRChSet.DataID[0] += pData[Index++] << 24;
		}
		else
		{
			if(AMRChSet.DataIDNum > AMR_MAX_DATA_ID) 
			{
				Result = ERROR_InvalidData;
			}
			else
			{
				MemCopy((u8*)AMRChSet.DataID, &pData[Index], (u16)AMRChSet.DataIDNum * 4);
			}
			Index += ((u32)AMRChSet.DataIDNum) * 4;
		}

		if(QCSGFp->TempPn == 0)
		{	
			if(Result == NO_ERROR)
			{
				MW((u32)&AMRChSet, FlashAddr, sizeof(AMRChSetStruct));
			}
		}
		else
		{
			Result = ERROR_VerifyFail;
		}			
		
		QCSGFp->SrcDataPos += Index;
#endif
	}	
	return Result;
}



ResultEnum QCSG_AFN04_E0000300_E00003FE(QCSGFrameStruct* SrcFrame, QCSGFrameStruct* DstFrame, QCSGFrameProcessStruct* QCSGFp)
{
	NormalTaskParaStruct NormalTaskPara;
	ResultEnum Result = NO_ERROR;
	u8* pData = &SrcFrame->Data[QCSGFp->SrcDataPos];	
	u32 FlashAddr = 0, Index = 0;
	MemSet((u8*)&NormalTaskPara, 0, sizeof(NormalTaskParaStruct));

	if(QCSGFp->CurDataID == 0xE0000300)//有效的普通任务总数
	{
		QCSGFp->SrcDataPos += 1;
		Result = ERROR_InvalidData;
	}
	//else if((QCSGFp->CurDataID >= 0xE0000301) && (QCSGFp->CurDataID <= 0xE00003FE))
	else if((QCSGFp->CurDataID >= 0xE0000301) && (QCSGFp->CurDataID <= 0xE0000320))
	{
		FlashAddr = ADDR_NormalTaskPara + (((QCSGFp->CurDataID - 1) & 0x000000FF) * sizeof(NormalTaskParaStruct));
	}
	else
	{
		QCSGFp->SrcDataPos = QCSGFp->UserDataLen;
		Result = ERROR_InvalidData;
	}
	
	if(FlashAddr != 0)
	{
		MR((u32)&NormalTaskPara, FlashAddr, sizeof(NormalTaskParaStruct));
		HAL_GetSystemTime(&NormalTaskPara.ReportTime);
		HAL_GetSystemTime(&NormalTaskPara.SampleTime);
		Result = NO_ERROR;
			
		NormalTaskPara.Flag = pData[Index++];
		NormalTaskPara.ReportTime.u8Minute = pData[Index++];
		NormalTaskPara.ReportTime.u8Hour   = pData[Index++];
		NormalTaskPara.ReportTime.u8Day    = pData[Index++];
		NormalTaskPara.ReportTime.u8Month  = pData[Index++];
		NormalTaskPara.ReportTime.u8Year   = pData[Index++];
		//NormalTaskPara.ReportTime.u8Week   = 0;
		Result += TimeValidCheck(&NormalTaskPara.ReportTime);
		
		NormalTaskPara.ReportPeriodUnit	   = pData[Index++];
		NormalTaskPara.ReportPeriod		   = pData[Index++];
		NormalTaskPara.DataStructureType   = pData[Index++];
#if (TEST_ON == 1)
		if((NormalTaskPara.DataStructureType > DATA_STRUCT_TYPE_TASK) || 
		   (NormalTaskPara.ReportPeriodUnit > PERIOD_UNIT_MONTH) )
#else
		if((NormalTaskPara.DataStructureType > DATA_STRUCT_TYPE_TASK) || 
		   	(NormalTaskPara.ReportPeriodUnit > PERIOD_UNIT_MONTH) ||
			(NormalTaskPara.Flag > 0x01))	//err20180404-08 有效性参数可设范围为 00 01
#endif
		{
			Result = ERROR_InvalidData;
		}

		NormalTaskPara.SampleTime.u8Minute = pData[Index++];
		NormalTaskPara.SampleTime.u8Hour   = pData[Index++];
		NormalTaskPara.SampleTime.u8Day    = pData[Index++];
		NormalTaskPara.SampleTime.u8Month  = pData[Index++];
		NormalTaskPara.SampleTime.u8Year   = pData[Index++];
		//NormalTaskPara.SampleTime.u8Week   = 0;
		Result += TimeValidCheck(&NormalTaskPara.SampleTime);
		
		NormalTaskPara.SamplePeriodUnit	   = pData[Index++];
		if(NormalTaskPara.SamplePeriodUnit > PERIOD_UNIT_MONTH)
		{
			Result = ERROR_InvalidData;
		}
		NormalTaskPara.SamplePeriod		   = pData[Index++];
		NormalTaskPara.GetRate		       = pData[Index++];
		
		NormalTaskPara.ExecCnt = pData[Index++];
		NormalTaskPara.ExecCnt += pData[Index++] << 8;
		NormalTaskPara.RealExeCnt = 0;	
		
		NormalTaskPara.DANum = pData[Index++];
		if(NormalTaskPara.DANum != 0)
		{
			MemCopy((u8*)NormalTaskPara.DA, &pData[Index], NormalTaskPara.DANum * 2);
			Index += NormalTaskPara.DANum * 2;
		}
		
		NormalTaskPara.DataIDNum = pData[Index++];		
		if(NormalTaskPara.DataIDNum > AMR_MAX_DATA_ID) 
		{
			Result = ERROR_InvalidData;
		}
		else
		{
			if(QCSGFp->TempPn == 0)
			{
				if(Result == NO_ERROR)
				{
					if(NormalTaskPara.DataIDNum != 0)
					{
						MemCopy((u8*)NormalTaskPara.DataID, &pData[Index], NormalTaskPara.DataIDNum * 4);				
					}
					MW((u32)&NormalTaskPara, FlashAddr, sizeof(NormalTaskParaStruct));
				}
				else
				{
					Result = ERROR_InvalidData;
				}		
			}
			else
			{
				Result = ERROR_VerifyFail;
			}
		}
		Index += NormalTaskPara.DataIDNum * 4;
		QCSGFp->SrcDataPos += Index;
	}	
	return Result;
}




ResultEnum QCSG_AFN04_E0000400_E00004FE(QCSGFrameStruct* SrcFrame, QCSGFrameStruct* DstFrame, QCSGFrameProcessStruct* QCSGFp)
{
	RelayTaskParaStruct RelayTaskPara;
	ResultEnum Result = NO_ERROR;
	u8* pData = &SrcFrame->Data[QCSGFp->SrcDataPos];	
	u32 FlashAddr = 0, Index = 0;
	MemSet((u8*)&RelayTaskPara, 0, sizeof(RelayTaskParaStruct));

	if(QCSGFp->CurDataID == 0xE0000400)
	{
		QCSGFp->SrcDataPos += 1;
		Result = ERROR_InvalidData;
	}
	else if((QCSGFp->CurDataID >= 0xE0000401) && (QCSGFp->CurDataID <= 0xE0000420))
	{
		FlashAddr = ADDR_RelayTaskPara + (((QCSGFp->CurDataID - 1) & 0x000000FF) * sizeof(RelayTaskParaStruct));
	}
	else
	{
		QCSGFp->SrcDataPos = QCSGFp->UserDataLen;
		Result = ERROR_InvalidData;
	}
	
	if(FlashAddr != 0)
	{
		MR((u32)&RelayTaskPara, FlashAddr, sizeof(RelayTaskParaStruct));
		HAL_GetSystemTime(&RelayTaskPara.ReportTime);
		HAL_GetSystemTime(&RelayTaskPara.SampleTime);
		Result = NO_ERROR;
		
