gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/QCSG_AFN04.c
		RelayTaskPara.Flag = pData[Index++];
		if(RelayTaskPara.Flag > 0x01)//err20180404-08 有效性标志参数可设范围 00 01
		{
			Result = ERROR_InvalidData;
		}
		RelayTaskPara.ReportTime.u8Minute = pData[Index++];
		RelayTaskPara.ReportTime.u8Hour   = pData[Index++];
		RelayTaskPara.ReportTime.u8Day    = pData[Index++];
		RelayTaskPara.ReportTime.u8Month  = pData[Index++];
		RelayTaskPara.ReportTime.u8Year   = pData[Index++];
		//RelayTaskPara.ReportTime.u8Week   = 0;
		Result += TimeValidCheck(&RelayTaskPara.ReportTime);
		
		RelayTaskPara.ReportPeriodUnit    = pData[Index++];
		if(RelayTaskPara.ReportPeriodUnit > PERIOD_UNIT_MONTH)
		{
			Result = ERROR_InvalidData;
		}
		RelayTaskPara.ReportPeriod 		  = pData[Index++];

		RelayTaskPara.SampleTime.u8Minute = pData[Index++];
		RelayTaskPara.SampleTime.u8Hour   = pData[Index++];
		RelayTaskPara.SampleTime.u8Day    = pData[Index++];
		RelayTaskPara.SampleTime.u8Month  = pData[Index++];
		RelayTaskPara.SampleTime.u8Year   = pData[Index++];
		//RelayTaskPara.SampleTime.u8Week   = 0;
		Result += TimeValidCheck(&RelayTaskPara.SampleTime);
		
		RelayTaskPara.SamplePeriodUnit 	  = pData[Index++];
		if(RelayTaskPara.SamplePeriodUnit > PERIOD_UNIT_MONTH)
		{
			Result = ERROR_InvalidData;
		}
		RelayTaskPara.SamplePeriod 		  = pData[Index++];
		
		RelayTaskPara.GetRate   = pData[Index++];
		RelayTaskPara.RelayType = pData[Index++];
		RelayTaskPara.ExecCnt = pData[Index++];
		RelayTaskPara.ExecCnt += pData[Index++] << 8;
		RelayTaskPara.RealExeCnt = 0;	
		
		RelayTaskPara.ComPortId = pData[Index++];

		if( RelayTaskPara.RelayType > 0x04 )//err20180404-09 中继类型参数可设范围 00 普通中继； 01 转发主站对电能表的拉闸命令； 02 转发主站对电能表的允许合闸命令； 03 转发主站对电能表的保电投入命令； 04 转发主站对电能表的保电解除命令。
		{
			Result = ERROR_InvalidData;
		}
		if((RelayTaskPara.ComPortId != PORT_ID_RS485_1) && 
			(RelayTaskPara.ComPortId != PORT_ID_RS485_2) &&
			(RelayTaskPara.ComPortId != PORT_ID_RS485_3) &&
			(RelayTaskPara.ComPortId != PORT_ID_PLC) &&
			(RelayTaskPara.ComPortId != PORT_ID_WIRELESS)) //err20180404-09 测量点端口号参数可设范围          00H~1EH 表示 485 1~31；1FH 表示载波通道；20H 表示无线；30H 表示其他
		{
			Result = ERROR_InvalidData;
		}
		RelayTaskPara.Baud = pData[Index++];
		RelayTaskPara.Parity = pData[Index++];
		RelayTaskPara.DataBit = pData[Index++];
		RelayTaskPara.StopBit = pData[Index++];
		if( (RelayTaskPara.Baud != 4) &&
			(RelayTaskPara.Baud != 8) &&
			(RelayTaskPara.Baud != 16) &&
			(RelayTaskPara.Baud != 32))	//err20180404-09 波特率参数可设范围   
		{
			Result = ERROR_InvalidData;
		}
		if(RelayTaskPara.Parity > 2)	//err20180404-09 校验方式参数可设范围 0：无校验； 1：偶校验；2：奇校验；
		{
			Result = ERROR_InvalidData;
		}
		
		if((RelayTaskPara.DataBit > 8) ||
			(RelayTaskPara.DataBit < 5) )	//err20180404-09 数据位参数可设范围 数据位 5,6,7,8
		{
			Result = ERROR_InvalidData;
		}
		if(RelayTaskPara.StopBit > 2)	//err20180404-09 停止位参数可设范围 0-1 位； 1-1.5 位； 2-2 位；
		{
			Result = ERROR_InvalidData;
		}


		
		RelayTaskPara.TimeOut = pData[Index++];
		RelayTaskPara.Length = pData[Index++];
		if(RelayTaskPara.Length != 0)
		{
			MemCopy(RelayTaskPara.Frame, &pData[Index], RelayTaskPara.Length);
		}
		if(QCSGFp->TempPn == 0)
		{
			if(Result == NO_ERROR)
			{
				MW((u32)&RelayTaskPara, FlashAddr, sizeof(RelayTaskParaStruct));
			}
			else
			{
				Result = ERROR_InvalidData;
			}
		}
		else
		{
			Result = ERROR_VerifyFail;
		}		
		Index += RelayTaskPara.Length;
		QCSGFp->SrcDataPos += Index;
	}	
	return Result;
}


ResultEnum QCSG_AFN04_E0000500_E00005FF(QCSGFrameStruct* SrcFrame, QCSGFrameStruct* DstFrame, QCSGFrameProcessStruct* QCSGFp)
{
	AnalogCaculationParaStruct AnalogPara;
	ResultEnum Result = NO_ERROR;
	u8* pData = &SrcFrame->Data[QCSGFp->SrcDataPos];	
	MemSet((u8*)&AnalogPara, 0, sizeof(AnalogCaculationParaStruct));
	MR((u32)&AnalogPara, ADDR_AnalogPara, sizeof(AnalogCaculationParaStruct));
	switch(QCSGFp->CurDataID)
	{
		case 0xE0000500:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E0000500_Write(pData, &AnalogPara);
			break;
		case 0xE0000501:
			QCSGFp->SrcDataPos += 3;
			Result = QCSG_AFN04_E0000501_Write(pData, &AnalogPara);
			break;
		case 0xE0000502:
			QCSGFp->SrcDataPos += 3;
			Result = QCSG_AFN04_E0000502_Write(pData, &AnalogPara);
			break;
		case 0xE00005FE:
			QCSGFp->SrcDataPos += 32;
			Result = QCSG_AFN04_E00005FE_Write(pData, &AnalogPara);
			break;
		case 0xE00005FF:
			QCSGFp->SrcDataPos += 39;
			Result = QCSG_AFN04_E00005FF_Write(pData, &AnalogPara);
			break;	
		case 0xE0000900:
			QCSGFp->SrcDataPos += 3;
			MemCopy((u8*)&AnalogPara.E0000900, pData, 3);
			break;
		default:
			QCSGFp->SrcDataPos = QCSGFp->UserDataLen;
			Result = ERROR_NoSuchDataID;
			break;			
	}
		
	if(QCSGFp->TempPn == 0)
	{
		if(Result == NO_ERROR)
		{
			MW((u32)&AnalogPara, ADDR_AnalogPara, sizeof(AnalogCaculationParaStruct));
		}
	}
	else
	{
		Result = ERROR_VerifyFail;
	}
	return Result;
}

ResultEnum QCSG_AFN04_E0000500_Write(u8* Data, AnalogCaculationParaStruct* Para)
{	
	if(Data[0] > MAX_ANALOG_NUM) return ERROR_InvalidData;
	Para->AnalogNum = Data[0];
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000501_Write(u8* Data, AnalogCaculationParaStruct* Para)
{
	Para->AnalogID[0][0] = Data[0];
	Para->AnalogID[0][1] = Data[1];
	Para->AnalogID[0][2] = Data[2];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000502_Write(u8* Data, AnalogCaculationParaStruct* Para)
{
	Para->AnalogID[1][0] = Data[0];
	Para->AnalogID[1][1] = Data[1];
	Para->AnalogID[1][2] = Data[2];

	return NO_ERROR;	
}


ResultEnum QCSG_AFN04_E00005FE_Write(u8* Data, AnalogCaculationParaStruct* Para)
{
	MemCopy(Para->AnalogStateMark, Data, 32);

	return NO_ERROR;	
}


ResultEnum QCSG_AFN04_E00005FF_Write(u8* Data, AnalogCaculationParaStruct* Para)
{
	ResultEnum Result = NO_ERROR;
	Result += QCSG_AFN04_E0000500_Write(Data, Para);
	Data += 1;
	Result += QCSG_AFN04_E0000501_Write(Data, Para);
	Data += 3;
	Result += QCSG_AFN04_E0000502_Write(Data, Para);
	Data += 3;
	Result += QCSG_AFN04_E00005FE_Write(Data, Para);
	Data += 32;

	if(Result != NO_ERROR)
	{
		Result = ERROR_InvalidData;
	}
	return Result;	
}


ResultEnum QCSG_AFN04_E0000600_E00006FF(QCSGFrameStruct* SrcFrame, QCSGFrameStruct* DstFrame, QCSGFrameProcessStruct* QCSGFp)
{
	PulseCaculationParaStruct PulsePara;
	ResultEnum Result = NO_ERROR;
	u8* pData = &SrcFrame->Data[QCSGFp->SrcDataPos];	
	MemSet((u8*)&PulsePara, 0, sizeof(PulseCaculationParaStruct));
	MR((u32)&PulsePara, ADDR_PulsePara, sizeof(PulseCaculationParaStruct));
	switch(QCSGFp->CurDataID)
	{
		case 0xE0000600:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E0000600_Write(pData, &PulsePara);
			break;
		case 0xE0000601:
			QCSGFp->SrcDataPos += 6;
			Result = QCSG_AFN04_E0000601_Write(pData, &PulsePara);
			break;
		case 0xE0000602:
			QCSGFp->SrcDataPos += 6;
			Result = QCSG_AFN04_E0000602_Write(pData, &PulsePara);
			break;
		case 0xE00006FE:
			QCSGFp->SrcDataPos += 32;
			Result = QCSG_AFN04_E00006FE_Write(pData, &PulsePara);
			break;
		case 0xE00006FF:
			QCSGFp->SrcDataPos += 45;
			Result = QCSG_AFN04_E00006FF_Write(pData, &PulsePara);
			break;	
		default:
			QCSGFp->SrcDataPos = QCSGFp->UserDataLen;
			Result = ERROR_NoSuchDataID;
			break;			
	}
		
	if(QCSGFp->TempPn == 0)
	{
		if(Result == NO_ERROR)
		{
			MW((u32)&PulsePara, ADDR_PulsePara, sizeof(PulseCaculationParaStruct));
		}
	}
	else
	{
		Result = ERROR_VerifyFail;
	}
	return Result;
}

ResultEnum QCSG_AFN04_E0000600_Write(u8* Data, PulseCaculationParaStruct* Para)
{	
	if(Data[0] > MAX_PULSE_NUM) return ERROR_InvalidData;
	Para->PulseNum = Data[0];
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000601_Write(u8* Data, PulseCaculationParaStruct* Para)
{
	u32 Pn = 0;
	Pn = Data[0];
	Pn += Data[1] << 8;
	//Pn = SwitchPnToNum(Pn);
	if(Pn > MAX_PN_NUM)  return ERROR_InvalidData;
	if((Data[2] == 0) || (Data[2] > 0x06)) return ERROR_InvalidData;
	MemCopy(Para->PulseID[0], Data, 6);

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000602_Write(u8* Data, PulseCaculationParaStruct* Para)
{
	u32 Pn = 0;
	Pn = Data[0];
	Pn += Data[1] << 8;
	//Pn = SwitchPnToNum(Pn);
	if(Pn > MAX_PN_NUM)  return ERROR_InvalidData;
	if((Data[2] == 0) || (Data[2] > 0x06)) return ERROR_InvalidData;
	MemCopy(Para->PulseID[1], Data, 6);

	return NO_ERROR;	
}


ResultEnum QCSG_AFN04_E00006FE_Write(u8* Data, PulseCaculationParaStruct* Para)
{
	MemCopy(Para->PulseStateMark, Data, 32);

	return NO_ERROR;	
}


ResultEnum QCSG_AFN04_E00006FF_Write(u8* Data, PulseCaculationParaStruct* Para)
{
	ResultEnum Result = NO_ERROR;
	Result += QCSG_AFN04_E0000600_Write(Data, Para);
	Data += 1;
	Result += QCSG_AFN04_E0000601_Write(Data, Para);
	Data += 6;
	Result += QCSG_AFN04_E0000602_Write(Data, Para);
	Data += 6;
	Result += QCSG_AFN04_E00006FE_Write(Data, Para);
	Data += 32;

	if(Result != NO_ERROR)
	{
		Result = ERROR_InvalidData;
	}
	return Result;	
}


