gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/QCSG_AFN04.c
ResultEnum QCSG_AFN04_E0000700_E00007FF(QCSGFrameStruct* SrcFrame, QCSGFrameStruct* DstFrame, QCSGFrameProcessStruct* QCSGFp)
{
	CaculationParaStruct CaclPara;
	ResultEnum Result = NO_ERROR;
	u8* pData = &SrcFrame->Data[QCSGFp->SrcDataPos];
	if(QCSGFp->TempPn == 0)
	{
		MemSet((u8*)&CaclPara, 0, sizeof(CaculationParaStruct));
		MR((u32)&CaclPara, ADDR_CaculationPara, sizeof(CaculationParaStruct));
	}
	
	switch(QCSGFp->CurDataID)
	{
		case 0xE0000700:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E0000700_Write(pData, &CaclPara);
			break;
		case 0xE0000701:
			QCSGFp->SrcDataPos += 30;
			Result = QCSG_AFN04_E0000701_Write(pData, &CaclPara);
			break;
		case 0xE0000702:
			QCSGFp->SrcDataPos += 30;
			Result = QCSG_AFN04_E0000702_Write(pData, &CaclPara);
			break;
		case 0xE0000703:
			QCSGFp->SrcDataPos += 30;
			Result = QCSG_AFN04_E0000703_Write(pData, &CaclPara);
			break;
		case 0xE0000704:
			QCSGFp->SrcDataPos += 30;
			Result = QCSG_AFN04_E0000704_Write(pData, &CaclPara);
			break;
		case 0xE0000705:
			QCSGFp->SrcDataPos += 30;
			Result = QCSG_AFN04_E0000705_Write(pData, &CaclPara);
			break;
		case 0xE0000706:
			QCSGFp->SrcDataPos += 30;
			Result = QCSG_AFN04_E0000706_Write(pData, &CaclPara);
			break;
		case 0xE0000707:
			QCSGFp->SrcDataPos += 30;
			Result = QCSG_AFN04_E0000707_Write(pData, &CaclPara);
			break;
		case 0xE0000708:
			QCSGFp->SrcDataPos += 30;
			Result = QCSG_AFN04_E0000708_Write(pData, &CaclPara);
			break;
		case 0xE00007FE:
			QCSGFp->SrcDataPos += 32;
			Result = QCSG_AFN04_E00007FE_Write(pData, &CaclPara);
			break;
		case 0xE00007FF:
			QCSGFp->SrcDataPos += 273;
			Result = QCSG_AFN04_E00007FF_Write(pData, &CaclPara);
			break;	
		default:
			QCSGFp->SrcDataPos = QCSGFp->UserDataLen;
			Result = ERROR_NoSuchDataID;
			break;			
	}
		
	if(QCSGFp->TempPn == 0)
	{
		if(Result == NO_ERROR)
		{
			MW((u32)&CaclPara, ADDR_CaculationPara, sizeof(CaculationParaStruct));
		}
	}
	else
	{
		Result = ERROR_VerifyFail;
	}
	return Result;
}

ResultEnum QCSG_AFN04_E0000700_Write(u8* Data, CaculationParaStruct* Para)
{	
	if(Data[0] > MAX_CACU_NUM) return ERROR_InvalidData;
	Para->CaculationNum = Data[0];
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000701_Write(u8* Data, CaculationParaStruct* Para)
{
	MemCopy(Para->CaculationID[0], Data, 30);

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000702_Write(u8* Data, CaculationParaStruct* Para)
{
	MemCopy(Para->CaculationID[1], Data, 30);

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000703_Write(u8* Data, CaculationParaStruct* Para)
{
	MemCopy(Para->CaculationID[2], Data, 30);

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000704_Write(u8* Data, CaculationParaStruct* Para)
{
	MemCopy(Para->CaculationID[3], Data, 30);

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000705_Write(u8* Data, CaculationParaStruct* Para)
{
	MemCopy(Para->CaculationID[4], Data, 30);

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000706_Write(u8* Data, CaculationParaStruct* Para)
{
	MemCopy(Para->CaculationID[5], Data, 30);

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000707_Write(u8* Data, CaculationParaStruct* Para)
{
	MemCopy(Para->CaculationID[6], Data, 30);

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000708_Write(u8* Data, CaculationParaStruct* Para)
{
	MemCopy(Para->CaculationID[7], Data, 30);

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E00007FE_Write(u8* Data, CaculationParaStruct* Para)
{
	MemCopy(Para->CaculationStateMark, Data, 32);

	return NO_ERROR;	
}


ResultEnum QCSG_AFN04_E00007FF_Write(u8* Data, CaculationParaStruct* Para)
{
	ResultEnum Result = NO_ERROR;
	Result += QCSG_AFN04_E0000700_Write(Data, Para);
	Data += 1;
	Result += QCSG_AFN04_E0000701_Write(Data, Para);
	Data += 30;
	Result += QCSG_AFN04_E0000702_Write(Data, Para);
	Data += 30;
	Result += QCSG_AFN04_E0000703_Write(Data, Para);
	Data += 30;
	Result += QCSG_AFN04_E0000704_Write(Data, Para);
	Data += 30;
	Result += QCSG_AFN04_E0000705_Write(Data, Para);
	Data += 30;
	Result += QCSG_AFN04_E0000706_Write(Data, Para);
	Data += 30;
	Result += QCSG_AFN04_E0000707_Write(Data, Para);
	Data += 30;
	Result += QCSG_AFN04_E0000708_Write(Data, Para);
	Data += 30;
	Result += QCSG_AFN04_E00007FE_Write(Data, Para);
	Data += 32;

	if(Result != NO_ERROR)
	{
		Result = ERROR_InvalidData;
	}
	return Result;	
}


ResultEnum QCSG_AFN04_E0000800_E00008FF(QCSGFrameStruct* SrcFrame, QCSGFrameStruct* DstFrame, QCSGFrameProcessStruct* QCSGFp)
{
	DiffCaculationParaStruct DiffPara;
	ResultEnum Result = NO_ERROR;
	u8* pData = &SrcFrame->Data[QCSGFp->SrcDataPos];	
	
	if(QCSGFp->TempPn == 0)
	{
		MemSet((u8*)&DiffPara, 0, sizeof(DiffCaculationParaStruct));
		MR((u32)&DiffPara, ADDR_DiffPara, sizeof(DiffCaculationParaStruct));
	}
	
	switch(QCSGFp->CurDataID)
	{
		case 0xE0000800:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E0000800_Write(pData, &DiffPara);
			break;
		case 0xE0000801://差动规则 第01条
			QCSGFp->SrcDataPos += 15;
			Result = QCSG_AFN04_E0000801_Write(pData, &DiffPara);
			break;
		case 0xE0000802:
			QCSGFp->SrcDataPos += 15;
			Result = QCSG_AFN04_E0000802_Write(pData, &DiffPara);
			break;
		case 0xE0000803:
			QCSGFp->SrcDataPos += 15;
			Result = QCSG_AFN04_E0000803_Write(pData, &DiffPara);
			break;
		case 0xE0000804:
			QCSGFp->SrcDataPos += 15;
			Result = QCSG_AFN04_E0000804_Write(pData, &DiffPara);
			break;
		case 0xE0000805:
			QCSGFp->SrcDataPos += 15;
			Result = QCSG_AFN04_E0000805_Write(pData, &DiffPara);
			break;
		case 0xE0000806:
			QCSGFp->SrcDataPos += 15;
			Result = QCSG_AFN04_E0000806_Write(pData, &DiffPara);
			break;
		case 0xE0000807:
			QCSGFp->SrcDataPos += 15;
			Result = QCSG_AFN04_E0000807_Write(pData, &DiffPara);
			break;
		case 0xE0000808:
			QCSGFp->SrcDataPos += 15;
			Result = QCSG_AFN04_E0000808_Write(pData, &DiffPara);
			break;
		case 0xE00008FE:
			QCSGFp->SrcDataPos += 32;
			Result = QCSG_AFN04_E00008FE_Write(pData, &DiffPara);
			break;
		case 0xE00008FF:
			QCSGFp->SrcDataPos += 153;
			Result = QCSG_AFN04_E00008FF_Write(pData, &DiffPara);
			break;	
		default:
			QCSGFp->SrcDataPos = QCSGFp->UserDataLen;
			Result = ERROR_NoSuchDataID;
			break;			
	}
	
	if(QCSGFp->TempPn == 0)
	{
		if(Result == NO_ERROR)
		{
			MW((u32)&DiffPara, ADDR_DiffPara, sizeof(DiffCaculationParaStruct));
		}
	}
	else
	{
		Result = ERROR_VerifyFail;
	}
	return Result;
}

ResultEnum QCSG_AFN04_E0000800_Write(u8* Data, DiffCaculationParaStruct* Para)
{	
	if(Data[0] > MAX_DIFF_CACU_NUM) return ERROR_InvalidData;
	Para->DiffNum = Data[0];
	return NO_ERROR;	
}

