gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/QCSG_AFN04.c
ResultEnum QCSG_AFN04_E0000801_Write(u8* Data, DiffCaculationParaStruct* Para)
{
	MemCopy(Para->DiffID[0], Data, 15);

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000802_Write(u8* Data, DiffCaculationParaStruct* Para)
{
	MemCopy(Para->DiffID[1], Data, 15);

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000803_Write(u8* Data, DiffCaculationParaStruct* Para)
{
	MemCopy(Para->DiffID[2], Data, 15);

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000804_Write(u8* Data, DiffCaculationParaStruct* Para)
{
	MemCopy(Para->DiffID[3], Data, 15);

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000805_Write(u8* Data, DiffCaculationParaStruct* Para)
{
	MemCopy(Para->DiffID[4], Data, 15);

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000806_Write(u8* Data, DiffCaculationParaStruct* Para)
{
	MemCopy(Para->DiffID[5], Data, 15);

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000807_Write(u8* Data, DiffCaculationParaStruct* Para)
{
	MemCopy(Para->DiffID[6], Data, 15);

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000808_Write(u8* Data, DiffCaculationParaStruct* Para)
{
	MemCopy(Para->DiffID[7], Data, 15);

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E00008FE_Write(u8* Data, DiffCaculationParaStruct* Para)
{
	MemCopy(Para->DiffStateMark, Data, 32);

	return NO_ERROR;	
}


ResultEnum QCSG_AFN04_E00008FF_Write(u8* Data, DiffCaculationParaStruct* Para)
{
	ResultEnum Result = NO_ERROR;
	Result += QCSG_AFN04_E0000800_Write(Data, Para);
	Data += 1;
	Result += QCSG_AFN04_E0000801_Write(Data, Para);
	Data += 15;
	Result += QCSG_AFN04_E0000802_Write(Data, Para);
	Data += 15;
	Result += QCSG_AFN04_E0000803_Write(Data, Para);
	Data += 15;
	Result += QCSG_AFN04_E0000804_Write(Data, Para);
	Data += 15;
	Result += QCSG_AFN04_E0000805_Write(Data, Para);
	Data += 15;
	Result += QCSG_AFN04_E0000806_Write(Data, Para);
	Data += 15;
	Result += QCSG_AFN04_E0000807_Write(Data, Para);
	Data += 15;
	Result += QCSG_AFN04_E0000808_Write(Data, Para);
	Data += 15;
	Result += QCSG_AFN04_E00008FE_Write(Data, Para);
	Data += 32;

	if(Result != NO_ERROR)
	{
		Result = ERROR_InvalidData;
	}
	return Result;	
}



ResultEnum QCSG_AFN04_E0000A00_E0000B02(QCSGFrameStruct* SrcFrame, QCSGFrameStruct* DstFrame, QCSGFrameProcessStruct* QCSGFp)
{
	ResultEnum Result = NO_ERROR;
	u8* pData = &SrcFrame->Data[QCSGFp->SrcDataPos];
	u32 WriteLen = 0;
	u8 DataBuf[48];
	RS485PortParaStruct * pRS485PortPara = (RS485PortParaStruct*)DataBuf;
	AttachmentParaStruct* pAttachmentPara = (AttachmentParaStruct*)DataBuf;	
	MemSet(DataBuf, 0, 48);
	switch(QCSGFp->CurDataID)
	{
		case 0xE0000A00://485-1端口参数
		case 0xE0000A01://485-2端口参数
		case 0xE0000A02://485-3端口参数
			QCSGFp->SrcDataPos += 5;
			if(QCSGFp->TempPn == 0)
			{
				if((pData[0] <= UART_FUNC_UPLINK) && (pData[2] <= UART_PARITY_ODD) && 
				   (pData[3] >= UART_DATA_BIT_5) && (pData[3] <= UART_DATA_BIT_8) && (pData[4] <= UART_STOP_BIT_2))
				{
					Result = NAND_ReadPara(PARA_RS485Port, QCSGFp->Pn, QCSGFp->CurDataID, (u8*)pRS485PortPara, &WriteLen);
					MemCopy((u8*)pRS485PortPara, pData, 5);	
					Result = NAND_WritePara(PARA_RS485Port, QCSGFp->Pn, QCSGFp->CurDataID, (u8*)pRS485PortPara, &WriteLen);
				}
				else
				{
					Result = ERROR_InvalidData;
				}
			}
			else
			{
				Result = ERROR_VerifyFail;
			}
			break;
		case 0xE0000A20:
			QCSGFp->SrcDataPos += 24;
			if(QCSGFp->TempPn == 0)
			{
				MR((u32)pAttachmentPara, ADDR_AttachmentPara, sizeof(AttachmentParaStruct));
				MemCopy(pAttachmentPara->SlaveAddr1, pData, 24);
				MW((u32)pAttachmentPara, ADDR_AttachmentPara, sizeof(AttachmentParaStruct));
			}
			else
			{
				Result = ERROR_VerifyFail;
			}	
			break;
		case 0xE0000A21:
			QCSGFp->SrcDataPos += 4;
			if(QCSGFp->TempPn == 0)
			{
				MR((u32)pAttachmentPara, ADDR_AttachmentPara, sizeof(AttachmentParaStruct));
				MemCopy(pAttachmentPara->MasterAddr, pData, 4);
				MW((u32)pAttachmentPara, ADDR_AttachmentPara, sizeof(AttachmentParaStruct));
			}
			else
			{
				Result = ERROR_VerifyFail;
			}
			break;
		case 0xE0000A22:
			QCSGFp->SrcDataPos += 4;
			if(QCSGFp->TempPn == 0)
			{
				MR((u32)pAttachmentPara, ADDR_AttachmentPara, sizeof(AttachmentParaStruct));
				MemCopy(pAttachmentPara->AMRSlaveAddr, pData, 4);
				MW((u32)pAttachmentPara, ADDR_AttachmentPara, sizeof(AttachmentParaStruct));
			}
			else
			{
				Result = ERROR_VerifyFail;
			}
			break;
		case 0xE0000A23:
			QCSGFp->SrcDataPos += 1;
			if(QCSGFp->TempPn == 0)
			{
				if(BCD_Check(pData, 1) == NO_ERROR)
				{
					MR((u32)pAttachmentPara, ADDR_AttachmentPara, sizeof(AttachmentParaStruct));
					pAttachmentPara->MasterTimeOut = pData[0];
					MW((u32)pAttachmentPara, ADDR_AttachmentPara, sizeof(AttachmentParaStruct));
				}
				else
				{
					Result = ERROR_InvalidData;
				}
			}
			else
			{
				Result = ERROR_VerifyFail;
			}
			break;
		case 0xE0000A24:
			QCSGFp->SrcDataPos += 1;
			if(QCSGFp->TempPn == 0)
			{
				if(BCD_Check(pData, 1) == NO_ERROR)
				{
					MR((u32)pAttachmentPara, ADDR_AttachmentPara, sizeof(AttachmentParaStruct));
					pAttachmentPara->SlaveTimeOut = pData[0];
					MW((u32)pAttachmentPara, ADDR_AttachmentPara, sizeof(AttachmentParaStruct));
				}
				else
				{
					Result = ERROR_InvalidData;
				}
			}
			else
			{
				Result = ERROR_VerifyFail;
			}
			break;
		case 0xE0000A25:
			QCSGFp->SrcDataPos += 2;
			if(QCSGFp->TempPn == 0)
			{
				MR((u32)pAttachmentPara, ADDR_AttachmentPara, sizeof(AttachmentParaStruct));
				MemCopy((u8*)&pAttachmentPara->CT, pData, 2);
				MW((u32)pAttachmentPara, ADDR_AttachmentPara, sizeof(AttachmentParaStruct));
			}
			else
			{
				Result = ERROR_VerifyFail;
			}
			break;
		case 0xE0000A26:
			QCSGFp->SrcDataPos += 2;
			if(QCSGFp->TempPn == 0)
			{
				MR((u32)pAttachmentPara, ADDR_AttachmentPara, sizeof(AttachmentParaStruct));
				MemCopy((u8*)&pAttachmentPara->PT, pData, 2);
				MW((u32)pAttachmentPara, ADDR_AttachmentPara, sizeof(AttachmentParaStruct));
			}
			else
			{
				Result = ERROR_VerifyFail;
			}
			break;	
		case 0xE0000A30:
			QCSGFp->SrcDataPos += 1;
			Result = ERROR_InvalidData;
			break;
		case 0xE0000A31:
			QCSGFp->SrcDataPos += 4;
			Result = ERROR_InvalidData;
			break;
		case 0xE0000A32:
			QCSGFp->SrcDataPos += 4;
			Result = ERROR_InvalidData;
			break;
		case 0xE0000A33:
			QCSGFp->SrcDataPos += 8;
			Result = ERROR_InvalidData;
			break;
		case 0xE0000B00:
			QCSGFp->SrcDataPos += 2;
			Result = ERROR_InvalidData;
			break;
		case 0xE0000B01:
			QCSGFp->SrcDataPos += 6;
			Result = ERROR_InvalidData;
			break;
		case 0xE0000B02:
			QCSGFp->SrcDataPos += 2;
			Result = ERROR_InvalidData;
			break;
		default:
			QCSGFp->SrcDataPos = QCSGFp->UserDataLen;
			Result = ERROR_NoSuchDataID;
			break;			
	}
	return Result;
}



ResultEnum QCSG_AFN04_E0000C00_E0000E11(QCSGFrameStruct* SrcFrame, QCSGFrameStruct* DstFrame, QCSGFrameProcessStruct* QCSGFp)
{
	ResultEnum Result = NO_ERROR;
	u8* pData = &SrcFrame->Data[QCSGFp->SrcDataPos];
	u32 i = 0;
	LoadManagementParaStruct LoadPara;
	MemSet((u8*)&LoadPara, 0, sizeof(LoadManagementParaStruct));
	if(QCSGFp->TempPn == 0)
	{
		MR((u32)&LoadPara, ADDR_LoadManagementPara, sizeof(LoadManagementParaStruct));
	}
	switch(QCSGFp->CurDataID)
	{
		case 0xE0000C00://　　开关编号 0的开关接点类	型
		case 0xE0000C01:
		case 0xE0000C02:
		case 0xE0000C03:
		case 0xE0000C04:
		case 0xE0000C05:
		case 0xE0000C06:
		case 0xE0000C07:
		case 0xE0000C08:
		case 0xE0000C09:
		case 0xE0000C0A:
		case 0xE0000C0B:
		case 0xE0000C0C:
		case 0xE0000C0D:
		case 0xE0000C0E://　　开关编号 14的开关接点类	型
			QCSGFp->SrcDataPos += 1;
			LoadPara.SwitchNodeType[QCSGFp->CurDataID & 0x0000000F] = pData[0];
			QCSG_NoticeDIChange(DI_E0000C00, TRUE);
			break;
		case 0xE0000C0F:
			QCSGFp->SrcDataPos += 15;
			MemCopy(LoadPara.SwitchNodeType, pData, 15);
			QCSG_NoticeDIChange(DI_E0000C00, TRUE);
			break;
		case 0xE0000C10:
		case 0xE0000C11:
		case 0xE0000C12:
		case 0xE0000C13:
		case 0xE0000C14:
		case 0xE0000C15:
		case 0xE0000C16:
		case 0xE0000C17:
		case 0xE0000C18:
		case 0xE0000C19:
		case 0xE0000C1A:
		case 0xE0000C1B:
		case 0xE0000C1C:
		case 0xE0000C1D:
		case 0xE0000C1E:
			QCSGFp->SrcDataPos += 1;
			LoadPara.InputSwitchState[QCSGFp->CurDataID & 0x0000000F] = pData[0];	
			Result = ERROR_InvalidData;
			break;
		case 0xE0000C1F:
			QCSGFp->SrcDataPos += 15;
			MemCopy(LoadPara.InputSwitchState, pData, 15);	
			Result = ERROR_InvalidData;
			break;
		case 0xE0000C20:		//输出开关0的状态
		case 0xE0000C21:
		case 0xE0000C22:
		case 0xE0000C23:
		case 0xE0000C24:
		case 0xE0000C25:
		case 0xE0000C26:
		case 0xE0000C27:
		case 0xE0000C28:
		case 0xE0000C29:
		case 0xE0000C2A:
		case 0xE0000C2B:
		case 0xE0000C2C:
		case 0xE0000C2D:
		case 0xE0000C2E:		//输出开关14的状态
			QCSGFp->SrcDataPos += 1;
			LoadPara.OutputSwitchState[QCSGFp->CurDataID & 0x0000000F] = pData[0];
			QCSG_NoticeDIChange(DI_E0000C2F,TRUE);
			break;
		case 0xE0000C2F:
			QCSGFp->SrcDataPos += 15;
			MemCopy(LoadPara.OutputSwitchState, pData, 15);
			QCSG_NoticeDIChange(DI_E0000C2F,TRUE);
			break;
		case 0xE0000C30:
		case 0xE0000C31:
		case 0xE0000C32:
		case 0xE0000C33:
		case 0xE0000C34:
		case 0xE0000C35:
		case 0xE0000C36:
		case 0xE0000C37:
		case 0xE0000C38:
		case 0xE0000C39:
		case 0xE0000C3A:
		case 0xE0000C3B:
		case 0xE0000C3C:
		case 0xE0000C3D:
		case 0xE0000C3E:
			QCSGFp->SrcDataPos += 1;
			LoadPara.OutputSwitchRound[QCSGFp->CurDataID & 0x0000000F] = pData[0];
			break;
		case 0xE0000C3F:
			QCSGFp->SrcDataPos += 15;
			MemCopy(LoadPara.OutputSwitchRound, pData, 15);
			break;
		case 0xE0000C40:
			QCSGFp->SrcDataPos += 2;
			MemCopy((u8*)&LoadPara.RemoteSwitchOffTime, pData, 2);			
			break;
		case 0xE0000C50:
			QCSGFp->SrcDataPos += 1;
			LoadPara.PowerHoldState = pData[0];
			QCSG_NoticeDIChange(DI_E0000C50,TRUE);	
			break;
		case 0xE0000C60://功率控制是否有效
			QCSGFp->SrcDataPos += 1;
			LoadPara.PowerCtrlFlag = pData[0];
			break;
		case 0xE0000C61:
			QCSGFp->SrcDataPos += 1;
			LoadPara.MonthKwhCtrlFlag = pData[0];
			break;
		case 0xE0000C62:
			QCSGFp->SrcDataPos += 1;
			LoadPara.PurchaseKwhCtrlFlag = pData[0];
			break;
		case 0xE0000C63://功率控制各轮次跳闸是否有效
			QCSGFp->SrcDataPos += 1;
			LoadPara.PowerCtrlRoundFlag = pData[0];
			break;
		case 0xE0000C64://月电量控制跳闸轮次有效标志
			QCSGFp->SrcDataPos += 1;
			LoadPara.MonthKwhCtrlRoundFlag = pData[0];
			break;
		case 0xE0000C65:
			QCSGFp->SrcDataPos += 1;
			LoadPara.PurchaseKwhCtrlRoundFlag = pData[0];
			break;
		case 0xE0000C66:	//超过设定值跳闸的过负荷持续时间.缺省 10 分钟
			QCSGFp->SrcDataPos += 3;
			if(BCD_Check(pData, 3) == NO_ERROR)
			{
				MemCopy((u8*)&LoadPara.PowerOverLoadTime, pData, 3);
			}
			else
			{
				Result = ERROR_InvalidData;
			}
			break;
		case 0xE0000C67:
			QCSGFp->SrcDataPos += 3;
			if(BCD_Check(pData, 3) == NO_ERROR)
			{
				MemCopy((u8*)&LoadPara.PowerResetTime, pData, 3);
			}
			else
			{
				Result = ERROR_InvalidData;
			}	
			break;
		case 0xE0000C68:
			QCSGFp->SrcDataPos += 1;
			if(BCD_Check(pData, 1) == NO_ERROR)
			{
				LoadPara.AlarmDelayTime = pData[0];
			}
			else
			{
				Result = ERROR_InvalidData;
			}	
			break;
		case 0xE0000C69://功率控制用功率累加标志
			QCSGFp->SrcDataPos += 17;
			LoadPara.PowerCtrlIncFlag = pData[0];
			MemCopy((u8*)LoadPara.PowerCtrlPoint, &pData[1], 16);
			for(i = 0; i < SIZE_8; i++)
			{
				if(BCD_Check((u8*)&LoadPara.PowerCtrlPoint[i], 2) == NO_ERROR) continue;
				if(LoadPara.PowerCtrlPoint[i] == 0xFFFF) continue;
				break;
			}			
			if(i < SIZE_8)
			{
				Result = ERROR_InvalidData;
			}
			break;
		case 0xE0000C6A://电量控制用电量累加标志
			QCSGFp->SrcDataPos += 17;
			LoadPara.KwhCtrlIncFlag= pData[0];
			MemCopy((u8*)LoadPara.KwhCtrlPoint, &pData[1], 16);
			for(i = 0; i < SIZE_8; i++)
			{
				if(BCD_Check((u8*)&LoadPara.KwhCtrlPoint[i], 2) == NO_ERROR) continue;
				if(LoadPara.KwhCtrlPoint[i] == 0xFFFF) continue;
				break;
			}			
			if(i < SIZE_8)
			{
				Result = ERROR_InvalidData;
			}		
			break;
		case 0xE0000C6B:	//功率定值浮动系数（％）
			QCSGFp->SrcDataPos += 1;
			LoadPara.E0000C6B = pData[0];
			break;
		case 0xE0000C6C:
			QCSGFp->SrcDataPos += 1;
			LoadPara.E0000C6C = pData[0];
			break;
		case 0xE0000C6D:
			QCSGFp->SrcDataPos += 4;
			MemCopy((u8*)&LoadPara.E0000C6D, pData, 4);
			break;
		case 0xE0000C70:
			QCSGFp->SrcDataPos += 4;
			MemCopy((u8*)&LoadPara.E0000C70, pData, 4);
			break;
		case 0xE0000C71:
			QCSGFp->SrcDataPos += 1;
			LoadPara.E0000C71 = pData[0];
			break;
		case 0xE0000D00:	//时段数
			QCSGFp->SrcDataPos += 1;	
			Result = QCSG_AFN04_E0000D00_Write(pData, &LoadPara);
			break;
		case 0xE0000D01:
			QCSGFp->SrcDataPos += 7;
			Result = QCSG_AFN04_E0000D01_Write(pData, &LoadPara);
			break;
		case 0xE0000D02:
			QCSGFp->SrcDataPos += 7;
			Result = QCSG_AFN04_E0000D02_Write(pData, &LoadPara);
			break;
		case 0xE0000D03:
			QCSGFp->SrcDataPos += 7;
			Result = QCSG_AFN04_E0000D03_Write(pData, &LoadPara);
			break;
		case 0xE0000D04:
			QCSGFp->SrcDataPos += 7;
			Result = QCSG_AFN04_E0000D04_Write(pData, &LoadPara);
			break;
		case 0xE0000D05:
			QCSGFp->SrcDataPos += 7;
			Result = QCSG_AFN04_E0000D05_Write(pData, &LoadPara);
			break;
		case 0xE0000D06:
			QCSGFp->SrcDataPos += 7;
			Result = QCSG_AFN04_E0000D06_Write(pData, &LoadPara);
			break;
		case 0xE0000D07:
			QCSGFp->SrcDataPos += 7;
			Result = QCSG_AFN04_E0000D07_Write(pData, &LoadPara);
			break;
		case 0xE0000D08:
			QCSGFp->SrcDataPos += 7;
			Result = QCSG_AFN04_E0000D08_Write(pData, &LoadPara);
			break;
		case 0xE0000D09:	//　　功率控制系列 1,执行时间
			QCSGFp->SrcDataPos += 9;
			Result = QCSG_AFN04_E0000D09_Write(pData, &LoadPara);
			break;
		case 0xE0000D0F:
			QCSGFp->SrcDataPos += 66;
			Result = QCSG_AFN04_E0000D0F_Write(pData, &LoadPara);
			break;

