gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/QCSG_AFN04.c
		case 0xE0000D10:
			QCSGFp->SrcDataPos += 1;	
			Result = QCSG_AFN04_E0000D10_Write(pData, &LoadPara);
			break;
		case 0xE0000D11:
			QCSGFp->SrcDataPos += 7;
			Result = QCSG_AFN04_E0000D11_Write(pData, &LoadPara);
			break;
		case 0xE0000D12:
			QCSGFp->SrcDataPos += 7;
			Result = QCSG_AFN04_E0000D12_Write(pData, &LoadPara);
			break;
		case 0xE0000D13:
			QCSGFp->SrcDataPos += 7;
			Result = QCSG_AFN04_E0000D13_Write(pData, &LoadPara);
			break;
		case 0xE0000D14:
			QCSGFp->SrcDataPos += 7;			
			Result = QCSG_AFN04_E0000D14_Write(pData, &LoadPara);
			break;
		case 0xE0000D15:
			QCSGFp->SrcDataPos += 7;			
			Result = QCSG_AFN04_E0000D15_Write(pData, &LoadPara);
			break;
		case 0xE0000D16:
			QCSGFp->SrcDataPos += 7;			
			Result = QCSG_AFN04_E0000D16_Write(pData, &LoadPara);
			break;
		case 0xE0000D17:
			QCSGFp->SrcDataPos += 7;
			Result = QCSG_AFN04_E0000D17_Write(pData, &LoadPara);
			break;
		case 0xE0000D18:
			QCSGFp->SrcDataPos += 7;			
			Result = QCSG_AFN04_E0000D18_Write(pData, &LoadPara);
			break;
		case 0xE0000D19:
			QCSGFp->SrcDataPos += 9;
			Result = QCSG_AFN04_E0000D19_Write(pData, &LoadPara);						
			break;
		case 0xE0000D1F:
			QCSGFp->SrcDataPos += 66;
			Result = QCSG_AFN04_E0000D1F_Write(pData, &LoadPara);						
			break;

		case 0xE0000D20:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E0000D20_Write(pData, &LoadPara);
			break;
		case 0xE0000D21:
			QCSGFp->SrcDataPos += 7;			
			Result = QCSG_AFN04_E0000D21_Write(pData, &LoadPara);
			break;
		case 0xE0000D22:
			QCSGFp->SrcDataPos += 7;			
			Result = QCSG_AFN04_E0000D22_Write(pData, &LoadPara);
			break;
		case 0xE0000D23:
			QCSGFp->SrcDataPos += 7;
			Result = QCSG_AFN04_E0000D23_Write(pData, &LoadPara);
			break;
		case 0xE0000D24:
			QCSGFp->SrcDataPos += 7;			
			Result = QCSG_AFN04_E0000D24_Write(pData, &LoadPara);
			break;
		case 0xE0000D25:
			QCSGFp->SrcDataPos += 7;			
			Result = QCSG_AFN04_E0000D25_Write(pData, &LoadPara);
			break;
		case 0xE0000D26:
			QCSGFp->SrcDataPos += 7;			
			Result = QCSG_AFN04_E0000D26_Write(pData, &LoadPara);
			break;
		case 0xE0000D27:
			QCSGFp->SrcDataPos += 7;
			Result = QCSG_AFN04_E0000D27_Write(pData, &LoadPara);
			break;
		case 0xE0000D28:
			QCSGFp->SrcDataPos += 7;			
			Result = QCSG_AFN04_E0000D28_Write(pData, &LoadPara);
			break;
		case 0xE0000D29:
			QCSGFp->SrcDataPos += 9;			
			Result = QCSG_AFN04_E0000D29_Write(pData, &LoadPara);
			break;
		case 0xE0000D2F:
			QCSGFp->SrcDataPos += 66;			
			Result = QCSG_AFN04_E0000D2F_Write(pData, &LoadPara);
			break;

		case 0xE0000D30:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E0000D30_Write(pData, &LoadPara);
			break;
		case 0xE0000D31:
			QCSGFp->SrcDataPos += 7;			
			Result = QCSG_AFN04_E0000D31_Write(pData, &LoadPara);
			break;
		case 0xE0000D32:
			QCSGFp->SrcDataPos += 7;			
			Result = QCSG_AFN04_E0000D32_Write(pData, &LoadPara);
			break;
		case 0xE0000D33:
			QCSGFp->SrcDataPos += 7;
			Result = QCSG_AFN04_E0000D33_Write(pData, &LoadPara);
			break;
		case 0xE0000D34:
			QCSGFp->SrcDataPos += 7;			
			Result = QCSG_AFN04_E0000D34_Write(pData, &LoadPara);
			break;
		case 0xE0000D35:
			QCSGFp->SrcDataPos += 7;			
			Result = QCSG_AFN04_E0000D35_Write(pData, &LoadPara);
			break;
		case 0xE0000D36:
			QCSGFp->SrcDataPos += 7;			
			Result = QCSG_AFN04_E0000D36_Write(pData, &LoadPara);
			break;
		case 0xE0000D37:
			QCSGFp->SrcDataPos += 7;
			Result = QCSG_AFN04_E0000D37_Write(pData, &LoadPara);
			break;
		case 0xE0000D38:
			QCSGFp->SrcDataPos += 7;			
			Result = QCSG_AFN04_E0000D38_Write(pData, &LoadPara);
			break;
		case 0xE0000D39:
			QCSGFp->SrcDataPos += 9;			
			Result = QCSG_AFN04_E0000D39_Write(pData, &LoadPara);
			break;
		case 0xE0000D3F:
			QCSGFp->SrcDataPos += 66;			
			Result = QCSG_AFN04_E0000D3F_Write(pData, &LoadPara);
			break;
		
		case 0xE0000E00:	//月电量控制，月电量限额（一次值）
			QCSGFp->SrcDataPos += 4;
			if(BCD_Check(pData, 4) == NO_ERROR)
			{			
				MemCopy((u8*)&LoadPara.E0000E00, pData, 4);
			}
			else
			{
				Result = ERROR_InvalidData;
			}
			break;	
		case 0xE0000E01://月电量控制，轮次电量（一次值）
			QCSGFp->SrcDataPos += 4;
			if(BCD_Check(pData, 4) == NO_ERROR)
			{
				MemCopy((u8*)&LoadPara.E0000E01, pData, 4);
			}
			else
			{
				Result = ERROR_InvalidData;
			}
			break;
		case 0xE0000E02:
			QCSGFp->SrcDataPos += 5;
			if(BCD_Check(pData, 5) == NO_ERROR)
			{
				MemCopy(LoadPara.E0000E02, pData, 5);
			}
			else
			{
				Result = ERROR_InvalidData;
			}
			break;
		case 0xE0000E03:
			QCSGFp->SrcDataPos += 5;
			if(BCD_Check(pData, 5) == NO_ERROR)
			{
				MemCopy(LoadPara.E0000E03, pData, 5);
			}
			else
			{
				Result = ERROR_InvalidData;
			}
			break;
		case 0xE0000E04:
			QCSGFp->SrcDataPos += 49;
			if(BCD_Check(pData, 49) == NO_ERROR)
			{
				MemCopy(LoadPara.E0000E04, pData, 49);
			}
			else
			{
				Result = ERROR_InvalidData;
			}	
			break;
		case 0xE0000E05:
			QCSGFp->SrcDataPos += 1;
			LoadPara.E0000E05 = pData[0];			
			break;
		case 0xE0000E10:
			QCSGFp->SrcDataPos += 1;
			LoadPara.E0000E10 = pData[0];
			break;
		case 0xE0000E11:
			QCSGFp->SrcDataPos += 10;
			if(BCD_Check(pData, 10) == NO_ERROR)
			{
				MemCopy(LoadPara.E0000E11, pData, 10);
			}
			else
			{
				Result = ERROR_InvalidData;
			}				
			break;
		default:
			QCSGFp->SrcDataPos = QCSGFp->UserDataLen;
			Result = ERROR_NoSuchDataID;
			break;			
	}
	
	if(QCSGFp->TempPn == 0)
	{
		if(Result == NO_ERROR)
		{
			MW((u32)&LoadPara, ADDR_LoadManagementPara, sizeof(LoadManagementParaStruct));
		}
	}
	else
	{
		Result = ERROR_VerifyFail;
	}
	return Result;
}


ResultEnum QCSG_AFN04_E0000D00_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[0].PowerCtrlPeriodCnt = Data[0];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000D01_Write(u8* Data, LoadManagementParaStruct* Para)
{	
	Para->KwCtrl[0].Option[0].StartMinute   = Data[0];
	Para->KwCtrl[0].Option[0].StartHour     = Data[1];
	Para->KwCtrl[0].Option[0].EffectiveFlag = Data[2];
	Para->KwCtrl[0].Option[0].PowerLoad     = Data[6];
	Para->KwCtrl[0].Option[0].PowerLoad   <<= 8;
	Para->KwCtrl[0].Option[0].PowerLoad    += Data[5];
	Para->KwCtrl[0].Option[0].PowerLoad   <<= 8;
	Para->KwCtrl[0].Option[0].PowerLoad    += Data[4];
	Para->KwCtrl[0].Option[0].PowerLoad   <<= 8;
	Para->KwCtrl[0].Option[0].PowerLoad    += Data[3];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000D02_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[0].Option[1].StartMinute   = Data[0];
	Para->KwCtrl[0].Option[1].StartHour     = Data[1];
	Para->KwCtrl[0].Option[1].EffectiveFlag = Data[2];
	Para->KwCtrl[0].Option[1].PowerLoad     = Data[6];
	Para->KwCtrl[0].Option[1].PowerLoad   <<= 8;
	Para->KwCtrl[0].Option[1].PowerLoad    += Data[5];
	Para->KwCtrl[0].Option[1].PowerLoad   <<= 8;
	Para->KwCtrl[0].Option[1].PowerLoad    += Data[4];
	Para->KwCtrl[0].Option[1].PowerLoad   <<= 8;
	Para->KwCtrl[0].Option[1].PowerLoad    += Data[3];

	return NO_ERROR;	
}

