gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/QCSG_AFN04.c
ResultEnum QCSG_AFN04_E0000D03_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[0].Option[2].StartMinute   = Data[0];
	Para->KwCtrl[0].Option[2].StartHour     = Data[1];
	Para->KwCtrl[0].Option[2].EffectiveFlag = Data[2];
	Para->KwCtrl[0].Option[2].PowerLoad     = Data[6];
	Para->KwCtrl[0].Option[2].PowerLoad   <<= 8;
	Para->KwCtrl[0].Option[2].PowerLoad    += Data[5];
	Para->KwCtrl[0].Option[2].PowerLoad   <<= 8;
	Para->KwCtrl[0].Option[2].PowerLoad    += Data[4];
	Para->KwCtrl[0].Option[2].PowerLoad   <<= 8;
	Para->KwCtrl[0].Option[2].PowerLoad    += Data[3];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000D04_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[0].Option[3].StartMinute   = Data[0];
	Para->KwCtrl[0].Option[3].StartHour     = Data[1];
	Para->KwCtrl[0].Option[3].EffectiveFlag = Data[2];
	Para->KwCtrl[0].Option[3].PowerLoad     = Data[6];
	Para->KwCtrl[0].Option[3].PowerLoad   <<= 8;
	Para->KwCtrl[0].Option[3].PowerLoad    += Data[5];
	Para->KwCtrl[0].Option[3].PowerLoad   <<= 8;
	Para->KwCtrl[0].Option[3].PowerLoad    += Data[4];
	Para->KwCtrl[0].Option[3].PowerLoad   <<= 8;
	Para->KwCtrl[0].Option[3].PowerLoad    += Data[3];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000D05_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[0].Option[4].StartMinute   = Data[0];
	Para->KwCtrl[0].Option[4].StartHour     = Data[1];
	Para->KwCtrl[0].Option[4].EffectiveFlag = Data[2];
	Para->KwCtrl[0].Option[4].PowerLoad     = Data[6];
	Para->KwCtrl[0].Option[4].PowerLoad   <<= 8;
	Para->KwCtrl[0].Option[4].PowerLoad    += Data[5];
	Para->KwCtrl[0].Option[4].PowerLoad   <<= 8;
	Para->KwCtrl[0].Option[4].PowerLoad    += Data[4];
	Para->KwCtrl[0].Option[4].PowerLoad   <<= 8;
	Para->KwCtrl[0].Option[4].PowerLoad    += Data[3];

	return NO_ERROR;	
}


ResultEnum QCSG_AFN04_E0000D06_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[0].Option[5].StartMinute   = Data[0];
	Para->KwCtrl[0].Option[5].StartHour     = Data[1];
	Para->KwCtrl[0].Option[5].EffectiveFlag = Data[2];
	Para->KwCtrl[0].Option[5].PowerLoad     = Data[6];
	Para->KwCtrl[0].Option[5].PowerLoad   <<= 8;
	Para->KwCtrl[0].Option[5].PowerLoad    += Data[5];
	Para->KwCtrl[0].Option[5].PowerLoad   <<= 8;
	Para->KwCtrl[0].Option[5].PowerLoad    += Data[4];
	Para->KwCtrl[0].Option[5].PowerLoad   <<= 8;
	Para->KwCtrl[0].Option[5].PowerLoad    += Data[3];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000D07_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[0].Option[6].StartMinute   = Data[0];
	Para->KwCtrl[0].Option[6].StartHour     = Data[1];
	Para->KwCtrl[0].Option[6].EffectiveFlag = Data[2];
	Para->KwCtrl[0].Option[6].PowerLoad     = Data[6];
	Para->KwCtrl[0].Option[6].PowerLoad   <<= 8;
	Para->KwCtrl[0].Option[6].PowerLoad    += Data[5];
	Para->KwCtrl[0].Option[6].PowerLoad   <<= 8;
	Para->KwCtrl[0].Option[6].PowerLoad    += Data[4];
	Para->KwCtrl[0].Option[6].PowerLoad   <<= 8;
	Para->KwCtrl[0].Option[6].PowerLoad    += Data[3];

	return NO_ERROR;	
}


ResultEnum QCSG_AFN04_E0000D08_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[0].Option[7].StartMinute   = Data[0];
	Para->KwCtrl[0].Option[7].StartHour     = Data[1];
	Para->KwCtrl[0].Option[7].EffectiveFlag = Data[2];
	Para->KwCtrl[0].Option[7].PowerLoad     = Data[6];
	Para->KwCtrl[0].Option[7].PowerLoad   <<= 8;
	Para->KwCtrl[0].Option[7].PowerLoad    += Data[5];
	Para->KwCtrl[0].Option[7].PowerLoad   <<= 8;
	Para->KwCtrl[0].Option[7].PowerLoad    += Data[4];
	Para->KwCtrl[0].Option[7].PowerLoad   <<= 8;
	Para->KwCtrl[0].Option[7].PowerLoad    += Data[3];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000D09_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[0].StartDay   = Data[0];
	Para->KwCtrl[0].StartMonth = Data[1];
	Para->KwCtrl[0].EndDay     = Data[2];
	Para->KwCtrl[0].EndMonth   = Data[3];
	Para->KwCtrl[0].N0 = Data[4];
	Para->KwCtrl[0].N1 = Data[5];
	Para->KwCtrl[0].N2 = Data[6];
	Para->KwCtrl[0].N3 = Data[7];
	Para->KwCtrl[0].TI = Data[8];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000D0F_Write(u8* Data, LoadManagementParaStruct* Para)
{
	ResultEnum Result = NO_ERROR;
	Result += QCSG_AFN04_E0000D00_Write(Data, Para);
	Data += 1;
	Result += QCSG_AFN04_E0000D01_Write(Data, Para);
	Data += 7;
	Result += QCSG_AFN04_E0000D02_Write(Data, Para);
	Data += 7;
	Result += QCSG_AFN04_E0000D03_Write(Data, Para);
	Data += 7;
	Result += QCSG_AFN04_E0000D04_Write(Data, Para);
	Data += 7;
	Result += QCSG_AFN04_E0000D05_Write(Data, Para);
	Data += 7;
	Result += QCSG_AFN04_E0000D06_Write(Data, Para);
	Data += 7;
	Result += QCSG_AFN04_E0000D07_Write(Data, Para);
	Data += 7;
	Result += QCSG_AFN04_E0000D08_Write(Data, Para);
	Data += 7;
	Result += QCSG_AFN04_E0000D09_Write(Data, Para);
	Data += 9;
	return Result;	
}



ResultEnum QCSG_AFN04_E0000D10_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[1].PowerCtrlPeriodCnt = Data[0];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000D11_Write(u8* Data, LoadManagementParaStruct* Para)
{	
	Para->KwCtrl[1].Option[0].StartMinute   = Data[0];
	Para->KwCtrl[1].Option[0].StartHour     = Data[1];
	Para->KwCtrl[1].Option[0].EffectiveFlag = Data[2];
	Para->KwCtrl[1].Option[0].PowerLoad     = Data[6];
	Para->KwCtrl[1].Option[0].PowerLoad   <<= 8;
	Para->KwCtrl[1].Option[0].PowerLoad    += Data[5];
	Para->KwCtrl[1].Option[0].PowerLoad   <<= 8;
	Para->KwCtrl[1].Option[0].PowerLoad    += Data[4];
	Para->KwCtrl[1].Option[0].PowerLoad   <<= 8;
	Para->KwCtrl[1].Option[0].PowerLoad    += Data[3];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000D12_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[1].Option[1].StartMinute   = Data[0];
	Para->KwCtrl[1].Option[1].StartHour     = Data[1];
	Para->KwCtrl[1].Option[1].EffectiveFlag = Data[2];
	Para->KwCtrl[1].Option[1].PowerLoad     = Data[6];
	Para->KwCtrl[1].Option[1].PowerLoad   <<= 8;
	Para->KwCtrl[1].Option[1].PowerLoad    += Data[5];
	Para->KwCtrl[1].Option[1].PowerLoad   <<= 8;
	Para->KwCtrl[1].Option[1].PowerLoad    += Data[4];
	Para->KwCtrl[1].Option[1].PowerLoad   <<= 8;
	Para->KwCtrl[1].Option[1].PowerLoad    += Data[3];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000D13_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[1].Option[2].StartMinute   = Data[0];
	Para->KwCtrl[1].Option[2].StartHour     = Data[1];
	Para->KwCtrl[1].Option[2].EffectiveFlag = Data[2];
	Para->KwCtrl[1].Option[2].PowerLoad     = Data[6];
	Para->KwCtrl[1].Option[2].PowerLoad   <<= 8;
	Para->KwCtrl[1].Option[2].PowerLoad    += Data[5];
	Para->KwCtrl[1].Option[2].PowerLoad   <<= 8;
	Para->KwCtrl[1].Option[2].PowerLoad    += Data[4];
	Para->KwCtrl[1].Option[2].PowerLoad   <<= 8;
	Para->KwCtrl[1].Option[2].PowerLoad    += Data[3];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000D14_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[1].Option[3].StartMinute   = Data[0];
	Para->KwCtrl[1].Option[3].StartHour     = Data[1];
	Para->KwCtrl[1].Option[3].EffectiveFlag = Data[2];
	Para->KwCtrl[1].Option[3].PowerLoad     = Data[6];
	Para->KwCtrl[1].Option[3].PowerLoad   <<= 8;
	Para->KwCtrl[1].Option[3].PowerLoad    += Data[5];
	Para->KwCtrl[1].Option[3].PowerLoad   <<= 8;
	Para->KwCtrl[1].Option[3].PowerLoad    += Data[4];
	Para->KwCtrl[1].Option[3].PowerLoad   <<= 8;
	Para->KwCtrl[1].Option[3].PowerLoad    += Data[3];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000D15_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[1].Option[4].StartMinute   = Data[0];
	Para->KwCtrl[1].Option[4].StartHour     = Data[1];
	Para->KwCtrl[1].Option[4].EffectiveFlag = Data[2];
	Para->KwCtrl[1].Option[4].PowerLoad     = Data[6];
	Para->KwCtrl[1].Option[4].PowerLoad   <<= 8;
	Para->KwCtrl[1].Option[4].PowerLoad    += Data[5];
	Para->KwCtrl[1].Option[4].PowerLoad   <<= 8;
	Para->KwCtrl[1].Option[4].PowerLoad    += Data[4];
	Para->KwCtrl[1].Option[4].PowerLoad   <<= 8;
	Para->KwCtrl[1].Option[4].PowerLoad    += Data[3];

	return NO_ERROR;	
}


ResultEnum QCSG_AFN04_E0000D16_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[1].Option[5].StartMinute   = Data[0];
	Para->KwCtrl[1].Option[5].StartHour     = Data[1];
	Para->KwCtrl[1].Option[5].EffectiveFlag = Data[2];
	Para->KwCtrl[1].Option[5].PowerLoad     = Data[6];
	Para->KwCtrl[1].Option[5].PowerLoad   <<= 8;
	Para->KwCtrl[1].Option[5].PowerLoad    += Data[5];
	Para->KwCtrl[1].Option[5].PowerLoad   <<= 8;
	Para->KwCtrl[1].Option[5].PowerLoad    += Data[4];
	Para->KwCtrl[1].Option[5].PowerLoad   <<= 8;
	Para->KwCtrl[1].Option[5].PowerLoad    += Data[3];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000D17_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[1].Option[6].StartMinute   = Data[0];
	Para->KwCtrl[1].Option[6].StartHour     = Data[1];
	Para->KwCtrl[1].Option[6].EffectiveFlag = Data[2];
	Para->KwCtrl[1].Option[6].PowerLoad     = Data[6];
	Para->KwCtrl[1].Option[6].PowerLoad   <<= 8;
	Para->KwCtrl[1].Option[6].PowerLoad    += Data[5];
	Para->KwCtrl[1].Option[6].PowerLoad   <<= 8;
	Para->KwCtrl[1].Option[6].PowerLoad    += Data[4];
	Para->KwCtrl[1].Option[6].PowerLoad   <<= 8;
	Para->KwCtrl[1].Option[6].PowerLoad    += Data[3];

	return NO_ERROR;	
}


ResultEnum QCSG_AFN04_E0000D18_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[1].Option[7].StartMinute   = Data[0];
	Para->KwCtrl[1].Option[7].StartHour     = Data[1];
	Para->KwCtrl[1].Option[7].EffectiveFlag = Data[2];
	Para->KwCtrl[1].Option[7].PowerLoad     = Data[6];
	Para->KwCtrl[1].Option[7].PowerLoad   <<= 8;
	Para->KwCtrl[1].Option[7].PowerLoad    += Data[5];
	Para->KwCtrl[1].Option[7].PowerLoad   <<= 8;
	Para->KwCtrl[1].Option[7].PowerLoad    += Data[4];
	Para->KwCtrl[1].Option[7].PowerLoad   <<= 8;
	Para->KwCtrl[1].Option[7].PowerLoad    += Data[3];

	return NO_ERROR;	
}

