gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/QCSG_AFN04.c
ResultEnum QCSG_AFN04_E0000D19_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[1].StartDay   = Data[0];
	Para->KwCtrl[1].StartMonth = Data[1];
	Para->KwCtrl[1].EndDay     = Data[2];
	Para->KwCtrl[1].EndMonth   = Data[3];
	Para->KwCtrl[1].N0 = Data[4];
	Para->KwCtrl[1].N1 = Data[5];
	Para->KwCtrl[1].N2 = Data[6];
	Para->KwCtrl[1].N3 = Data[7];
	Para->KwCtrl[1].TI = Data[8];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000D1F_Write(u8* Data, LoadManagementParaStruct* Para)
{
	ResultEnum Result = NO_ERROR;
	Result += QCSG_AFN04_E0000D10_Write(Data, Para);
	Data += 1;
	Result += QCSG_AFN04_E0000D11_Write(Data, Para);
	Data += 7;
	Result += QCSG_AFN04_E0000D12_Write(Data, Para);
	Data += 7;
	Result += QCSG_AFN04_E0000D13_Write(Data, Para);
	Data += 7;
	Result += QCSG_AFN04_E0000D14_Write(Data, Para);
	Data += 7;
	Result += QCSG_AFN04_E0000D15_Write(Data, Para);
	Data += 7;
	Result += QCSG_AFN04_E0000D16_Write(Data, Para);
	Data += 7;
	Result += QCSG_AFN04_E0000D17_Write(Data, Para);
	Data += 7;
	Result += QCSG_AFN04_E0000D18_Write(Data, Para);
	Data += 7;
	Result += QCSG_AFN04_E0000D19_Write(Data, Para);
	Data += 9;
	return Result;	
}


ResultEnum QCSG_AFN04_E0000D20_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[2].PowerCtrlPeriodCnt = Data[0];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000D21_Write(u8* Data, LoadManagementParaStruct* Para)
{	
	Para->KwCtrl[2].Option[0].StartMinute   = Data[0];
	Para->KwCtrl[2].Option[0].StartHour     = Data[1];
	Para->KwCtrl[2].Option[0].EffectiveFlag = Data[2];
	Para->KwCtrl[2].Option[0].PowerLoad     = Data[6];
	Para->KwCtrl[2].Option[0].PowerLoad   <<= 8;
	Para->KwCtrl[2].Option[0].PowerLoad    += Data[5];
	Para->KwCtrl[2].Option[0].PowerLoad   <<= 8;
	Para->KwCtrl[2].Option[0].PowerLoad    += Data[4];
	Para->KwCtrl[2].Option[0].PowerLoad   <<= 8;
	Para->KwCtrl[2].Option[0].PowerLoad    += Data[3];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000D22_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[2].Option[1].StartMinute   = Data[0];
	Para->KwCtrl[2].Option[1].StartHour     = Data[1];
	Para->KwCtrl[2].Option[1].EffectiveFlag = Data[2];
	Para->KwCtrl[2].Option[1].PowerLoad     = Data[6];
	Para->KwCtrl[2].Option[1].PowerLoad   <<= 8;
	Para->KwCtrl[2].Option[1].PowerLoad    += Data[5];
	Para->KwCtrl[2].Option[1].PowerLoad   <<= 8;
	Para->KwCtrl[2].Option[1].PowerLoad    += Data[4];
	Para->KwCtrl[2].Option[1].PowerLoad   <<= 8;
	Para->KwCtrl[2].Option[1].PowerLoad    += Data[3];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000D23_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[2].Option[2].StartMinute   = Data[0];
	Para->KwCtrl[2].Option[2].StartHour     = Data[1];
	Para->KwCtrl[2].Option[2].EffectiveFlag = Data[2];
	Para->KwCtrl[2].Option[2].PowerLoad     = Data[6];
	Para->KwCtrl[2].Option[2].PowerLoad   <<= 8;
	Para->KwCtrl[2].Option[2].PowerLoad    += Data[5];
	Para->KwCtrl[2].Option[2].PowerLoad   <<= 8;
	Para->KwCtrl[2].Option[2].PowerLoad    += Data[4];
	Para->KwCtrl[2].Option[2].PowerLoad   <<= 8;
	Para->KwCtrl[2].Option[2].PowerLoad    += Data[3];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000D24_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[2].Option[3].StartMinute   = Data[0];
	Para->KwCtrl[2].Option[3].StartHour     = Data[1];
	Para->KwCtrl[2].Option[3].EffectiveFlag = Data[2];
	Para->KwCtrl[2].Option[3].PowerLoad     = Data[6];
	Para->KwCtrl[2].Option[3].PowerLoad   <<= 8;
	Para->KwCtrl[2].Option[3].PowerLoad    += Data[5];
	Para->KwCtrl[2].Option[3].PowerLoad   <<= 8;
	Para->KwCtrl[2].Option[3].PowerLoad    += Data[4];
	Para->KwCtrl[2].Option[3].PowerLoad   <<= 8;
	Para->KwCtrl[2].Option[3].PowerLoad    += Data[3];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000D25_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[2].Option[4].StartMinute   = Data[0];
	Para->KwCtrl[2].Option[4].StartHour     = Data[1];
	Para->KwCtrl[2].Option[4].EffectiveFlag = Data[2];
	Para->KwCtrl[2].Option[4].PowerLoad     = Data[6];
	Para->KwCtrl[2].Option[4].PowerLoad   <<= 8;
	Para->KwCtrl[2].Option[4].PowerLoad    += Data[5];
	Para->KwCtrl[2].Option[4].PowerLoad   <<= 8;
	Para->KwCtrl[2].Option[4].PowerLoad    += Data[4];
	Para->KwCtrl[2].Option[4].PowerLoad   <<= 8;
	Para->KwCtrl[2].Option[4].PowerLoad    += Data[3];

	return NO_ERROR;	
}


ResultEnum QCSG_AFN04_E0000D26_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[2].Option[5].StartMinute   = Data[0];
	Para->KwCtrl[2].Option[5].StartHour     = Data[1];
	Para->KwCtrl[2].Option[5].EffectiveFlag = Data[2];
	Para->KwCtrl[2].Option[5].PowerLoad     = Data[6];
	Para->KwCtrl[2].Option[5].PowerLoad   <<= 8;
	Para->KwCtrl[2].Option[5].PowerLoad    += Data[5];
	Para->KwCtrl[2].Option[5].PowerLoad   <<= 8;
	Para->KwCtrl[2].Option[5].PowerLoad    += Data[4];
	Para->KwCtrl[2].Option[5].PowerLoad   <<= 8;
	Para->KwCtrl[2].Option[5].PowerLoad    += Data[3];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000D27_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[2].Option[6].StartMinute   = Data[0];
	Para->KwCtrl[2].Option[6].StartHour     = Data[1];
	Para->KwCtrl[2].Option[6].EffectiveFlag = Data[2];
	Para->KwCtrl[2].Option[6].PowerLoad     = Data[6];
	Para->KwCtrl[2].Option[6].PowerLoad   <<= 8;
	Para->KwCtrl[2].Option[6].PowerLoad    += Data[5];
	Para->KwCtrl[2].Option[6].PowerLoad   <<= 8;
	Para->KwCtrl[2].Option[6].PowerLoad    += Data[4];
	Para->KwCtrl[2].Option[6].PowerLoad   <<= 8;
	Para->KwCtrl[2].Option[6].PowerLoad    += Data[3];

	return NO_ERROR;	
}


ResultEnum QCSG_AFN04_E0000D28_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[2].Option[7].StartMinute   = Data[0];
	Para->KwCtrl[2].Option[7].StartHour     = Data[1];
	Para->KwCtrl[2].Option[7].EffectiveFlag = Data[2];
	Para->KwCtrl[2].Option[7].PowerLoad     = Data[6];
	Para->KwCtrl[2].Option[7].PowerLoad   <<= 8;
	Para->KwCtrl[2].Option[7].PowerLoad    += Data[5];
	Para->KwCtrl[2].Option[7].PowerLoad   <<= 8;
	Para->KwCtrl[2].Option[7].PowerLoad    += Data[4];
	Para->KwCtrl[2].Option[7].PowerLoad   <<= 8;
	Para->KwCtrl[2].Option[7].PowerLoad    += Data[3];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000D29_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[2].StartDay   = Data[0];
	Para->KwCtrl[2].StartMonth = Data[1];
	Para->KwCtrl[2].EndDay     = Data[2];
	Para->KwCtrl[2].EndMonth   = Data[3];
	Para->KwCtrl[2].N0 = Data[4];
	Para->KwCtrl[2].N1 = Data[5];
	Para->KwCtrl[2].N2 = Data[6];
	Para->KwCtrl[2].N3 = Data[7];
	Para->KwCtrl[2].TI = Data[8];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000D2F_Write(u8* Data, LoadManagementParaStruct* Para)
{
	ResultEnum Result = NO_ERROR;
	Result += QCSG_AFN04_E0000D20_Write(Data, Para);
	Data += 1;
	Result += QCSG_AFN04_E0000D21_Write(Data, Para);
	Data += 7;
	Result += QCSG_AFN04_E0000D22_Write(Data, Para);
	Data += 7;
	Result += QCSG_AFN04_E0000D23_Write(Data, Para);
	Data += 7;
	Result += QCSG_AFN04_E0000D24_Write(Data, Para);
	Data += 7;
	Result += QCSG_AFN04_E0000D25_Write(Data, Para);
	Data += 7;
	Result += QCSG_AFN04_E0000D26_Write(Data, Para);
	Data += 7;
	Result += QCSG_AFN04_E0000D27_Write(Data, Para);
	Data += 7;
	Result += QCSG_AFN04_E0000D28_Write(Data, Para);
	Data += 7;
	Result += QCSG_AFN04_E0000D29_Write(Data, Para);
	Data += 9;
	return Result;	
}


ResultEnum QCSG_AFN04_E0000D30_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[3].PowerCtrlPeriodCnt = Data[0];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000D31_Write(u8* Data, LoadManagementParaStruct* Para)
{	
	Para->KwCtrl[3].Option[0].StartMinute   = Data[0];
	Para->KwCtrl[3].Option[0].StartHour     = Data[1];
	Para->KwCtrl[3].Option[0].EffectiveFlag = Data[2];
	Para->KwCtrl[3].Option[0].PowerLoad     = Data[6];
	Para->KwCtrl[3].Option[0].PowerLoad   <<= 8;
	Para->KwCtrl[3].Option[0].PowerLoad    += Data[5];
	Para->KwCtrl[3].Option[0].PowerLoad   <<= 8;
	Para->KwCtrl[3].Option[0].PowerLoad    += Data[4];
	Para->KwCtrl[3].Option[0].PowerLoad   <<= 8;
	Para->KwCtrl[3].Option[0].PowerLoad    += Data[3];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000D32_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[3].Option[1].StartMinute   = Data[0];
	Para->KwCtrl[3].Option[1].StartHour     = Data[1];
	Para->KwCtrl[3].Option[1].EffectiveFlag = Data[2];
	Para->KwCtrl[3].Option[1].PowerLoad     = Data[6];
	Para->KwCtrl[3].Option[1].PowerLoad   <<= 8;
	Para->KwCtrl[3].Option[1].PowerLoad    += Data[5];
	Para->KwCtrl[3].Option[1].PowerLoad   <<= 8;
	Para->KwCtrl[3].Option[1].PowerLoad    += Data[4];
	Para->KwCtrl[3].Option[1].PowerLoad   <<= 8;
	Para->KwCtrl[3].Option[1].PowerLoad    += Data[3];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000D33_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[3].Option[2].StartMinute   = Data[0];
	Para->KwCtrl[3].Option[2].StartHour     = Data[1];
	Para->KwCtrl[3].Option[2].EffectiveFlag = Data[2];
	Para->KwCtrl[3].Option[2].PowerLoad     = Data[6];
	Para->KwCtrl[3].Option[2].PowerLoad   <<= 8;
	Para->KwCtrl[3].Option[2].PowerLoad    += Data[5];
	Para->KwCtrl[3].Option[2].PowerLoad   <<= 8;
	Para->KwCtrl[3].Option[2].PowerLoad    += Data[4];
	Para->KwCtrl[3].Option[2].PowerLoad   <<= 8;
	Para->KwCtrl[3].Option[2].PowerLoad    += Data[3];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000D34_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[3].Option[3].StartMinute   = Data[0];
	Para->KwCtrl[3].Option[3].StartHour     = Data[1];
	Para->KwCtrl[3].Option[3].EffectiveFlag = Data[2];
	Para->KwCtrl[3].Option[3].PowerLoad     = Data[6];
	Para->KwCtrl[3].Option[3].PowerLoad   <<= 8;
	Para->KwCtrl[3].Option[3].PowerLoad    += Data[5];
	Para->KwCtrl[3].Option[3].PowerLoad   <<= 8;
	Para->KwCtrl[3].Option[3].PowerLoad    += Data[4];
	Para->KwCtrl[3].Option[3].PowerLoad   <<= 8;
	Para->KwCtrl[3].Option[3].PowerLoad    += Data[3];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000D35_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[3].Option[4].StartMinute   = Data[0];
	Para->KwCtrl[3].Option[4].StartHour     = Data[1];
	Para->KwCtrl[3].Option[4].EffectiveFlag = Data[2];
	Para->KwCtrl[3].Option[4].PowerLoad     = Data[6];
	Para->KwCtrl[3].Option[4].PowerLoad   <<= 8;
	Para->KwCtrl[3].Option[4].PowerLoad    += Data[5];
	Para->KwCtrl[3].Option[4].PowerLoad   <<= 8;
	Para->KwCtrl[3].Option[4].PowerLoad    += Data[4];
	Para->KwCtrl[3].Option[4].PowerLoad   <<= 8;
	Para->KwCtrl[3].Option[4].PowerLoad    += Data[3];

	return NO_ERROR;	
}


ResultEnum QCSG_AFN04_E0000D36_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[3].Option[5].StartMinute   = Data[0];
	Para->KwCtrl[3].Option[5].StartHour     = Data[1];
	Para->KwCtrl[3].Option[5].EffectiveFlag = Data[2];
	Para->KwCtrl[3].Option[5].PowerLoad     = Data[6];
	Para->KwCtrl[3].Option[5].PowerLoad   <<= 8;
	Para->KwCtrl[3].Option[5].PowerLoad    += Data[5];
	Para->KwCtrl[3].Option[5].PowerLoad   <<= 8;
	Para->KwCtrl[3].Option[5].PowerLoad    += Data[4];
	Para->KwCtrl[3].Option[5].PowerLoad   <<= 8;
	Para->KwCtrl[3].Option[5].PowerLoad    += Data[3];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000D37_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[3].Option[6].StartMinute   = Data[0];
	Para->KwCtrl[3].Option[6].StartHour     = Data[1];
	Para->KwCtrl[3].Option[6].EffectiveFlag = Data[2];
	Para->KwCtrl[3].Option[6].PowerLoad     = Data[6];
	Para->KwCtrl[3].Option[6].PowerLoad   <<= 8;
	Para->KwCtrl[3].Option[6].PowerLoad    += Data[5];
	Para->KwCtrl[3].Option[6].PowerLoad   <<= 8;
	Para->KwCtrl[3].Option[6].PowerLoad    += Data[4];
	Para->KwCtrl[3].Option[6].PowerLoad   <<= 8;
	Para->KwCtrl[3].Option[6].PowerLoad    += Data[3];

	return NO_ERROR;	
}


