gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/QCSG_AFN04.c
ResultEnum QCSG_AFN04_E0000D38_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[3].Option[7].StartMinute   = Data[0];
	Para->KwCtrl[3].Option[7].StartHour     = Data[1];
	Para->KwCtrl[3].Option[7].EffectiveFlag = Data[2];
	Para->KwCtrl[3].Option[7].PowerLoad     = Data[6];
	Para->KwCtrl[3].Option[7].PowerLoad   <<= 8;
	Para->KwCtrl[3].Option[7].PowerLoad    += Data[5];
	Para->KwCtrl[3].Option[7].PowerLoad   <<= 8;
	Para->KwCtrl[3].Option[7].PowerLoad    += Data[4];
	Para->KwCtrl[3].Option[7].PowerLoad   <<= 8;
	Para->KwCtrl[3].Option[7].PowerLoad    += Data[3];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000D39_Write(u8* Data, LoadManagementParaStruct* Para)
{
	Para->KwCtrl[3].StartDay   = Data[0];
	Para->KwCtrl[3].StartMonth = Data[1];
	Para->KwCtrl[3].EndDay     = Data[2];
	Para->KwCtrl[3].EndMonth   = Data[3];
	Para->KwCtrl[3].N0 = Data[4];
	Para->KwCtrl[3].N1 = Data[5];
	Para->KwCtrl[3].N2 = Data[6];
	Para->KwCtrl[3].N3 = Data[7];
	Para->KwCtrl[3].TI = Data[8];

	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0000D3F_Write(u8* Data, LoadManagementParaStruct* Para)
{
	ResultEnum Result = NO_ERROR;
	Result += QCSG_AFN04_E0000D30_Write(Data, Para);
	Data += 1;
	Result += QCSG_AFN04_E0000D31_Write(Data, Para);
	Data += 7;
	Result += QCSG_AFN04_E0000D32_Write(Data, Para);
	Data += 7;
	Result += QCSG_AFN04_E0000D33_Write(Data, Para);
	Data += 7;
	Result += QCSG_AFN04_E0000D34_Write(Data, Para);
	Data += 7;
	Result += QCSG_AFN04_E0000D35_Write(Data, Para);
	Data += 7;
	Result += QCSG_AFN04_E0000D36_Write(Data, Para);
	Data += 7;
	Result += QCSG_AFN04_E0000D37_Write(Data, Para);
	Data += 7;
	Result += QCSG_AFN04_E0000D38_Write(Data, Para);
	Data += 7;
	Result += QCSG_AFN04_E0000D39_Write(Data, Para);
	Data += 9;
	return Result;	
}



ResultEnum QCSG_AFN04_E0001100_E0002000(QCSGFrameStruct* SrcFrame, QCSGFrameStruct* DstFrame, QCSGFrameProcessStruct* QCSGFp)
{
	MeterPointCtrlParaStruct PointCtrlPara;
	ResultEnum Result = NO_ERROR;
	u8* pData = &SrcFrame->Data[QCSGFp->SrcDataPos];
	u32 WriteLen = 0;
	
	MC(0, (u32)&PointCtrlPara, sizeof(MeterPointCtrlParaStruct));
	MR((u32)&PointCtrlPara, PARA_MeterPointControl, sizeof(MeterPointCtrlParaStruct));
	
	switch(QCSGFp->CurDataID)
	{
		case 0xE0001100:
			QCSGFp->SrcDataPos += 15;
			WriteLen = 15;
			if(BCD_Check(pData, 15) == NO_ERROR) //err20180404-11 BCD检查
				Result = QCSG_AFN04_E0001100_Write(pData, &PointCtrlPara, QCSGFp, SrcFrame);
			else 
				Result = ERROR_InvalidData;//err20180404-11 BCD检查
			break;
		case 0xE0001101:
			QCSGFp->SrcDataPos += 16;
			WriteLen = 16;
			if(BCD_Check(pData, 16) == NO_ERROR) 	//err20180404-11 BCD检查
				Result = QCSG_AFN04_E0001101_Write(pData, &PointCtrlPara, QCSGFp, SrcFrame);
			else 
				Result = ERROR_InvalidData;//err20180404-11 BCD检查
			break;
		case 0xE0001102:
			QCSGFp->SrcDataPos += 15;
			WriteLen = 15;
			if(BCD_Check(pData, 15) == NO_ERROR) 	//err20180404-11 BCD检查
				Result = QCSG_AFN04_E0001102_Write(pData, &PointCtrlPara, QCSGFp, SrcFrame);
			else 
				Result = ERROR_InvalidData;//err20180404-11 BCD检查
			break;
		case 0xE0001103:
			QCSGFp->SrcDataPos += 15;
			WriteLen = 15;
			if(BCD_Check(pData, 15) == NO_ERROR) 	//err20180404-11 BCD检查
				Result = QCSG_AFN04_E0001103_Write(pData, &PointCtrlPara, QCSGFp, SrcFrame);
			else 
				Result = ERROR_InvalidData;//err20180404-11 BCD检查
			break;
		case 0xE0001104:
			QCSGFp->SrcDataPos += 8;
			if(QCSGFp->TempPn == 0)
			{
				Result = QCSG_AFN04_E0001104_Write(pData, &PointCtrlPara);
			}
			else
			{
				Result = ERROR_VerifyFail;
			}
			break;
		case 0xE0002000:
		default:
			QCSGFp->SrcDataPos = QCSGFp->UserDataLen;
			Result = ERROR_NoSuchDataID;
			break;			
	}

	if((Result == NO_ERROR) && (WriteLen != 0))
	{
		MW((u32)&PointCtrlPara, PARA_MeterPointControl, sizeof(MeterPointCtrlParaStruct));
	}
	return Result;
}


//遥控拉闸
ResultEnum QCSG_AFN04_E0001100_Write(u8* Data, MeterPointCtrlParaStruct* Para, QCSGFrameProcessStruct* QCSGFp, QCSGFrameStruct* SrcFrame)
{
	MeasurePointStruct Mp;
	u8* PnListData;
	RealTimeStruct RealTime;
	DLT645FrameStruct Frame;

	#if ((Project/100)==3)
		QCSG_RTREADMETER_REQ_INFO_S* RT_AMRReq;
	#endif

	#if (((Project/100)==2) || ((Project/100)==5)||((Project/100)==9))//err20180531 增加II型集中器
		UartRxChCtrlStruct* UartRxChCtrl;
		RT_AMRCtrlStruct* RT_AMRTask = (RT_AMRCtrlStruct*)ADDR_RealTimeAMRTaskCtrl;
	#endif
	
	u32 Temp = 0;
	u32 i = 0;
	u32 ControlType = METER_CONTROL_SWITCH_OFF;//拉闸
	
	Para->E0001100.Addr[0] = Data[0];
	Para->E0001100.Addr[1] = Data[1];
	Para->E0001100.Addr[2] = Data[2];
	Para->E0001100.Addr[3] = Data[3];
	Para->E0001100.Addr[4] = Data[4];
	Para->E0001100.Addr[5] = Data[5];
	Para->E0001100.PassWord[0]  = Data[6];
	Para->E0001100.PassWord[1]  = Data[7];
	Para->E0001100.PassWord[2]  = Data[8];
	Para->E0001100.PassWord[3]  = Data[9];
	Para->E0001100.UserCode[0]  = Data[10];
	Para->E0001100.UserCode[1]  = Data[11];
	Para->E0001100.UserCode[2]  = Data[12];
	Para->E0001100.UserCode[3]  = Data[13];
	Para->E0001100.EffectiveTime = Data[14];

	NAND_ReadMeasurePointByPn(QCSGFp->TempPn, &Mp);
	GenerateMpControlEvent(ControlType, &Mp, QCSGFp->TempPn, Para->E0001100.EffectiveTime);
	
	if(MemCompare(Mp.Addr, Para->E0001100.Addr, METER_ADDR_SIZE) != 0) return ERROR_InvalidData;
	if(Mp.SwitchOff != 0x01)  return ERROR_InvalidData;

	PnListData = (u8*)Get_ADDR_UARTnFnDataBuff(QCSGFp->PORTn);
	PnListData[i++] = QCSGFp->TempPn;
	PnListData[i++] = QCSGFp->TempPn >> 8;
	PnListData[i++] = 0x00;
	PnListData[i++] = 0x00;
	PnListData[i++] = QCSGFp->CurDataID;
	PnListData[i++] = QCSGFp->CurDataID >> 8;
	PnListData[i++] = QCSGFp->CurDataID >> 16;
	PnListData[i++] = QCSGFp->CurDataID >> 24;

	
	//MC(0, (u32)&Frame, sizeof(DLT645FrameStruct));
	MR((u32)Frame.Addr, (u32)Para->E0001100.Addr, METER_ADDR_SIZE);
	Frame.CtrlCode = 0x1C;
	Frame.DataLen = 0;
	
	MR((u32)&Frame.Data[Frame.DataLen], (u32)Para->E0001100.PassWord, 4);
	Frame.DataLen += 4;
	MR((u32)&Frame.Data[Frame.DataLen], (u32)Para->E0001100.UserCode, 4);
	Frame.DataLen += 4;
	Frame.Data[Frame.DataLen++] = 0x1A;
	Frame.Data[Frame.DataLen++] = 0x00;

	HAL_GetSystemTime(&RealTime);
	for(Temp = 0 ;Temp < Para->E0001100.EffectiveTime ; Temp++)//err20180404-12 当前时间增加控制有效时间为有效截止时间
	{
		QCSG_IncOneMinute(&RealTime);
	}
	MR((u32)&Frame.Data[Frame.DataLen], (u32)&RealTime, 6);
	Frame.DataLen += 6;

	i += Build645Frame(&Frame, &PnListData[i], NO_FE_IN_645);

