gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/QCSG_AFN04.c
	i -= 8;
	PnListData[2] = i;
	PnListData[3] = i >> 8;

	#if ((Project/100)==3)		// 负荷管理终端
		RT_AMRReq = (QCSG_RTREADMETER_REQ_INFO_S*)GetRealTimeAMRReqAddr(QCSGFp->PORTn);
		if((RT_AMRReq != NULL) && (RT_AMRReq->Lock == 0)) 
		{
			RT_AMRReq->SrcTask = GetUartTaskID(QCSGFp->PORTn);
			RT_AMRReq->FrameType = FRAME_TYPE_DLT_645;
			RT_AMRReq->DataType  = DATA_TYPE_FRAME;
			RT_AMRReq->QCSGFrameInfo.A1 = SrcFrame->A1;
			RT_AMRReq->QCSGFrameInfo.A2 = SrcFrame->A2;
			RT_AMRReq->QCSGFrameInfo.A3 = SrcFrame->A3;
			RT_AMRReq->QCSGFrameInfo.FC = SrcFrame->FC;
			RT_AMRReq->QCSGFrameInfo.AFN = SrcFrame->AFN;
			RT_AMRReq->QCSGFrameInfo.SEQ = SrcFrame->SEQ;
			RT_AMRReq->QCSGFrameInfo.Port = QCSGFp->PORTn;
			RT_AMRReq->PnListNum = 1;
			RT_AMRReq->PnListLen = i + 8;
			MR((u32)RT_AMRReq->Data, (u32)PnListData, RT_AMRReq->PnListLen);
			RT_AMRReq->Lock = 0x01;
			//SetRealTimeAMRTaskReq(GetUartTaskID(PORTn), PORTn, RT_AMRReq);
		}
	#endif

	#if (((Project/100)==2) || ((Project/100)==5)||((Project/100)==9))//I型集中器 //err20180531 增加II型集中器
		UartRxChCtrl = (UartRxChCtrlStruct*)GetUartPortRxChCtrl(QCSGFp->PORTn);
		if((UartRxChCtrl != NULL) && (RT_AMRTask->Lock == 0)) 
		{
			UartRxChCtrl->SrcPort = QCSGFp->PORTn;
			UartRxChCtrl->Empty = BUFFER_FULL;
			UartRxChCtrl->FrameType = FRAME_TYPE_DLT_645;
			UartRxChCtrl->DataType = DATA_TYPE_FRAME;
			UartRxChCtrl->QCSGFrameInfo.A1 = SrcFrame->A1;
			UartRxChCtrl->QCSGFrameInfo.A2 = SrcFrame->A2;
			UartRxChCtrl->QCSGFrameInfo.A3 = SrcFrame->A3;
			UartRxChCtrl->QCSGFrameInfo.FC = SrcFrame->FC;
			UartRxChCtrl->QCSGFrameInfo.AFN = SrcFrame->AFN;
			UartRxChCtrl->QCSGFrameInfo.SEQ = SrcFrame->SEQ;
			UartRxChCtrl->QCSGFrameInfo.Port = QCSGFp->PORTn;
			UartRxChCtrl->PnListNum  = 1;
			UartRxChCtrl->FrameLen = i + 8;
			UartRxChCtrl->FrameBuf = PnListData;
			switch(QCSGFp->PORTn)
			{
				case RS485_1PORT:
					RT_AMRTask->Flag |= RT_AMR_RS485_CH1_REQ;
					break;
				case RS485_2PORT:
					RT_AMRTask->Flag |= RT_AMR_RS485_CH2_REQ;
					break;
				case RS485_3PORT:
					RT_AMRTask->Flag |= RT_AMR_RS485_CH3_REQ;
					break;
				case RS232PORT:
					RT_AMRTask->Flag |= RT_AMR_RS232_PORT_REQ;
					break;
				case GPRSPORT:
					RT_AMRTask->Flag |= RT_AMR_GPRS_PORT_REQ;
					break;
				case IRPORT:
					RT_AMRTask->Flag |= RT_AMR_IR_PORT_REQ;
					break;
				case ENETPORT:
					RT_AMRTask->Flag |= RT_AMR_ETHE_PORT_REQ;
					break;
				default:
					UartRxChCtrl->Empty = 0;
					UartRxChCtrl->PnListNum  = 0;
					UartRxChCtrl->FrameLen = 0;
					UartRxChCtrl->FrameBuf = NULL;
					break;
			}
		}
	#endif
	
	return NO_ERROR;
}

//遥控合闸
ResultEnum QCSG_AFN04_E0001101_Write(u8* Data, MeterPointCtrlParaStruct* Para, QCSGFrameProcessStruct* QCSGFp, QCSGFrameStruct* SrcFrame)
{
	MeasurePointStruct Mp;
	u8* PnListData;
	RealTimeStruct RealTime;
	DLT645FrameStruct Frame;

	#if ((Project/100)==3)
		QCSG_RTREADMETER_REQ_INFO_S* RT_AMRReq;
	#endif

	#if (((Project/100)==2) || ((Project/100)==5)||((Project/100)==9))//err20180531 增加II型集中器
		UartRxChCtrlStruct* UartRxChCtrl;
		RT_AMRCtrlStruct* RT_AMRTask = (RT_AMRCtrlStruct*)ADDR_RealTimeAMRTaskCtrl;
	#endif
	
	u32 Temp = 0;
	u32 i = 0;
	u32 ControlType = METER_CONTROL_SWITCH_ON;//合闸
	
	Para->E0001101.Addr[0] = Data[0];
	Para->E0001101.Addr[1] = Data[1];
	Para->E0001101.Addr[2] = Data[2];
	Para->E0001101.Addr[3] = Data[3];
	Para->E0001101.Addr[4] = Data[4];
	Para->E0001101.Addr[5] = Data[5];
	Para->E0001101.PassWord[0]  = Data[6];
	Para->E0001101.PassWord[1]  = Data[7];
	Para->E0001101.PassWord[2]  = Data[8];
	Para->E0001101.PassWord[3]  = Data[9];
	Para->E0001101.UserCode[0]  = Data[10];
	Para->E0001101.UserCode[1]  = Data[11];
	Para->E0001101.UserCode[2]  = Data[12];
	Para->E0001101.UserCode[3]  = Data[13];
	Para->E0001101.EffectiveTime = Data[14];
	Para->E0001101.SwitchType = Data[15];
	
	NAND_ReadMeasurePointByPn(QCSGFp->TempPn, &Mp);
	GenerateMpControlEvent(ControlType, &Mp, QCSGFp->TempPn, Para->E0001101.EffectiveTime);
	
	if(MemCompare(Mp.Addr, Para->E0001101.Addr, METER_ADDR_SIZE) != 0) return ERROR_InvalidData;
	if(Mp.SwitchOff != 0x01) return ERROR_InvalidData;

	PnListData = (u8*)Get_ADDR_UARTnFnDataBuff(QCSGFp->PORTn);
	PnListData[i++] = QCSGFp->TempPn;
	PnListData[i++] = QCSGFp->TempPn >> 8;
	PnListData[i++] = 0x00;
	PnListData[i++] = 0x00;
	PnListData[i++] = QCSGFp->CurDataID;
	PnListData[i++] = QCSGFp->CurDataID >> 8;
	PnListData[i++] = QCSGFp->CurDataID >> 16;
	PnListData[i++] = QCSGFp->CurDataID >> 24;

	HAL_GetSystemTime(&RealTime);
	//MC(0, (u32)&Frame, sizeof(DLT645FrameStruct));
	MR((u32)Frame.Addr, (u32)Para->E0001101.Addr, METER_ADDR_SIZE);//err20180404-13
	Frame.CtrlCode = 0x1C;
	Frame.DataLen = 0;
	
	MR((u32)&Frame.Data[Frame.DataLen], (u32)Para->E0001101.PassWord, 4);//err20180404-13
	Frame.DataLen += 4;
	MR((u32)&Frame.Data[Frame.DataLen], (u32)Para->E0001101.UserCode, 4);//err20180404-13
	Frame.DataLen += 4;
#if (TEST_ON == 1) 
	Frame.Data[Frame.DataLen++] = 0x1C; //台体测试按三星发 直接合闸?
#else	
	Frame.Data[Frame.DataLen++] = 0x1B;
#endif
	Frame.Data[Frame.DataLen++] = 0x00;
	MR((u32)&Frame.Data[Frame.DataLen], (u32)&RealTime, 6);
	Frame.DataLen += 6;
	
	HAL_GetSystemTime(&RealTime);
	for(Temp = 0 ;Temp < Para->E0001101.EffectiveTime ; Temp++)//err20180404-12 当前时间增加控制有效时间为有效截止时间
	{
		QCSG_IncOneMinute(&RealTime);
	}


	i += Build645Frame(&Frame, &PnListData[i], NO_FE_IN_645);

	i -= 8;
	PnListData[2] = i;
	PnListData[3] = i >> 8;

	#if ((Project/100)==3)		// 负荷管理终端
		RT_AMRReq = (QCSG_RTREADMETER_REQ_INFO_S*)GetRealTimeAMRReqAddr(QCSGFp->PORTn);
		if((RT_AMRReq != NULL) && (RT_AMRReq->Lock == 0)) 
		{
			RT_AMRReq->SrcTask = GetUartTaskID(QCSGFp->PORTn);
			RT_AMRReq->FrameType = FRAME_TYPE_DLT_645;
			RT_AMRReq->DataType  = DATA_TYPE_FRAME;
			RT_AMRReq->QCSGFrameInfo.A1 = SrcFrame->A1;
			RT_AMRReq->QCSGFrameInfo.A2 = SrcFrame->A2;
			RT_AMRReq->QCSGFrameInfo.A3 = SrcFrame->A3;
			RT_AMRReq->QCSGFrameInfo.FC = SrcFrame->FC;
			RT_AMRReq->QCSGFrameInfo.AFN = SrcFrame->AFN;
			RT_AMRReq->QCSGFrameInfo.SEQ = SrcFrame->SEQ;
			RT_AMRReq->QCSGFrameInfo.Port = QCSGFp->PORTn;
			RT_AMRReq->PnListNum = 1;
			RT_AMRReq->PnListLen = i + 8;
			MR((u32)RT_AMRReq->Data, (u32)PnListData, RT_AMRReq->PnListLen);
			RT_AMRReq->Lock = 0x01;
			//SetRealTimeAMRTaskReq(GetUartTaskID(PORTn), PORTn, RT_AMRReq);
		}
	#endif

	#if (((Project/100)==2) || ((Project/100)==5)||((Project/100)==9))// I 型集中器  //err20180531 增加II型集中器	
		UartRxChCtrl = (UartRxChCtrlStruct*)GetUartPortRxChCtrl(QCSGFp->PORTn);
		if((UartRxChCtrl != NULL) && (RT_AMRTask->Lock == 0)) 
		{
			UartRxChCtrl->SrcPort = QCSGFp->PORTn;
			UartRxChCtrl->Empty = BUFFER_FULL;
			UartRxChCtrl->FrameType = FRAME_TYPE_DLT_645;
			UartRxChCtrl->DataType = DATA_TYPE_FRAME;
			UartRxChCtrl->QCSGFrameInfo.A1 = SrcFrame->A1;
			UartRxChCtrl->QCSGFrameInfo.A2 = SrcFrame->A2;
			UartRxChCtrl->QCSGFrameInfo.A3 = SrcFrame->A3;
			UartRxChCtrl->QCSGFrameInfo.FC = SrcFrame->FC;
			UartRxChCtrl->QCSGFrameInfo.AFN = SrcFrame->AFN;
			UartRxChCtrl->QCSGFrameInfo.SEQ = SrcFrame->SEQ;
			UartRxChCtrl->QCSGFrameInfo.Port = QCSGFp->PORTn;
			UartRxChCtrl->PnListNum  = 1;
			UartRxChCtrl->FrameLen = i + 8;
			UartRxChCtrl->FrameBuf = PnListData;
			switch(QCSGFp->PORTn)
			{
				case RS485_1PORT:
					RT_AMRTask->Flag |= RT_AMR_RS485_CH1_REQ;
					break;
				case RS485_2PORT:
					RT_AMRTask->Flag |= RT_AMR_RS485_CH2_REQ;
					break;
				case RS485_3PORT:
					RT_AMRTask->Flag |= RT_AMR_RS485_CH3_REQ;
					break;
				case RS232PORT:
					RT_AMRTask->Flag |= RT_AMR_RS232_PORT_REQ;
					break;
				case GPRSPORT:
					RT_AMRTask->Flag |= RT_AMR_GPRS_PORT_REQ;
					break;
				case IRPORT:
					RT_AMRTask->Flag |= RT_AMR_IR_PORT_REQ;
					break;
				case ENETPORT:
					RT_AMRTask->Flag |= RT_AMR_ETHE_PORT_REQ;
					break;
				default:
					UartRxChCtrl->Empty = 0;
					UartRxChCtrl->PnListNum  = 0;
					UartRxChCtrl->FrameLen = 0;
					UartRxChCtrl->FrameBuf = NULL;
					break;
			}
		}
	#endif
	
	return NO_ERROR;
}

//对电能表保电操作
ResultEnum QCSG_AFN04_E0001102_Write(u8* Data, MeterPointCtrlParaStruct* Para, QCSGFrameProcessStruct* QCSGFp, QCSGFrameStruct* SrcFrame)
{
	MeasurePointStruct Mp;
	u8* PnListData;
	RealTimeStruct RealTime;
	DLT645FrameStruct Frame;

	#if ((Project/100)==3)
		QCSG_RTREADMETER_REQ_INFO_S* RT_AMRReq;
	#endif

	#if (((Project/100)==2) || ((Project/100)==5)||((Project/100)==9))//err20180531 增加II型集中器
		UartRxChCtrlStruct* UartRxChCtrl;
		RT_AMRCtrlStruct* RT_AMRTask = (RT_AMRCtrlStruct*)ADDR_RealTimeAMRTaskCtrl;
	#endif
	u32 i = 0;
	u32 ControlType = METER_CONTROL_POWER_HOLD;
	
	Para->E0001102.Addr[0] = Data[0];
	Para->E0001102.Addr[1] = Data[1];
	Para->E0001102.Addr[2] = Data[2];
	Para->E0001102.Addr[3] = Data[3];
	Para->E0001102.Addr[4] = Data[4];
	Para->E0001102.Addr[5] = Data[5];
	Para->E0001102.PassWord[0]  = Data[6];
	Para->E0001102.PassWord[1]  = Data[7];
	Para->E0001102.PassWord[2]  = Data[8];
	Para->E0001102.PassWord[3]  = Data[9];
	Para->E0001102.UserCode[0]  = Data[10];
	Para->E0001102.UserCode[1]  = Data[11];
	Para->E0001102.UserCode[2]  = Data[12];
	Para->E0001102.UserCode[3]  = Data[13];
	Para->E0001102.EffectiveTime = Data[14];
	
	NAND_ReadMeasurePointByPn(QCSGFp->TempPn, &Mp);
	GenerateMpControlEvent(ControlType, &Mp, QCSGFp->TempPn, Para->E0001102.EffectiveTime);
	
