gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/QCSG_AFN04.c
	i -= 8;
	PnListData[2] = i;
	PnListData[3] = i >> 8;

	#if ((Project/100)==3)		// 负荷管理终端
		RT_AMRReq = (QCSG_RTREADMETER_REQ_INFO_S*)GetRealTimeAMRReqAddr(QCSGFp->PORTn);
		if((RT_AMRReq != NULL) && (RT_AMRReq->Lock == 0)) 
		{
			RT_AMRReq->SrcTask = GetUartTaskID(QCSGFp->PORTn);
			RT_AMRReq->FrameType = FRAME_TYPE_DLT_645;
			RT_AMRReq->DataType  = DATA_TYPE_FRAME;
			RT_AMRReq->QCSGFrameInfo.A1 = SrcFrame->A1;
			RT_AMRReq->QCSGFrameInfo.A2 = SrcFrame->A2;
			RT_AMRReq->QCSGFrameInfo.A3 = SrcFrame->A3;
			RT_AMRReq->QCSGFrameInfo.FC = SrcFrame->FC;
			RT_AMRReq->QCSGFrameInfo.AFN = SrcFrame->AFN;
			RT_AMRReq->QCSGFrameInfo.SEQ = SrcFrame->SEQ;
			RT_AMRReq->QCSGFrameInfo.Port = QCSGFp->PORTn;
			RT_AMRReq->PnListNum = 1;
			RT_AMRReq->PnListLen = i + 8;
			MR((u32)RT_AMRReq->Data, (u32)PnListData, RT_AMRReq->PnListLen);
			RT_AMRReq->Lock = 0x01;
			//SetRealTimeAMRTaskReq(GetUartTaskID(PORTn), PORTn, RT_AMRReq);
		}
	#endif

	#if (((Project/100)==2) || ((Project/100)==5)||((Project/100)==9))	// I 型集中器   //err20180531 增加II型集中器
		UartRxChCtrl = (UartRxChCtrlStruct*)GetUartPortRxChCtrl(QCSGFp->PORTn);
		if((UartRxChCtrl != NULL) && (RT_AMRTask->Lock == 0)) 
		{
			UartRxChCtrl->SrcPort = QCSGFp->PORTn;
			UartRxChCtrl->Empty = BUFFER_FULL;
			UartRxChCtrl->FrameType = FRAME_TYPE_DLT_645;
			UartRxChCtrl->DataType = DATA_TYPE_FRAME;
			UartRxChCtrl->QCSGFrameInfo.A1 = SrcFrame->A1;
			UartRxChCtrl->QCSGFrameInfo.A2 = SrcFrame->A2;
			UartRxChCtrl->QCSGFrameInfo.A3 = SrcFrame->A3;
			UartRxChCtrl->QCSGFrameInfo.FC = SrcFrame->FC;
			UartRxChCtrl->QCSGFrameInfo.AFN = SrcFrame->AFN;
			UartRxChCtrl->QCSGFrameInfo.SEQ = SrcFrame->SEQ;
			UartRxChCtrl->QCSGFrameInfo.Port = QCSGFp->PORTn;
			UartRxChCtrl->PnListNum  = 1;
			UartRxChCtrl->FrameLen = i + 8;
			UartRxChCtrl->FrameBuf = PnListData;
			switch(QCSGFp->PORTn)
			{
				case RS485_1PORT:
					RT_AMRTask->Flag |= RT_AMR_RS485_CH1_REQ;
					break;
				case RS485_2PORT:
					RT_AMRTask->Flag |= RT_AMR_RS485_CH2_REQ;
					break;
				case RS485_3PORT:
					RT_AMRTask->Flag |= RT_AMR_RS485_CH3_REQ;
					break;
				case RS232PORT:
					RT_AMRTask->Flag |= RT_AMR_RS232_PORT_REQ;
					break;
				case GPRSPORT:
					RT_AMRTask->Flag |= RT_AMR_GPRS_PORT_REQ;
					break;
				case IRPORT:
					RT_AMRTask->Flag |= RT_AMR_IR_PORT_REQ;
					break;
				case ENETPORT:
					RT_AMRTask->Flag |= RT_AMR_ETHE_PORT_REQ;
					break;
				default:
					UartRxChCtrl->Empty = 0;
					UartRxChCtrl->PnListNum  = 0;
					UartRxChCtrl->FrameLen = 0;
					UartRxChCtrl->FrameBuf = NULL;
					break;
			}
		}
	#endif
	
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0001104_Write(u8* Data, MeterPointCtrlParaStruct* Para)
{
	ResultEnum Result = NO_ERROR;
	u32 PnNum = 0, DataLen= 0;
	MeasurePointStruct MeasurePoint;
	MR((u32)Para->E0001104, (u32)Data, 8);
	PnNum = Para->E0001104[0];
	PnNum += Para->E0001104[1] << 8;

	if(BCD_Check(Data, 8) != NO_ERROR) return ERROR_InvalidData;
	PnNum = bcd_hex(PnNum);
	if(PnNum >= MAX_PN_NUM) return ERROR_InvalidData;
	//MC(0, (u32)&MeasurePoint, sizeof(MeasurePointStruct));
	Result = NAND_ReadMeasurePointByPnNum(PnNum, &MeasurePoint);
	if(Result != NO_ERROR) return Result;

	if(MemCompare(&Para->E0001104[2], MeasurePoint.Addr, METER_ADDR_SIZE) != 0)
	{
		return ERROR_DestAddrNotExist;
	}

	MC(0xFF, (u32)&MeasurePoint, sizeof(MeasurePointStruct));
	DataLen = sizeof(MeasurePointStruct);
	PnNum = SwitchNumToPn(PnNum);
	Result = NAND_WriteMeasurePoint(PnNum, 0xE0800000, (u8*)&MeasurePoint, &DataLen);
	
	return Result;	
}

ResultEnum QCSG_AFN04_E0003000_E0003001(QCSGFrameStruct* SrcFrame, QCSGFrameStruct* DstFrame, QCSGFrameProcessStruct* QCSGFp)
{
	//err20190403 自动搜表参数 待填充
	return NO_ERROR;
}

//定时自动搜表参数
ResultEnum QCSG_AFN04_E0003000_Write(u8* Data, MeasurePointStruct* Para)
{
	//err20190403 自动搜表参数 待填充
	return NO_ERROR;
}

//手动启动搜表
ResultEnum QCSG_AFN04_E0003001_Write(u8* Data, MeasurePointStruct* Para)
{
	//err20190403 自动搜表参数 待填充
	return NO_ERROR;
}


ResultEnum QCSG_AFN04_E0800000_E080002F(QCSGFrameStruct* SrcFrame, QCSGFrameStruct* DstFrame, QCSGFrameProcessStruct* QCSGFp)
{
	ResultEnum Result = NO_ERROR;
	u8* pData = &SrcFrame->Data[QCSGFp->SrcDataPos];
	u32 WriteLen = sizeof(MeasurePointStruct);
	MeasurePointStruct MeasurePoint;
	MemSet((u8*)&MeasurePoint, 0, sizeof(MeasurePointStruct));
	NAND_ReadMeasurePoint(QCSGFp->TempPn, QCSGFp->CurDataID, (u8*)&MeasurePoint, &WriteLen);
	switch(QCSGFp->CurDataID)
	{
		case 0xE0800000:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E0800000_Write(pData, &MeasurePoint);
			break;
		case 0xE0800001:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E0800001_Write(pData, &MeasurePoint);			
			break;
		case 0xE0800002:
			QCSGFp->SrcDataPos += 6;
			Result = QCSG_AFN04_E0800002_Write(QCSGFp, pData, &MeasurePoint);
			break;
		case 0xE0800003:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E0800003_Write(pData, &MeasurePoint);
			break;
		case 0xE0800004:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E0800004_Write(pData, &MeasurePoint);
			break;
		case 0xE0800005:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E0800005_Write(pData, &MeasurePoint);
			break;
		case 0xE0800006:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E0800006_Write(pData, &MeasurePoint);
			break;
		case 0xE0800007:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E0800007_Write(pData, &MeasurePoint);			
			break;
		case 0xE0800008:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E0800008_Write(pData, &MeasurePoint);
			break;
		case 0xE0800009:
			QCSGFp->SrcDataPos += 6;
			Result = QCSG_AFN04_E0800009_Write(pData, &MeasurePoint);
			break;
		case 0xE080000A:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E080000A_Write(pData, &MeasurePoint);
			break;
		case 0xE080000B:
			QCSGFp->SrcDataPos += 4;
			Result = QCSG_AFN04_E080000B_Write(pData, &MeasurePoint);
			break;
		case 0xE080000C:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E080000C_Write(pData, &MeasurePoint);
			break;
		case 0xE080000D:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E080000D_Write(pData, &MeasurePoint);
			break;
		case 0xE080000F:
			QCSGFp->SrcDataPos += 29;
			Result = QCSG_AFN04_E080000F_Write(QCSGFp, pData, &MeasurePoint);
			break;
		case 0xE0800010:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E0800010_Write(pData, &MeasurePoint);
			break;
		case 0xE0800011:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E0800011_Write(pData, &MeasurePoint);
			break;
		case 0xE0800012:
			QCSGFp->SrcDataPos += 3;
			Result = QCSG_AFN04_E0800012_Write(pData, &MeasurePoint);
			break;
		case 0xE0800013:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E0800013_Write(pData, &MeasurePoint);
			break;
		case 0xE0800014:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E0800014_Write(pData, &MeasurePoint);
			break;
		case 0xE080001F:
			QCSGFp->SrcDataPos += 10;
			Result = QCSG_AFN04_E080001F_Write(pData, &MeasurePoint);
			break;
		case 0xE0800021:
			QCSGFp->SrcDataPos += 8;
			Result = QCSG_AFN04_E0800021_Write(pData, &MeasurePoint);
			break;
		case 0xE0800022:
			QCSGFp->SrcDataPos += 8;
			Result = QCSG_AFN04_E0800022_Write(pData, &MeasurePoint);
			break;
		case 0xE080002F:
			QCSGFp->SrcDataPos += 16;
			Result = QCSG_AFN04_E080002F_Write(pData, &MeasurePoint);
			break;
		default:
			QCSGFp->SrcDataPos = QCSGFp->UserDataLen;
			Result = ERROR_NoSuchDataID;
			break;			
	}

	if((Result == NO_ERROR) && (WriteLen != 0))
	{
		if(MeasurePoint.PortBaudRate == 0xFF) MeasurePoint.PortBaudRate = BAUD_RATE_1200/300;
		if(MeasurePoint.PortParity == 0xFF) MeasurePoint.PortParity = 0x01;
		if(MeasurePoint.PortDataBit == 0xFF) MeasurePoint.PortDataBit = 0x08;
		if(MeasurePoint.PortStopBit == 0xFF) MeasurePoint.PortStopBit = 0x00;
		
