gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/QCSG_AFN04.c
		Result = NAND_WriteMeasurePoint(QCSGFp->TempPn, QCSGFp->CurDataID, (u8*)&MeasurePoint, &WriteLen);
	}
	return Result;
}


ResultEnum QCSG_AFN04_E0800000_Write(u8* Data, MeasurePointStruct* Para)
{
	if(Data[0] > 0x01) return ERROR_InvalidData;
	Para->State = Data[0];
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0800001_Write(u8* Data, MeasurePointStruct* Para)
{
	if((Data[0] == 0) || (Data[0] > 0x05)) return ERROR_InvalidData;
	Para->MeasureType = Data[0];
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0800002_Write(QCSGFrameProcessStruct* QCSGFp, u8* Data, MeasurePointStruct* Para)
{
	if(MeterAddrCheck(Data) != NO_ERROR) return ERROR_InvalidData;

	if(QCSG_CheckPnAddrIsDuplicate(QCSGFp->TempPn, Data) != NO_ERROR) return ERROR_InvalidData;
			
	Para->Addr[0] = Data[0];
	Para->Addr[1] = Data[1];
	Para->Addr[2] = Data[2];
	Para->Addr[3] = Data[3];
	Para->Addr[4] = Data[4];
	Para->Addr[5] = Data[5];
	
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0800003_Write(u8* Data, MeasurePointStruct* Para)
{
	if(Data[0] > 0x0B) return ERROR_InvalidData;
	Para->ProtocolType = Data[0];
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0800004_Write(u8* Data, MeasurePointStruct* Para)
{
	if((Data[0] == 0) || (Data[0] > 0x03)) return ERROR_InvalidData;
	Para->PointMeterType = Data[0];
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0800005_Write(u8* Data, MeasurePointStruct* Para)
{
	if(Data[0] > 0x01) return ERROR_InvalidData;
	Para->TotalType = Data[0];
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0800006_Write(u8* Data, MeasurePointStruct* Para)
{
	if(Data[0] > 0x01) return ERROR_InvalidData;
	Para->PriorityType = Data[0];
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0800007_Write(u8* Data, MeasurePointStruct* Para)
{
	if(Data[0] > 0x01) return ERROR_InvalidData;
	Para->SwitchOff = Data[0];
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0800008_Write(u8* Data, MeasurePointStruct* Para)
{
	Para->MaxRateNum = Data[0];
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0800009_Write(u8* Data, MeasurePointStruct* Para)
{
	if(MeterAddrCheck(Data) != NO_ERROR)
	{
		if(MemCompare(Data, EmptyAddr, METER_ADDR_SIZE) != 0) return ERROR_InvalidData;
	}
	Para->CollectorAddr[0] = Data[0];
	Para->CollectorAddr[1] = Data[1];
	Para->CollectorAddr[2] = Data[2];
	Para->CollectorAddr[3] = Data[3];
	Para->CollectorAddr[4] = Data[4];
	Para->CollectorAddr[5] = Data[5];
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E080000A_Write(u8* Data, MeasurePointStruct* Para)
{
	if(((Data[0] > 0x20) && (Data[0] < 0x30)) || (Data[0] > 0x30)) return ERROR_InvalidData;
	Para->PortID = Data[0];
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E080000B_Write(u8* Data, MeasurePointStruct* Para)
{

//err20180730 台体 微功率无线模块实时召测项测试时切换波特率，下发一个GUI实时召测帧适应波特率。
#if(TEST_ON == 1)
	QCSG_LCD_RAMDATA_S* Pn_Lcd_Data = (QCSG_LCD_RAMDATA_S*)ADDR_LCD_MeterAMRDataBuf;
	Terminal_Ram_TypeDef* pTerminalRam = Terminal_Ram;
#endif

	if(Data[1] > 0x02) return ERROR_InvalidData;
	if((Data[2] < 0x05) || (Data[2] > 0x08)) return ERROR_InvalidData;
	if(Data[3] > 0x02) return ERROR_InvalidData;
	
	//err20180730 台体 微功率无线模块实时召测项测试时切换波特率，下发一个GUI实时召测帧适应波特率。
#if(TEST_ON == 1)
	
	if(Para->PortBaudRate != Data[0])
	{
		if((Para->State == 0x01) && (BCD_Check(Para->Addr, METER_ADDR_SIZE) == NO_ERROR) && ((Para->PortID == 0x20) || (Para->PortID == 0x1F)))
		{
			MC(0,(u32)Pn_Lcd_Data,sizeof(QCSG_LCD_RAMDATA_S));
			Pn_Lcd_Data->u16Pn = 9;
			Pn_Lcd_Data->u16Res1 |= LCD_RT_AMR_REQ_TEST_START;	
			pTerminalRam->LCD_RT_AMR_REQ_TEST_START_TIME = pTerminalRam->Seconds; 
		}
	}

	
#endif
	Para->PortBaudRate = Data[0];
	Para->PortParity   = Data[1];
	Para->PortDataBit  = Data[2];
	Para->PortStopBit  = Data[3];
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E080000C_Write(u8* Data, MeasurePointStruct* Para)
{
	Para->CT = Data[1];
	Para->CT <<= 8;
	Para->CT += Data[0];
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E080000D_Write(u8* Data, MeasurePointStruct* Para)
{
	Para->PT = Data[1];
	Para->PT <<= 8;
	Para->PT += Data[0];
	return NO_ERROR;	
}


ResultEnum QCSG_AFN04_E080000F_Write(QCSGFrameProcessStruct* QCSGFp, u8* Data, MeasurePointStruct* Para)
{
	ResultEnum Result = NO_ERROR;
	Result += QCSG_AFN04_E0800000_Write(Data, Para);
	Data += 1;
	Result += QCSG_AFN04_E0800001_Write(Data, Para);
	Data += 1;
	Result += QCSG_AFN04_E0800002_Write(QCSGFp, Data, Para);
	Data += 6;
	Result += QCSG_AFN04_E0800003_Write(Data, Para);
	Data += 1;
	Result += QCSG_AFN04_E0800004_Write(Data, Para);
	Data += 1;
	Result += QCSG_AFN04_E0800005_Write(Data, Para);
	Data += 1;
	Result += QCSG_AFN04_E0800006_Write(Data, Para);
	Data += 1;
	Result += QCSG_AFN04_E0800007_Write(Data, Para);
	Data += 1;
	Result += QCSG_AFN04_E0800008_Write(Data, Para);
	Data += 1;
	Result += QCSG_AFN04_E0800009_Write(Data, Para);
	Data += 6;
	Result += QCSG_AFN04_E080000A_Write(Data, Para);
	Data += 1;
	Result += QCSG_AFN04_E080000B_Write(Data, Para);
	Data += 4;
	Result += QCSG_AFN04_E080000C_Write(Data, Para);
	Data += 2;
	Result += QCSG_AFN04_E080000D_Write(Data, Para);
	Data += 2;

	if(Result != NO_ERROR) 
	{
		Result = ERROR_InvalidData;
	}
	return Result;	
}



ResultEnum QCSG_AFN04_E0800010_Write(u8* Data, MeasurePointStruct* Para)
{
	if((Data[0] != 0x01) && (Data[0] != 0x03) && (Data[0] != 0x04)) return ERROR_InvalidData;
	Para->ConnectionType = Data[0];
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0800011_Write(u8* Data, MeasurePointStruct* Para)
{
	Para->RatedVoltage = Data[1];
	Para->RatedVoltage <<= 8;
	Para->RatedVoltage += Data[0];
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0800012_Write(u8* Data, MeasurePointStruct* Para)
{
	Para->RatedCurrent = Data[2];
	Para->RatedCurrent <<= 8;
	Para->RatedCurrent += Data[1];
	Para->RatedCurrent <<= 8;
	Para->RatedCurrent += Data[0];
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0800013_Write(u8* Data, MeasurePointStruct* Para)
{
	Para->UserDeclareCapacity = Data[1];
	Para->UserDeclareCapacity <<= 8;
	Para->UserDeclareCapacity += Data[0];
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0800014_Write(u8* Data, MeasurePointStruct* Para)
{
	Para->TransformerCapacity = Data[1];
	Para->TransformerCapacity <<= 8;
	Para->TransformerCapacity += Data[0];
	return NO_ERROR;	
}

