gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/QCSG_AFN04.c
ResultEnum QCSG_AFN04_E080001F_Write(u8* Data, MeasurePointStruct* Para)
{
	ResultEnum Result = NO_ERROR;
	Result += QCSG_AFN04_E0800010_Write(Data, Para);
	Data += 1;
	Result += QCSG_AFN04_E0800011_Write(Data, Para);
	Data += 2;
	Result += QCSG_AFN04_E0800012_Write(Data, Para);
	Data += 3;
	Result += QCSG_AFN04_E0800013_Write(Data, Para);
	Data += 2;
	Result += QCSG_AFN04_E0800014_Write(Data, Para);
	Data += 2;

	if(Result != NO_ERROR) 
	{
		Result = ERROR_InvalidData;
	}
	return Result;		
}


ResultEnum QCSG_AFN04_E0800021_Write(u8* Data, MeasurePointStruct* Para)
{
	MemCopy(Para->PassWord, Data, 8);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0800022_Write(u8* Data, MeasurePointStruct* Para)
{
	MemCopy(Para->UserName, Data, 8);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E080002F_Write(u8* Data, MeasurePointStruct* Para)
{
	ResultEnum Result = NO_ERROR;
	Result += QCSG_AFN04_E0800021_Write(Data, Para);
	Data += 8;
	Result += QCSG_AFN04_E0800022_Write(Data, Para);
	Data += 8;

	if(Result != NO_ERROR) 
	{
		Result = ERROR_InvalidData;
	}
	return Result;	
}


ResultEnum QCSG_AFN04_E0800100_E080020E(QCSGFrameStruct* SrcFrame, QCSGFrameStruct* DstFrame, QCSGFrameProcessStruct* QCSGFp)
{
	ResultEnum Result = NO_ERROR;
	u8* pData = &SrcFrame->Data[QCSGFp->SrcDataPos];
	u32 WriteLen = sizeof(PowerQualityParaStruct);
	PowerQualityParaStruct PowerQuality;
	MemSet((u8*)&PowerQuality, 0, sizeof(PowerQualityParaStruct));
	NAND_ReadMeasurePoint(QCSGFp->TempPn, QCSGFp->CurDataID, (u8*)&PowerQuality, &WriteLen);
	switch(QCSGFp->CurDataID)
	{
		case 0xE0800100:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E0800100_Write(pData, &PowerQuality);
			break;
		case 0xE0800101:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E0800101_Write(pData, &PowerQuality);			
			break;
		case 0xE0800102:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E0800102_Write(pData, &PowerQuality);
			break;
		case 0xE0800103:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E0800103_Write(pData, &PowerQuality);
			break;
		case 0xE0800104:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E0800104_Write(pData, &PowerQuality);
			break;
		case 0xE0800105:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E0800105_Write(pData, &PowerQuality);
			break;
		case 0xE0800106:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E0800106_Write(pData, &PowerQuality);
			break;
		case 0xE0800107:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E0800107_Write(pData, &PowerQuality);			
			break;
		case 0xE0800108:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E0800108_Write(pData, &PowerQuality);
			break;
		case 0xE0800109:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E0800109_Write(pData, &PowerQuality);
			break;
		case 0xE080010A:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E080010A_Write(pData, &PowerQuality);
			break;
		case 0xE080010B:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E080010B_Write(pData, &PowerQuality);
			break;
		case 0xE080010C:
			QCSGFp->SrcDataPos += 8;
			Result = QCSG_AFN04_E080010C_Write(pData, &PowerQuality);
			break;
		case 0xE080010F:
			QCSGFp->SrcDataPos += 32;
			Result = QCSG_AFN04_E080010F_Write(pData, &PowerQuality);
			break;
		case 0xE0800200:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E0800200_Write(pData, &PowerQuality);
			break;
		case 0xE0800201:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E0800201_Write(pData, &PowerQuality);			
			break;
		case 0xE0800202:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E0800202_Write(pData, &PowerQuality);
			break;
		case 0xE0800203:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E0800203_Write(pData, &PowerQuality);
			break;
		case 0xE0800205:
			QCSGFp->SrcDataPos += 18;
			Result = QCSG_AFN04_E0800205_Write(pData, &PowerQuality);
			break;
		case 0xE0800206:
			QCSGFp->SrcDataPos += 1;
			Result = QCSG_AFN04_E0800206_Write(pData, &PowerQuality);
			break;
		case 0xE0800207:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E0800207_Write(pData, &PowerQuality);			
			break;
		case 0xE0800208:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E0800208_Write(pData, &PowerQuality);
			break;
		case 0xE0800209:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E0800209_Write(pData, &PowerQuality);
			break;
		case 0xE080020A:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E080020A_Write(pData, &PowerQuality);
			break;
		case 0xE080020B:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E080020B_Write(pData, &PowerQuality);
			break;
		case 0xE080020C:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E080020C_Write(pData, &PowerQuality);
			break;
		case 0xE080020D:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E080020D_Write(pData, &PowerQuality);
			break;
		case 0xE080020E:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E080020E_Write(pData, &PowerQuality);
			break;
		default:
			QCSGFp->SrcDataPos = QCSGFp->UserDataLen;
			Result = ERROR_NoSuchDataID;
			break;			
	}

	if((Result == NO_ERROR) && (WriteLen != 0))
	{
		Result = NAND_WriteMeasurePoint(QCSGFp->TempPn, QCSGFp->CurDataID, (u8*)&PowerQuality, &WriteLen);
	}
	return Result;
}


ResultEnum QCSG_AFN04_E0800100_Write(u8* Data, PowerQualityParaStruct* Para)
{
	MemCopy((u8*)&Para->E0800100, Data, 2);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0800101_Write(u8* Data, PowerQualityParaStruct* Para)
{
	MemCopy((u8*)&Para->E0800101, Data, 2);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0800102_Write(u8* Data, PowerQualityParaStruct* Para)
{
	MemCopy((u8*)&Para->E0800102, Data, 2);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0800103_Write(u8* Data, PowerQualityParaStruct* Para)
{
	MemCopy((u8*)&Para->E0800103, Data, 2);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0800104_Write(u8* Data, PowerQualityParaStruct* Para)
{
	MemCopy((u8*)&Para->E0800104, Data, 2);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0800105_Write(u8* Data, PowerQualityParaStruct* Para)
{
	MemCopy((u8*)&Para->E0800105, Data, 2);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0800106_Write(u8* Data, PowerQualityParaStruct* Para)
{
	MemCopy((u8*)&Para->E0800106, Data, 2);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0800107_Write(u8* Data, PowerQualityParaStruct* Para)
{
	MemCopy((u8*)&Para->E0800107, Data, 2);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0800108_Write(u8* Data, PowerQualityParaStruct* Para)
{
	MemCopy((u8*)&Para->E0800108, Data, 2);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0800109_Write(u8* Data, PowerQualityParaStruct* Para)
{
	MemCopy((u8*)&Para->E0800109, Data, 2);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E080010A_Write(u8* Data, PowerQualityParaStruct* Para)
{
	MemCopy((u8*)&Para->E080010A, Data, 2);
	return NO_ERROR;	
}

