gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Task/QCSG_AFN04.c
ResultEnum QCSG_AFN04_E080010B_Write(u8* Data, PowerQualityParaStruct* Para)
{
	MemCopy((u8*)&Para->E080010B, Data, 2);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E080010C_Write(u8* Data, PowerQualityParaStruct* Para)
{
	MemCopy((u8*)&Para->E080010C, Data, 8);
	return NO_ERROR;	
}


ResultEnum QCSG_AFN04_E080010F_Write(u8* Data, PowerQualityParaStruct* Para)
{
	ResultEnum Result = NO_ERROR;
	Result += QCSG_AFN04_E0800100_Write(Data, Para);
	Data += 2;
	Result += QCSG_AFN04_E0800101_Write(Data, Para);
	Data += 2;
	Result += QCSG_AFN04_E0800102_Write(Data, Para);
	Data += 2;
	Result += QCSG_AFN04_E0800103_Write(Data, Para);
	Data += 2;
	Result += QCSG_AFN04_E0800104_Write(Data, Para);
	Data += 2;
	Result += QCSG_AFN04_E0800105_Write(Data, Para);
	Data += 2;
	Result += QCSG_AFN04_E0800106_Write(Data, Para);
	Data += 2;
	Result += QCSG_AFN04_E0800107_Write(Data, Para);
	Data += 2;
	Result += QCSG_AFN04_E0800108_Write(Data, Para);
	Data += 2;
	Result += QCSG_AFN04_E0800109_Write(Data, Para);
	Data += 2;
	Result += QCSG_AFN04_E080010A_Write(Data, Para);
	Data += 2;
	Result += QCSG_AFN04_E080010B_Write(Data, Para);
	Data += 2;
	Result += QCSG_AFN04_E080010C_Write(Data, Para);
	Data += 8;

	if(Result != NO_ERROR) 
	{
		Result = ERROR_InvalidData;
	}
	return Result;	
}


ResultEnum QCSG_AFN04_E0800200_Write(u8* Data, PowerQualityParaStruct* Para)
{
	MemCopy((u8*)&Para->E0800200, Data, 2);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0800201_Write(u8* Data, PowerQualityParaStruct* Para)
{
	MemCopy((u8*)&Para->E0800201, Data, 2);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0800202_Write(u8* Data, PowerQualityParaStruct* Para)
{
	MemCopy((u8*)&Para->E0800202, Data, 2);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0800203_Write(u8* Data, PowerQualityParaStruct* Para)
{
	MemCopy((u8*)&Para->E0800203, Data, 2);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0800205_Write(u8* Data, PowerQualityParaStruct* Para)
{
	if(BCD_Check(Data, 18) != NO_ERROR) return ERROR_InvalidData;
	MemCopy((u8*)&Para->E0800205, Data, 18);
//	if(Para->E0800205[0] >= 0x1000) return ERROR_InvalidData;
//	if(Para->E0800205[0] >= Para->E0800205[1]) return ERROR_InvalidData;
//	if(Para->E0800205[1] >= Para->E0800205[2]) return ERROR_InvalidData;
//	if(Para->E0800205[2] >= Para->E0800205[3]) return ERROR_InvalidData;
//	if(Para->E0800205[3] >= Para->E0800205[4]) return ERROR_InvalidData;
//	if(Para->E0800205[4] >= Para->E0800205[5]) return ERROR_InvalidData;
//	if(Para->E0800205[5] >= Para->E0800205[6]) return ERROR_InvalidData;
//	if(Para->E0800205[6] >= Para->E0800205[7]) return ERROR_InvalidData;
//	if(Para->E0800205[7] >= Para->E0800205[8]) return ERROR_InvalidData;
//	if(Para->E0800205[8] > 0x1000) return ERROR_InvalidData;
//	MemCopy((u8*)&Para->E0800205, Data, 18);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0800206_Write(u8* Data, PowerQualityParaStruct* Para)
{
	Para->E0800206 = Data[0];
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0800207_Write(u8* Data, PowerQualityParaStruct* Para)
{
	MemCopy((u8*)&Para->E0800207, Data, 2);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0800208_Write(u8* Data, PowerQualityParaStruct* Para)
{
	MemCopy((u8*)&Para->E0800208, Data, 2);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E0800209_Write(u8* Data, PowerQualityParaStruct* Para)
{
	MemCopy((u8*)&Para->E0800209, Data, 2);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E080020A_Write(u8* Data, PowerQualityParaStruct* Para)
{
	MemCopy((u8*)&Para->E080020A, Data, 2);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E080020B_Write(u8* Data, PowerQualityParaStruct* Para)
{
	MemCopy((u8*)&Para->E080020B, Data, 2);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E080020C_Write(u8* Data, PowerQualityParaStruct* Para)
{
	MemCopy((u8*)&Para->E080020C, Data, 2);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E080020D_Write(u8* Data, PowerQualityParaStruct* Para)
{
	MemCopy((u8*)&Para->E080020D, Data, 2);
	return NO_ERROR;	
}

ResultEnum QCSG_AFN04_E080020E_Write(u8* Data, PowerQualityParaStruct* Para)
{
	MemCopy((u8*)&Para->E080020E, Data, 2);
	return NO_ERROR;	
}
/*
//err20190403 ybwhz 自定义
ResultEnum QCSG_AFN04_E0AAAA00_E0AAAA05(QCSGFrameStruct* SrcFrame, QCSGFrameStruct* DstFrame, QCSGFrameProcessStruct* QCSGFp)
{
	ResultEnum Result = NO_ERROR;
	u8* pData = &SrcFrame->Data[QCSGFp->SrcDataPos];
	//u32 WriteLen = sizeof(PowerQualityParaStruct);
	//PowerQualityParaStruct PowerQuality;
	//MemSet((u8*)&PowerQuality, 0, sizeof(PowerQualityParaStruct));
	//NAND_ReadMeasurePoint(QCSGFp->TempPn, QCSGFp->CurDataID, (u8*)&PowerQuality, &WriteLen);
	switch(QCSGFp->CurDataID)
	{
		case 0xE0AAAA00:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E0AAAA00_Write(pData);
			break;
		case 0xE0AAAA01:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E0800101_Write(pData, &PowerQuality);			
			break;
		case 0xE0AAAA02:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E0800102_Write(pData, &PowerQuality);
			break;
		case 0xE0AAAA03:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E0800103_Write(pData, &PowerQuality);
			break;
		case 0xE0AAAA04:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E0800104_Write(pData, &PowerQuality);
			break;
		case 0xE0AAAA05:
			QCSGFp->SrcDataPos += 2;
			Result = QCSG_AFN04_E0800105_Write(pData, &PowerQuality);
			break;
		default:
			QCSGFp->SrcDataPos = QCSGFp->UserDataLen;
			Result = ERROR_NoSuchDataID;
			break;			
	}

	//if((Result == NO_ERROR) && (WriteLen != 0))
	//{
	//	Result = NAND_WriteMeasurePoint(QCSGFp->TempPn, QCSGFp->CurDataID, (u8*)&PowerQuality, &WriteLen);
	//}
	return Result;
}

ResultEnum QCSG_AFN04_E0AAAA00_Write(u8* Data)
{
	
}
*/


ResultEnum QCSG_Check_AFN04_DataID(u32 DataID, u16* Index)
{
    u32 i = 0; //, u16FnNum = 0;

    if((DataID & 0xFFFFFF00) == 0xE0000300)
    {
        //任务参数表格做了特殊处理
        DataID = 0xE00003FF;
    }
    if((DataID & 0xFFFFFF00) == 0xE0000400)
    {
        //任务参数表格做了特殊处理
        DataID = 0xE00004FF;
    }
    for(i = 0; i < MAX_AFN040A_IDENT_NUM; i++)
    {
        if(DataID == gc_stQCSGResolve_AFN04[i].u32Fn) break;
    }
    if(i >= MAX_AFN040A_IDENT_NUM)
    {
        return ERROR_NoSuchDataID;
    }
    *Index = i;
    return NO_ERROR;
}



ResultEnum CheckANF04Pn(u32 Pn)
{
	u32 i = 0, Bit1Cnt = 0;
	for(i = 0; i < 8; i++)
	{
		if((Pn & (1 << i)) != 0) Bit1Cnt++;
	}
	if(Bit1Cnt > 1) return ERROR_WRONG_ACCESS;
	return NO_ERROR;
}



/************************ (C) COPYRIGHT zhaoyun***********************END OF FILE****/


